{"title":"Sandboxie 3.52 Multilanguage + Patch (32-bit) [RH]","uid":6158360,"size":2557047,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:03075cc5533b80629eb907eceeea8dcd8b36bd30&amp;dn=Sandboxie+3.52+Multilanguage+%2B+Patch+%2832-bit%29+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RobbingHood","files":1,"time":1297119879,"description":"\n\n\n   .-._______                                                         _______.-.\n--( )_)______)     Sandboxie 3.52 Multilanguage + Patch (32-bit)     (______(_( )--\n (    ()___)                                                           (___()    )\n      ()__)                                                             (__()\n-(___()_)                                                                 (_()___)-\n\n\n-----------------------------------------------------------------------------------\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n-----------------------------------------------------------------------------------\n\nSandboxie Support Website for all Sandboxie Products &amp; all Sandboxie Cracks:   &lt;a href=&quot;\nhttp://www.sandboxie.com/index.php?HelpTopics&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sandboxie.com/index.php?HelpTopics&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the Sandboxie Support Team! \n\n\nThank you for choosing Sandboxie,\n\nThe Sandboxie Support Team\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n                   Sandboxie 3.52 Multilanguage + Patch (32-bit)\n\n\n\nRelease date Sandboxie version 3.52: 12 January 2011\n\n\nIncluded:\n*********\n1. Sandboxie 3.52 (32-64bit)\n2. Patch for Sandboxie 3.52 (32-bit only)\n3. Serial (90 days) for Sandboxie 3.52 (32-64bit) \n\n\nPatch Info:\n***********\nPatch by: Tonyblair &amp; Shajt\nPatch name: Patch_Sb.3.52_32bit\nPatch size: 644 kB (659.456 bytes)            \nRelease-Date patch: 17-Jan-11 \n\nChecksum of Patch.exe:                               \n[SHA-1] .: f41ed9b198ddcba3f9b49b82cb5ac36139f1877b                 \n[MD5] ...: 7f88d03f151ea880ac507bc0c02cd02a                                                   \n\n\n\nIntroducing Sandboxie:\n**********************\nTired of dealing with rogue software, spyware and malware? Spent too many hours \nremoving unsolicited software? Worried about clicking unfamiliar Web links?\n\nTry Sandboxie!\n\n\nSandboxie runs your programs in an isolated space which prevents them from \nmaking permanent changes to other programs and data in your computer. \n\nSandboxie lets you browse the Web securely while keeping all your browser's \nfunctionality for active content. Sandboxie requires neither the disabling nor \nblocking of functions available to Web sites through the browser. Instead, \nSandboxie isolates and quarantines the outcome of whatever the Web site may do \nto your computer, including the installation of unsolicited software. \n\nThere is no trade-off of functionality for security: the Web site can use the \nfull range of active content tools, and if it uses these tools maliciously to \ninstall software or otherwise make changes in your computer, then these changes \ncan be easily undone. \n\nSandboxie has originally been designed to increase the security of browsing with \nInternet Explorer, however it is just as effective with any other browser, and in \nfact, any other program. \n\nSandboxie wraps a protection layer around the programs it supervises. It is this \nlayer that intercepts and isolates any changes the programs make to the computer. \nAnd this layer is impartial to the specific program it wraps.\n\nSandboxie was designed as an application that will allow you to isolate and \nto quarantine website.\n\nWhen you browse the web, changes occur to your computer system. Most of the time \nthese changes are harmless, like recording the addresses of web sites you have \nvisited (and when), so the browser can help you complete a web address that you \ntype in. Whether these changes are harmless or harmful, they do in fact happen \nto your computer system. \n\nWhen you use Sandboxie to protect your browsing session, it catches all these \nchanges just as the browser is about to apply them into your computer system. \nSandboxie does record these changes on behalf of the browser, but it records \nthem in a special isolated folder, called the sandbox. \n\nThe benefit of having a sandbox is that it ensures your ability to get rid \nof all changes done by the browser, simply by deleting the sandbox folder. \n\nAnother useful feature of Sandboxie is the ability to terminate all sandboxed \nprograms at once. As some web sites tend to pop up three new browser windows \nfor each one you close, you can have Sandboxie close all of them with a click \nof a button.\n\n \nSandboxie and the Web\n*********************\nProtecting your Freecell statistics using Sandboxie may be a good idea when a \nless qualified player comes along, but you will probably want to play most of \nyour games outside the sandbox. On the other hand, you may want to run your Web \nbrowser inside the sandbox most of the time. This way any incoming, unsolicited \nsoftware (spyware, malware and the like) that you download, is trapped in the \nsandbox. Changes made to your list of Favorites or Bookmarks, hijacking of your \npreferred start page, new and unwanted icons on your desktop -- all these, and \nmore, are trapped in and bound to the sandbox.\n\n\nBenefits of the Isolated Sandbox\n********************************\n- Secure Web Browsing: Running your Web browser under the protection of Sandboxie \n  means that all malicious software downloaded by the browser is trapped in the \n  sandbox and can be discarded trivially. \n- Enhanced Privacy: Browsing history, cookies, and cached temporary files \n  collected while Web browsing stay in the sandbox and don't leak into Windows. \n- Secure E-mail: Viruses and other malicious software that might be hiding in \n  your email can't break out of the sandbox and can't infect your real system. \n- Windows Stays Lean: Prevent wear-and-tear in Windows by installing software \n  into an isolated sandbox. \n \n\nchanges Sandboxie v3.52\n***********************\nEnhancements and Revisions: \n- Improvements support involving Windows Side-by-Side assemblies installations. \n- Added support for a question mark character in Sandboxie settings \n  that is considered a single-character wildcard. \n- For third-party APIs: On 64-bit systems, the 32-bit DLL (SbieDllX) \n  has been renamed to SbieDll. \n- New translations: Greek, Portuguese (Portugal), and Arabic. \n\nProblems Fixed: \n- Fixed a problem with Forced Folders on 64-bit Windows. \n- Fixed a problem with the Sandboxie UAC confirmation window \n  overlapping the Windows task bar. \n- Fixed a conflict with the Immunize feature of Spybot-S&amp;D \n  which caused some slowdowns. \n\nImproved compatibility with: \n- Adobe Reader X in Protected Mode \n- Internal Flash player in recent versions of Google Chrome \n- Web Browser: Comodo Dragon \n- Proxies and Filters: NetNanny 6.5, ProxyCap, Super Socks5Cap \n- Utilities: Active Captions, Actual Window Manager, Arum Switcher, \n  Copernic Desktop Search, IntelliType Pro, ManyCam, RadeonPro \n- Security Software: Microsoft EMET tool, Norton 360, Norton Safe Web Lite \n- Virtual Machines: Running Sandboxie in a Windows system virtualized by Xen \n\n\nSystem requirements:\n********************\n- WinXP/Vista/Win7 (32-64bit)  \n- WinXP/Vista/Win7 (32-bit only when using the patch)\n  \n                      \nMore info:\n********** &lt;a href=&quot;\nhttp://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sandboxie.com/&lt;/a&gt;\n\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\n\n\n*** When using TPB please read these important notes: \n*****************************************************\n\n01. AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02. To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03. If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantaine then look at History or something similar).\n\n04. To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/4918844/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4918844/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/6091044/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/6091044/&lt;/a&gt;\n\n05. Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06. Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07. Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08. Clicking on unknown links can coz malware being silently installed on a pc!\n\n09. Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10. Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11. In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12. In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13. Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor visiting my TPB account:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n\nThis torrent is scanned with:\n1. Norton Internet Security \n2. Avira AntiVir Premium \n3. avast! Pro Antivirus\n4. Kaspersky Antivirus\n\nAlso scanned with some well known antispyware, and tested in Sandboxie.\nMalware detected by other anti-malware software probably are false positives!\n\n\n-----------------------------------------------------------------------------------\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate TPB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at February 07, 2011 - 21.45 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:03075cc5533b80629eb907eceeea8dcd8b36bd30","amp;dn":"Sandboxie+3.52+Multilanguage+%2B+Patch+%2832-bit%29+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03075cc5533b80629eb907eceeea8dcd8b36bd30","infoHashBuffer":{"type":"Buffer","data":[3,7,92,197,83,59,128,98,158,185,7,236,238,234,141,205,139,54,189,48]},"announce":[],"urlList":[]}}