{"title":"Whitney Houston - I Will Always Love You","uid":4576279,"size":164544516,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:030ce0184a3c962d7965ae7088029c22bc3f9f7e&amp;dn=Whitney+Houston+-+I+Will+Always+Love+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1229244461,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I Will Always Love You&quot; is a song released by American country singer-songwriter Dolly Parton (1974) and by American singer Whitney Houston(1992). Houston's version of the song became one of the best-selling singles of all time, and the best selling single ever by a female artist.\n\nIn 1991, singer Whitney Houston recorded the song for the soundtrack to The Bodyguard, her film debut. Houston was originally to record Jimmy Ruffin's &quot;What Becomes of the Brokenhearted&quot; as the lead single from The Bodyguard. However, when it was discovered the song was to be used for Fried Green Tomatoes, Houston requested a different song and her co-star Kevin Costner brought her Linda Ronstadt's 1975 version of &quot;I Will Always Love You&quot; from her album Prisoner in Disguise. Houston re-arranged the song as a soul ballad. Her record company did not feel a song with an a cappella introduction would be as successful, however, Houston and Costner insisted to maintain an a cappella intro.\n\nHouston's version was a massive worldwide success, selling over 12 million copies worldwide. It became a regular on countdown lists: appearing at number eight on VH1's &quot;100 Greatest Songs of the Past 25 Years&quot;; number four on &quot;VH1 100 Greatest Songs of the 90s&quot; and number one on VH1's &quot;100 Greatest Love Songs&quot;.\n\nThe song also lists at #68 on Billboard's Greatest Songs of all time.\n\nThe single's video, credited to Alan Smithee, begins with the performance of the song Houston gives at the end of The Bodyguard. The video then cuts to Houston in a dark blue suit sitting in an empty theater with the spotlight shining on her, singing of her love. The video is intercut with scenes from The Bodyguard.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:030ce0184a3c962d7965ae7088029c22bc3f9f7e","amp;dn":"Whitney+Houston+-+I+Will+Always+Love+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"030ce0184a3c962d7965ae7088029c22bc3f9f7e","infoHashBuffer":{"type":"Buffer","data":[3,12,224,24,74,60,150,45,121,101,174,112,136,2,156,34,188,63,159,126]},"announce":[],"urlList":[]}}