{"title":"D.L.Menard and the louisian aces in the de grotte beer in the ci","uid":6197271,"size":514948464,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0a0023afab973ff9f246c165f3c51cff93fb3d68&amp;dn=D.L.Menard+and+the+louisian+aces+in+the+de+grotte+beer+in+the+ci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flipp022","files":19,"time":1298484065,"description":"D.L.Menard and the louisian aces in the de grotte beer in the city leiden  - holland 1991-06-(15 +-)\n\nguest Eddie Lejeune\n &lt;a href=&quot;\nhttp://www.acadianmuseum.com/legends.php?viewID=108&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.acadianmuseum.com/legends.php?viewID=108&lt;/a&gt;\n\nI send 5 cd's to Warren Perrin, President of CODOFIL, one cd for Hillary Rodham  Clinton,\none cd for Warren Perrin , one cd for D.L.Menard, and one cd for my friend Bill Clinton,\nand one cd for the acadianmuseum in Louisiana.\n\n\n\n\nthis a sound upgraden \n\nrecorded in 1991-06-(15 +-)(exact date unknown) \n\ntaped by Ane (flipp022) live\n\nrecorder sony-DAT TCD-D3\n\n\nmicrofoon homemade \n\nAudience recording\n\nflac level&gt; 6\n\nThe sound quality is outstanding\n\nthe sound is very good hifi stereo ++++++++++++++++++++++++++++++\n\nsetlist\n\n1) Bayou Pon Pon  \n2) En Bas Du Chene Vert (onder een groene Oak Tree)   \n3) Flammes d'Enfer (de vlammen van de hel)     \n4) Bachelor's Life  \n5) Het hart van de stad     \n6) Lacassine Special   \n7) Eunice Stap Twee   \n8) De fout die ik gemaakt   \n9) (?) Fiddle tune   \n10) Mag je nooit alleen Be Like Me \n11) La Porte Du ArriÃƒÂ¨re (de achterdeur)     \n12) Diggy Diggy Lo      \n13) Convict Waltz   \n14) J'ai Ete Au Bal (Ik ging naar de Dance)   \n15) Big Texas.\n\n\nspecial on dime - D.L.Menard and the louisian aces - LIVE- this is a document\n\n\nGuitarist and songwriter D.L. Menard is a local legend in the bayou country. &quot;The Cajun Hank Williams,&quot; he started out as a country singer, the guy who would sing the latest English-language hits in between the older French numbers. In his teens, though, he met Hank Williams at a local show, and Williams told him he should be proud of his own culture and play his own music. Menard reacted by reshaping Williams's &quot;Honky Tonk Blues&quot; into the most popular Cajun song since &quot;Jole Blon,&quot; the picaresque &quot;La Porte En Arriere,&quot; or &quot;The Back Door.&quot; That was back in the early 1950s, and over the next four decades Menard has written hundreds of songs, all in French and illuminated by his keen insight and sure lyrical touch. He is also a popular bandleader, the finest old-time entertainer in Cajun music. His shows are a mix of irresistably danceable music, heart-wrenching vocals, and strings of weird non-sequitors and off-beat philosophizing. \n       River of Song filmed Menard in his back yard, hosting a crawfish feast along with his regular band and two of the finest young players in the field, the traditional accordion master and singer Robert Jardell and guitarist and singer Christine Balfa, whose father Dewey started the modern Cajun renaissance and who now leads the popular Balfa Toujours. \n\n\n\nD. L. Menard\nInducted on April 14, 2001 \n D. L. (Doris Leon) Menard was born April 14, 1932 in Erath, Louisiana. The only child of Acadian farmers, Menard worked in the cane fields and the cotton fields of south Louisiana as a young child. At night, he would listen to an old battery powered wooden radio and tune in country stations from Del Rio, Texas and KWKH in Shreveport, Louisiana, home of the then famous &quot;Louisiana Hayride.&quot;\n\nHe learned to sing country tunes in English long before he sang in French. His father was a popular harmonica player and his uncle played guitar. Menard purchased his first guitar from a Sears Roebuck catalogue when he was 16 years old and asked a member of his uncle's band to teach him how to play basic chords. A year later, he played his first Cajun dance for pay at the Palombo Night Club in Abbeville, Louisiana. He has been playing music and writing songs ever since.\n\nIn 1951, the 19-year-old Menard had the opportunity to meet and talk to his long-time idol, Hank Williams Sr., at the Teche Club New Iberia when Williams performed there.\n\nWilliams encouraged Menard to be proud of his heritage and play his own type of music. Hank Williams Sr. told Menard, &quot;All music is good if it's yours.&quot; Those simple, yet profound words have stuck with Menard all of his life and have indeed proved to be very helpful.\n\nToday Menard is an accomplished guitarist, vocalist, songwriter and composer. He has visited 33 foreign countries such as France, Italy, Thailand, Norway, Brazil, Germany, Egypt and Japan due to the success of his best known song, &quot;The Back Door,&quot; or, as it is pronounced in French, La Porte en Arriere. \n\nFolklorist at the University of Louisiana at Lafayette, Dr. Barry Ancelet, has said that The Back Door is the most often played and recorded Cajun song. He has performed for Mayors, Governors, Ministers, Congressmen and Presidents.\n\nAs a goodwill ambassador, D.L. Menard has received some of the most important awards in music and culture, including a Grammy Music Award nomination for the &quot;Best Traditional Album&quot; in 1993. His Lifetime Achievement Award denotes Menard as a Master Traditional Artist whose influence on generations of Cajun musicians has been immeasurable. He is in the Louisiana Music Hall of Fame, and the Cajun Music Hall of Fame. In 1993, D. L. and his &quot;Louisiana Aces&quot; band received the Times Music Award. In 1994, he received The National Heritage Fellowship Award from the National Endowment for the Arts, their highest honor, along with ten thousand dollars, which was presented to him by First Lady, Hillary Rodham Clinton.\n\nWarren Perrin, President of CODOFIL said, &quot;D.L. has been a good will ambassador for the Cajuns of La. for many years. He possess all of those traits that people admire about our culture; dedication, humor, perserverance, intergrity, generosity and candor. His love of his culture is inspiring to all who know and love him.&quot; \n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:0a0023afab973ff9f246c165f3c51cff93fb3d68","amp;dn":"D.L.Menard+and+the+louisian+aces+in+the+de+grotte+beer+in+the+ci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0023afab973ff9f246c165f3c51cff93fb3d68","infoHashBuffer":{"type":"Buffer","data":[10,0,35,175,171,151,63,249,242,70,193,101,243,197,28,255,147,251,61,104]},"announce":[],"urlList":[]}}