{"title":"WWE Wrestlemania V (1989)  DVD-R  PAL","uid":4638999,"size":4680843264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ce13d271782317546a842a8aaf15bb7f2d5f451&amp;dn=WWE+Wrestlemania+V+%281989%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Coolguy33","files":-1,"time":1231654098,"description":"WrestleMania V (1989)\n\nDVD Release date 04-04 (2005) (USA)\n\n\nWorld Wrestling Entertainment\nDate April 2, 1989 \nAttendance 18,946 \nVenue Trump Plaza \nCity Atlantic City, New Jersey \n\n\nWrestleMania V was the fifth annual WrestleMania professional wrestling pay-per-view event produced by the World Wrestling Federation (WWF). It took place on April 2, 1989 at the Trump Plaza in Atlantic City, New Jersey. The event was commentated by Gorilla Monsoon and Jesse Ventura.\n\nThe main event was Hulk Hogan versus Randy Savage for the WWF Championship billed &quot;The Mega Powers Explode&quot; which Hogan won after a leg drop. Featured matches on the undercard were Rick Rude versus The Ultimate Warrior for the WWF Intercontinental Championship, The Hart Foundation (Bret Hart and Jim Neidhart) versus Greg Valentine and The Honky Tonk Man and Demolition (Ax and Smash) versus Powers of Pain and Mr. Fuji in a handicap match for the WWF Tag Team Championship.\n\n\nThe main feud heading into WrestleMania was between Hulk Hogan and Randy Savage, with the two battling over the WWF Championship. At WrestleMania IV in March 1988, Savage defeated Ted DiBiase in a tournament final to win the vacant WWF Championship with help from Hogan. As a result, the duo formed a tag team known as The Mega Powers. They feuded with many heel tag teams throughout the entire year and were a successful team. Mega Powers ruled and dominated the WWF for 16 months. However, their domination and tag team began to breakup in early 1989. This all began on January 7, 1989 at Saturday Night's Main Event, Hogan was mercilessly beaten by The Twin Towers after his match with Akeem. Savage came out and cleared the ring with a steel chair. Elizabeth took Hogan to the backstage which angered Savage. He thought that he was a third wheel and this was the beginning of the breakup of Mega Powers as Savage was angry that why his wife Miss Elizabeth was used by Hogan as his manager. He confronted her about the issue but she took Hogan to the backstage. Problems increased further in the Royal Rumble match where Hogan accidentally eliminated Savage as he was trying to eliminate Bad News Brown. On February 3 at The Main Event, Hogan and Savage faced The Twin Towers (Akeem and The Big Boss Man) in a tag team match, filled with controversy. During the climax of the match, Akeem threw Savage and Hogan did not help Savage. Instead, when Akeem began taunting Elizabeth, Hogan came out to help her. Savage questioned what was happening but Hogan did not reply. Hogan picked and took her to the backstage. He was caring about Elizabeth while Savage was alone handling Twin Towers. When Hogan came back, Savage slapped him in the face and took the belt in his hand and turned heel by abandoning Hogan. Despite this, Hogan managed to pick up the win. This began a feud between the two. Hogan challenged Savage to a match for the WWF Championship at WrestleMania, which Savage accepted.\n\n\n\nRuntime:2hr 43min\nCountry:USA \nLanguage:English \nColor:Color \nAspect Ratio:1.33 : 1 \nDVD5\n\n","torrent":{"xt":"urn:btih:0ce13d271782317546a842a8aaf15bb7f2d5f451","amp;dn":"WWE+Wrestlemania+V+%281989%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ce13d271782317546a842a8aaf15bb7f2d5f451","infoHashBuffer":{"type":"Buffer","data":[12,225,61,39,23,130,49,117,70,168,66,168,170,241,91,183,242,213,244,81]},"announce":[],"urlList":[]}}