{"title":"Dexter.S01.E01 iPod- jB","uid":4516375,"size":112330743,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:0f17608870eb3298803dabd709751dcb69fa2eb1&amp;dn=Dexter.S01.E01+iPod-+jB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"J0N47H4N","files":1,"time":1226988145,"description":"Dexter\nSeason 1\nEpisode 1\n\n&quot;Dexter&quot;\n\nDexter Morgan leads a double life as a police forensics specialist of crime scenes by day, and a serial killer by night of criminals whom have gotten away with murder through legal technicalities. He hides his double life from his neurotic, foul-mouthed, vice squad sister Debra, his co-workers at the Metro Miami Police Department where he works, as well as his commitment-minded girlfriend, a troubled divorcÃƒÂ©e named Rita, who, like Dexter is mortally afraid of intimacy and sex. Dexter also as frequent flashbacks to his life with his late foster father Harry, a police detective, who gave Dexter his inspiration to act out his homicidal urges. But during an investigation of another murder scene, Dexter thinks he&amp;#039;s met his match when bodies left behind by a mysterious serial killer of prostitutes show no trace of blood on or in the bodies. Dexter is shown tracking down his victims, first a wealthy boys school director and pedophile/killer of three boys, as well as a hotel valet/serial rapist. Of his co-workers, Dexter gets along well with most of his co-workers whom are detective Angel Batista, the officious Lt. Maria Laguerta, but he frequently locks horns with the hot-tempered and misanthropic Sgt. James Doakes over their ability to investigate murder cases.","torrent":{"xt":"urn:btih:0f17608870eb3298803dabd709751dcb69fa2eb1","amp;dn":"Dexter.S01.E01+iPod-+jB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f17608870eb3298803dabd709751dcb69fa2eb1","infoHashBuffer":{"type":"Buffer","data":[15,23,96,136,112,235,50,152,128,61,171,215,9,117,29,203,105,250,46,177]},"announce":[],"urlList":[]}}