{"title":"Solaa - Steps In Time","uid":5612052,"size":88647712,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:109aa051b999531c8b4b559ffd3eea33d11c19e2&amp;dn=Solaa+-+Steps+In+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nz_flyboy","files":10,"time":1275918927,"description":"Solaa are an independent band from New Zealand formed in 1997, taking in a range of contemporary urban music styles combined with jazz improvisation. Solaa's music is aimed at crossing socio-economic &amp; cultural divides. The sound they've developed is a unique fusion of electronic &amp; organic music, as anyone who's had the good fortune to hear them live will readily agree.\n\nRich in instrumentation, the music of Solaa bridges hip hop, breaks, funk, soul, r n' b &amp; Latin flavours, incorporating a rare diversity of musicianship that stems from each members' various musical backgrounds. Their combined experience in Jazz, Latin &amp; Classical music have enabled the group to draw the most out of their diverse styles, creating music that is lush in melody, harmony &amp; rhythm. This is entirely evident in their debut album, the simply gorgeous 'Steps In Time'.\n\nThis cultured slice of soulful hip hop and RnB is graced by some of NZ's finest vocalists, including Solaa's own chanteuse Nat Rose, alongside USOuljah, Hollie Smith, Ladi6, Tyra Hammond [Opensouls], Cherie Mathieson &amp; more.\n\nIf you like this album- please support New Zealand music &amp; artists by buying the CD or seeing Solaa live.\n\n100% New Zealand Music","torrent":{"xt":"urn:btih:109aa051b999531c8b4b559ffd3eea33d11c19e2","amp;dn":"Solaa+-+Steps+In+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109aa051b999531c8b4b559ffd3eea33d11c19e2","infoHashBuffer":{"type":"Buffer","data":[16,154,160,81,185,153,83,28,139,75,85,159,253,62,234,51,209,28,25,226]},"announce":[],"urlList":[]}}