{"title":"Tayu","uid":4815381,"size":149080225,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:118fcf1f62473ec70116ef3c95251907859841e4&amp;dn=Tayu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kelleydv","files":11,"time":1238523735,"description":"Many Rivers is now making available select recordings from its popular Thursdays at Many Rivers speaking series as well as recordings of special events. Talks are available in MP3 format for downloading and playing with popular media software such as Windows Media Player and Real Player. All MP3s are copyrighted 2006 - 2008 by Tayu Order, Inc. \n\nCheck www.manyriversbooks.com for recent archives as well as talks by many other guest speakers.\n\n\nTAYU MEDITATION CENTER\n\nTayu Meditation Center is a Fourth Way spiritual school, founded in 1976 by Tayu Teacher Robert Daniel Ennis. It is located on a small farm in the wine country of Northern California, near the town of Sebastopol in Sonoma County.\n\nTHE FOURTH WAY\n\nThe Fourth Way is an ancient system of spiritual development, brought to the West by G.I.Gurdjieff. It is so named because unlike most spiritual traditions which engage only one center of the human organism at a time, the Fourth Way addresses all three simultaneously. More intense in the beginning, it is ultimately more efficient, and has aptly been called &quot;the sly Way&quot;.\n\nTHE WAY OF TAYU\n\nThe primary Tayu practice is a special form of meditation called Self-observation, designed for those born in Western culture. It focuses the awareness in turn on each of the three major centers of the human organism - the motor/instinctive, emotional, and intellectual. Sincerely engaged in, it reveals the true nature and inner workings of the human organism, and opens the way to full and continuous access to True Mind.\n\n\n","torrent":{"xt":"urn:btih:118fcf1f62473ec70116ef3c95251907859841e4","amp;dn":"Tayu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"118fcf1f62473ec70116ef3c95251907859841e4","infoHashBuffer":{"type":"Buffer","data":[17,143,207,31,98,71,62,199,1,22,239,60,149,37,25,7,133,152,65,228]},"announce":[],"urlList":[]}}