{"title":"Conan 2014 04 14 Mindy Kaling","uid":10029333,"size":143378456,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:12f49ab7d10a03f48434b53bee4e320a65dec600&amp;dn=Conan+2014+04+14+Mindy+Kaling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheLathe","files":1,"time":1398310970,"description":"Don't expect this to be pristine quality please.\n\nFrustrated that this hadn't been uploaded, I used Hola! unblocker to access the CTV site and capture this episode using Fraps. (Downloading addons failed when I tried to use them at CTV.ca)\n\nI then edited out the pauses and other problematic bits to produce this final copy, which I then encoded down to a very small file size at about dvd quality resolution. You will find that this is not a high quality download as I don't usually do this, but since this episode was nowhere to be found I wanted to share this with the Conan fans who rely on torrents to watch this great show.\n\nSome frames have been dropped due to the nature of CTV's ad-riddled video player and the playback controls sometimes appear on screen for brief moments. There is also a short freeze in the video during the Colin Hanks interview. I had to leave it in to keep the sound in sync as I had no clean footage to replace it with. Overall however the watchability is still quite good.\n\nIt may not be the best quality but at least those of you who collect every ep like myself can add this to your stash if you can stand the long download time. (I have slow upload speed - So please seed when you're done downloading) Enjoy!\n","torrent":{"xt":"urn:btih:12f49ab7d10a03f48434b53bee4e320a65dec600","amp;dn":"Conan+2014+04+14+Mindy+Kaling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f49ab7d10a03f48434b53bee4e320a65dec600","infoHashBuffer":{"type":"Buffer","data":[18,244,154,183,209,10,3,244,132,52,181,59,238,78,50,10,101,222,198,0]},"announce":[],"urlList":[]}}