{"title":"Breaking Cinavia DRM (PS3 3.60 Tested)","uid":6714903,"size":1639,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:134ad96e5aab23a3402830976a08aa0e14b45489&amp;dn=Breaking+Cinavia+DRM+%28PS3+3.60+Tested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Twiddler_13","files":1,"time":1317504091,"description":"If i put this in a blog then it won't last long, in fact if i put this anywhere it won't last long but if it's a torrent it should last a lot longer than any other way.\n\nKeywords (for google to pickup as people will be looking): 3.60 Cinavia DRM How To Crack Bypass Black Screen No Audio PS3 Blu-Ray MKV2VOB MKVMerge 2.4.9 2.4.8 Older Versions Version Play Movie Playing Doesn't Work Broken Problem Issues\n\n\nThe new Cinavia cancer now doesn't even display that it's causing you problems it just will show a black screen on your movie which they think will of course make you give up (and i almost did)\n\nBut after searching for a few hours i discovered a post that i thought i'd try one last time because i could just watch it on my laptop but i really preferred watching it on my PS3 especially since i have 5.1 surround sound to play through.\n\nAlso you don't need to download the torrent as all the information will be here (but please do because it keeps the torrent alive and is also good for later reference if you forget what was put here)\n\n1. Download the Latest mkv2vob, for me it is version 2.4.9\n2. File Splitting: FAT32 (4GB)\n3. Video Transcoding: Never (Ignore the Warning)\n4. Tick &quot;Always Transcode DTS&quot;\n\nThe other settings should be default.\n\nThis worked for me on my final try after a few hours of converting and testing, i thought i'd share this information as for me it was hard to come by and i didn't even know that Cinavia was causing the problem until i researched more and found out that they are using black screens in an attempt to fool you into thinking it's something wrong with the file etc.\n\n","torrent":{"xt":"urn:btih:134ad96e5aab23a3402830976a08aa0e14b45489","amp;dn":"Breaking+Cinavia+DRM+%28PS3+3.60+Tested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"134ad96e5aab23a3402830976a08aa0e14b45489","infoHashBuffer":{"type":"Buffer","data":[19,74,217,110,90,171,35,163,64,40,48,151,106,8,170,14,20,180,84,137]},"announce":[],"urlList":[]}}