{"title":"The.Nature.Of.Things-One_Ocean.Part1.2010.HDTV.XviD-YT","uid":5414167,"size":366622213,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:13828841a373c47fa3eb5c6e66979b59e4922feb&amp;dn=The.Nature.Of.Things-One_Ocean.Part1.2010.HDTV.XviD-YT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TvTeam","files":29,"time":1267851946,"description":". \n &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt; - Your Key To The Scene.\n &lt;a href=&quot;\nhttp://www.torrentday.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentday.com&lt;/a&gt; :  Clean RAR Scene Releases!\n\n\nEnjoy =)\n\n...................................NFO:....................................\n\n.                                                                                  \n                                                                                  \n                                                                      \n                                                                \n                                                            \n                                                       \n                                                    \n                                                    \n                                                    \n                                                    \n                                                   \n                                                    \n                                                      \n                                                       \n                                                       \n                                                           \n                                                             \n                                                               \n                                                                   \n                                                                      \n                                                                         \n                                                                            \n                                                                               \n                                                                                 \n                                                                                  \n   _______________________________________________________________________________\n\n\n                 The.Nature.Of.Things-One_Ocean.Part1.2010.HDTV.XviD-YT\n\n      Country     : CA\n      Language    : English\n      Network     : CBC\n      Pack Date   : 2010-03-05\n      Length      : 00:44:25\n      Video       : 967 kbps XviD MPEG-4\n      Audio       : 119 kbps 48KHz 2ch MP3\n      Resolution  : 624x352\n      Scan        : Progressive\n      Framerate   : 29.970\n      Size        : 350 MB\n\n    [ Release Notes ]\n\n      Episode 1: Description\n\n      We live on a planet that is almost all ocean - a water planet that is\n      unique among the cosmos.\n\n      The ocean is what transformed the Earth into the livable, blue planet\n      it is today. However, in the earths earliest history there was no ocean\n       it was a red-hot planet of molten magma flashing through space.\n\n      Where did all this water come from and how has the ocean shaped this\n      planet over the last 4 billion years? The first episode in the One\n      Ocean series, The Birth of an Ocean, reveals the transformative power\n      of the ocean on this planet  and how the ocean drives everything on\n      the Earth - from our temperate climate, to the air we breath to the\n      land we walk on. No living creature could be here today if this\n      dramatic event had never taken place.\n\n      The ocean changed our atmosphere by slowly filling it with life-giving\n      oxygen. Peter Ward, a paleontologist with the University of Washington,\n      takes us to Shark Bay in Western Australia to discover stromatolites \n      an incredible bacterial formation which helped fill the ocean and later\n      the atmosphere with oxygen.\n\n      Oxygen would change everything by allowing multi-cellular life to evolve\n      and then flourish in the watery depths. The Birth of an Ocean explores\n      how a deadly chain of events was put into motion that caused oxygen to\n      all but disappear from the ocean and atmosphere, launching a mass\n      greenhouse extinction. As it turns out, most of the mass extinctions\n      that have occurred were not caused by a massive asteroid, but by a tiny\n      bacterium!\n\n      The story of the ocean is the story of the beginning of life on the\n      planet, mass extinctions and astonishing survival in one of the most\n      beautiful and mysterious parts of the planet. One of the most astonishing\n      stories of endurance is that of the nautulis - a 500 million year old\n      living fossil - an incredible species that managed to survive all of the\n      mass extinctions. Its an incredible story of survival but what are the\n      adaptations and selective advantages that have allowed the nautilus to\n      survive for so very long?\n\n      The Birth of an Ocean joins paleontologist Ted Daeschler as he reveals\n      the secrets of the fossil Tiktaalik, the critical transitional species\n      that first crawled out of the ocean and onto land. We see just how much\n      of our own anatomy we share with this amazing creature.\n\n      Ted Daeschler Were looking at Tiktaalik, we're looking at an animal\n      that's really at the base of the branch of the tree of life that leads\n      to all limbed animals, and we're a limbed animal.\n\n      Ultimately The Birth of an Ocean reveals that the history of the ocean\n      is our own history and that today we are just beginning to understand\n      its complexity and the immense influence it has on the planet and our\n      own survival.\n\n      The series One Ocean is produced by CBCs the nature of things and\n      Merit Motion Pictures, in association with National Geographic Channels\n      International. The Birth of an Ocean is directed and written by Mike\n      Downie and produced by Tina Verma. The Series Producer is Caroline\n      Underwood and the Executive Producer is Michael Allder.\n\n      URL: http://oneocean.cbc.ca/\n\n   _______________________________________________________________________________\n\n                                    Yours truly","torrent":{"xt":"urn:btih:13828841a373c47fa3eb5c6e66979b59e4922feb","amp;dn":"The.Nature.Of.Things-One_Ocean.Part1.2010.HDTV.XviD-YT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13828841a373c47fa3eb5c6e66979b59e4922feb","infoHashBuffer":{"type":"Buffer","data":[19,130,136,65,163,115,196,127,163,235,92,110,102,151,155,89,228,146,47,235]},"announce":[],"urlList":[]}}