{"title":"Dr. Abdul Mawgoud Dardery: Muslim Perspective","uid":4744471,"size":160858884,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:14616c1c101c33ad620dc08381d63ff5c86811c0&amp;dn=Dr.+Abdul+Mawgoud+Dardery%3A+Muslim+Perspective&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1235759612,"description":"Dr. Abdul Mawgoud Dardery, the former Fulbright Scholar from Egypt, on the Muslim perspective and people. Moderated by Bishop Steven Charleston.\n\nRev. Steven Charleston - The Rt. Rev. Steven Charleston has retired as the president and dean of Episcopal Divinity School in Cambridge, MA, having served 1999-2008. The Rt. Rev. Steven Charleston has retired as President and Dean of Episcopal Divinity School (EDS) in Cambridge, Massachusetts, one of the historic theological seminaries training both lay and ordained leadership for the church. A citizen of the Choctaw Nation of Oklahoma, Bishop Charleston was born and raised in that state in a family that has had a long history of service in the Christian Native American community. Both his grandfather and great-grandfather were ordained ministers of the Presbyterian Church, serving among the Choctaw People in rural Oklahoma. Charleston received his Bachelor's degree in Religion from Trinity College in Hartford, Connecticut, in 1971. His Masters of Divinity was from EDS in 1976. He holds two honorary doctorates, one from Alaska Pacific University and the other from his alma mater, Trinity College. His vocation in the church has been extensive and varied. He was the national staff officer for Native American ministries in the Episcopal Church; he became the Director of the Dakota Leadership Program and developed alternative training models for indigenous laity and clergy on the many reservation communities of the Dakotas. Following this ministry, he became tenured professor in Systematic Theology at Luther-Northwestern Seminary in Saint Paul, Minnesota, and directed the creation of that school's cross-cultural studies program. Charleston became diocesan bishop of Alaska and served in this capacity for many years before returning to New England to become chaplain of his college in Hartford. He also served as the Assistant Bishop of Connecticut. Bishop Charleston is widely recognized as a leading proponent for justice issues and for spiritual renewal in the church in both the United States and Canada. He has been called &quot;one of the best preachers in the Episcopal Church,&quot; leading worship services ranging from a revival style service in Texas to Lenten Services at Harvard. He is featured in Trinity Church Wall Street's video, Good News: A Congregational Resource for Reconciliation and in Every Voice Network's Via Media tool for evangelism. Bishop Charleston has appeared on ABC World News Tonight, BBC World News, BBC Today Programme, The News Hour with Jim Lehrer, The O'Reilly Factor, and Hannity &amp; Colmes as well as on WRKO radio in Boston.\nDr. Abdul Mawgoud Dardery - Dr. Abdul Mawgoud Dardery is the former Fulbright Scholar from Egypt. He has 20 years of teaching in the US and in the Middle East.\n\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:14616c1c101c33ad620dc08381d63ff5c86811c0","amp;dn":"Dr.+Abdul+Mawgoud+Dardery%3A+Muslim+Perspective","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14616c1c101c33ad620dc08381d63ff5c86811c0","infoHashBuffer":{"type":"Buffer","data":[20,97,108,28,16,28,51,173,98,13,192,131,129,214,63,245,200,104,17,192]},"announce":[],"urlList":[]}}