{"title":"Lions of Darkness DVD - RESEED","uid":3819801,"size":4452436661,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:178525422075fd35a24f16b49a6e5569780c5fe8&amp;dn=Lions+of+Darkness+DVD+-+RESEED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"griffie","files":20,"time":1190765103,"description":"If you&amp;#039;ve recently downloaded this torrent from another site, please download this one and re-start it. It contains a new tracker that replaces the one currently down.\n\n&quot;Rarely before has the drama of life on the wild plains of Africa been portrayed more intimately than in this remarkable film from renowned wildlife filmmakers Dereck and Beverly Joubert. It&amp;#039;s the gripping story of a growing lion pride in Botswana that begins as three outsiders - young and aggressive - invade the pride&amp;#039;s territory and depose its aged leader. Their swift, merciless victory opens a new era for the pride. The eight lionesses soon give birth to their new leaders&amp;#039; cubs and there are young everywhere, feeding, playing and training for survival. But danger lurks behind virtually every bush, whether from ever-present hyenas or from a clever mongoose. One lonely cub, born late and orphaned early, endures hardships so heart-rending the filmmakers were tempted to intervene. But they decided to let nature run its unpredictable course. The result, captured on film forever, is the story of an incredible little cub&amp;#039;s struggle to survive. Join National Geographic on an up-close adventure to Africa, where two of the world&amp;#039;s best wildlife filmmakers reveal LIONS OF DARKNESS.&quot; \n\nOne of the best, if not the single best documentary done on lions. Excellent camera work and a made for the movie soundtrack complement the photographer&amp;#039;s passion for their work. \n\nDVD from Laserdisc. NTSC, English Spoken, no subtitles. Burn the files to a DVD for DVD player playback.","torrent":{"xt":"urn:btih:178525422075fd35a24f16b49a6e5569780c5fe8","amp;dn":"Lions+of+Darkness+DVD+-+RESEED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"178525422075fd35a24f16b49a6e5569780c5fe8","infoHashBuffer":{"type":"Buffer","data":[23,133,37,66,32,117,253,53,162,79,22,180,154,110,85,105,120,12,95,232]},"announce":[],"urlList":[]}}