{"title":"[Ipod] Are You Being Served?","uid":5405972,"size":13938346435,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:1b7886d2f4c4b818ec99f9032416797951eb4ffe&amp;dn=%5BIpod%5D+Are+You+Being+Served%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cocofey","files":69,"time":1267592889,"description":"This quintessentially British sitcom is about Grace Brothers, a department store in London which is owned and kept traditional, almost pre-war (e.g. precise dress code for ladies frills and gentlemen's hats according to rank), by two brothers who look old enough to have fought in the Boer war but rarely appear, as most scenes play on one floor where Mr. Cuthbert Rumbold is the executive (meaning he enjoys an endless parade of foxy but stupid secretaries) in charge of management while his dignified floor walker, Captain Stephen Peacock, has daily charge over two small sales teams. The fat and bossy, implicitly man-hungry widow Mrs. Betty Slocombe supervises the attractive Miss Shirley Brahms (with a terribly common Cockney accent) -with first choice of customers, on commission- the sale of women's clothes and accessories; the sales star at the gentleman's side is Mr. Wilberforce Clayborne Humpries, an implied closet-gay true gentleman, whose successive superiors are first obviously nearly retired Mr. Ernest Grainger and later formerly independent Mr. Grosman while the successive cheeky juniors are Mr. Dick Lucas and Mr. Bert Spooner. A regular visitor, and the only manual laborer but apparently best paid, is union representative Mr. Mash. Their interaction with each-other and the customers is quite formal in principle, but turns out comical in practice.\n\n\nMade For Ipod Classic 120G \n\nHope You like.\n\n-Coco","torrent":{"xt":"urn:btih:1b7886d2f4c4b818ec99f9032416797951eb4ffe","amp;dn":"%5BIpod%5D+Are+You+Being+Served%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b7886d2f4c4b818ec99f9032416797951eb4ffe","infoHashBuffer":{"type":"Buffer","data":[27,120,134,210,244,196,184,24,236,153,249,3,36,22,121,121,81,235,79,254]},"announce":[],"urlList":[]}}