{"title":"The Four Feathers 2002 (PAL to DivX convert) moviesbyrizzo","uid":6461716,"size":1136142615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b9e8e0b8c5492cd612b1a45be5e65675c52f749&amp;dn=The+Four+Feathers+2002+%28PAL+to+DivX+convert%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1307753730,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0240510/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0240510/&lt;/a&gt;\n\n720 X 576 1000k video bitrate, 192k audio\n\n\n&quot;God has endowed the British race with a worldwide empire - \nthat they may execute his sovereign purpose in the world.  \nThe victories you will have over the heathen are the victories\nof the nobler soul in man.&quot;  Powerful Quote from the movie script\n\n\nNote:\nConverted from a PAL DVD folder we found on the net some time ago.\nIt contained Polish subtitles only, however we did manage to find\nGerman, Italian, Danish, Finnish, Swedish, Romanian and Norwegian\nin addition to the Polish that was there to begin with. \nThat said, we had no luck finding matching subs for French, English\nor Dutch Im afraid to say. This is the PAL version, as I say once again.\n\nReviewer comment:\nThe aim of this movie to to provide a wake up call to those in the British camp\nmost of all to the horrors of the conflicts that are inflicted by attempting to\nintegrate masses that have no real basis of coming together in the first place in\nthe manner we see unfold in our world this present day, everywhere in our midst in\nfact - based on this newfound sense of idealism which lacks true virtue or sanity \nin fact. This movie shows the core differences that are plain enough to see.\n\nWe are in fact shown an image of a &quot;Jesus like&quot; saviour to the men of Africa,\nperhaps, in some way of looking at this picture, as he physically carries a \nhuge man of Africa on his back through the desert, to save him from his plight \nby show of sheer force of physical strenght and similar spirit too perhaps as to\nprovide  what is the energy he must require to pull it off. Oh well, live and\nlearn I suppose, I am not as yet and most certainly now convinced of the mans \nmerits to put it plainly.\n\n\nEnjoy!\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n ","torrent":{"xt":"urn:btih:1b9e8e0b8c5492cd612b1a45be5e65675c52f749","amp;dn":"The+Four+Feathers+2002+%28PAL+to+DivX+convert%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b9e8e0b8c5492cd612b1a45be5e65675c52f749","infoHashBuffer":{"type":"Buffer","data":[27,158,142,11,140,84,146,205,97,43,26,69,190,94,101,103,92,82,247,73]},"announce":[],"urlList":[]}}