{"title":"Little My Maid.rar","uid":4323349,"size":456416229,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:1bd5812484311b2a1914836b0c793eb45e0465ba&amp;dn=Little+My+Maid.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Arizth","files":1,"time":1217613076,"description":"You are Ouji Kamogawa, age 19. You were one of the brightest students in high school, considered by your teachers and parents to be a shoo-in for the best four-year universities. Unfortunately, your dreams of university came crashing to an end when you failed your entrance exams -- and lost your beloved Yukari at the same time.\n\nTime has passed. You&amp;#039;re enrolled in a cram school where you study for next year&amp;#039;s college entrance exams, but you&amp;#039;re unable to concentrate on your studies, so devastated are you by your break-up with Yukari. Ashamed of your lot, you wander to the seaside, where you enjoyed fun memories of your last summer with your lover.\n\nSuddenly, you hear a sweet voice, crying out for help. It&amp;#039;s a beautiful woman -- a young maid-in-training -- about to be subjected to a terrible fate at the hands of a band of hoodlums. Thinking fast, you are able to save her life.\n\n&quot;My name is Mari,&quot; she says, through her tears. &quot;I work as a maid at a nearby mansion. Please...let me repay your kindness.&quot;\n\nShe takes you to her mistress&amp;#039;s mansion, Sea Dragon Mansion, which overlooks the mist-shrouded seaside. There you encounter her two sisters, also maids-in-training: the proud and capable Hina and the delightfully cute Mayu-chan. You also meet the mysterious mistress of the mansion, Hime, and the cold trainer-of-maids, Aya.\n\nWelcomed as a guest, you choose to stay for a time in Sea Dragon Mansion. Aya coldly explains the rules of the house to you: you are the guest, and that means that the three maids will strive for your every pleasure. Ring one of the three bells to call any one of the three maids, and they will come and serve you in any way you please.\n\n\n\nBecause TPB needs more hentai.","torrent":{"xt":"urn:btih:1bd5812484311b2a1914836b0c793eb45e0465ba","amp;dn":"Little+My+Maid.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bd5812484311b2a1914836b0c793eb45e0465ba","infoHashBuffer":{"type":"Buffer","data":[27,213,129,36,132,49,27,42,25,20,131,107,12,121,62,180,94,4,101,186]},"announce":[],"urlList":[]}}