{"title":"Democracy Now - 24 jan 2011","uid":6124568,"size":449833364,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1c14cf9547f838b9fe2cfcd362ac78c3b8edc9e2&amp;dn=Democracy+Now+-+24+jan+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1295888518,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 24, 2011\n\n- Attorney: Manning Abuse Worsens; 2 Visitors Detained at Base\n- Fmr. Chicago Police Commander Sentenced to 4 Ã‚Â½ Years\n- Obama Unveils GE CEO as Top Economic Adviser\n- Rep. Giffords Transferred to Houston Rehab Hospital\n- Leaked Files Show PA Offered Israel East Jerusalem Annexation\n- Israeli Inquiry Clears Military, Gov't in Flotilla Attack\n- Thousands Protest U.S. Drone Strikes in Pakistan\n- Tunisian Police, Army Hold Solidarity Rally With Protesters\n- Anti-Gov't Protests Held in Yemen, Algeria\n- Duvalier Appeals for Public Support, Feels &quot;Sadness&quot; for Victims\n- Philadelphia Abortion Doctor Accused of Murdering Babies, Patient; Lax State Oversight Faulted\n- Drug Maker Stops Production of Anesthetic in Lethal Injections\n- Days After Comcast Takeover, Olbermann Leaves MSNBC\n\n\nSpecial reports\n\n- Rashid Khalidi: Leaked &quot;Palestine Papers&quot; Underscore Weakness of Palestinian Authority, Rejectionism of Israel and U.S.\n\nNewly-released documents show Palestinian negotiators agreed to give up large tracts of West Bank land, and nearly all of East Jerusalem, in peace talks with the Israeli government. The disclosure is among many contained in what is being called the &quot;Palestine Papers&quot;-over 1,700 files from inside Israeli-Palestinian negotiations dating from 1999 to 2010. The news network Al Jazeera began publishing details of the documents on Sunday. We speak with Columbia University professor, Rashid Khalidi.\n\n\n- &quot;The Black Power Mixtape&quot;-Danny Glover Discusses New Doc Featuring Rare Archival Footage of Angela Davis, Huey P. Newton, Stokely Carmichael\n\nWe broadcast from Park City, Utah, home of the Sundance Film Festival, the nation's largest festival for independent cinema. One of this year's selection that is creating a lot of buzz is a documentary called &quot;The Black Power Mixtape.&quot; The film features rare archival footage shot between 1967 and 1975 by two Swedish journalists and was discovered in the basement of Swedish public television 30 years later. We speak with renowned actor and activist Danny Glover who co-produced &quot;The Black Power Mixtape.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1c14cf9547f838b9fe2cfcd362ac78c3b8edc9e2","amp;dn":"Democracy+Now+-+24+jan+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c14cf9547f838b9fe2cfcd362ac78c3b8edc9e2","infoHashBuffer":{"type":"Buffer","data":[28,20,207,149,71,248,56,185,254,44,252,211,98,172,120,195,184,237,201,226]},"announce":[],"urlList":[]}}