{"title":"Terry Melcher - Same (1974) MP3@320kbps","uid":9622039,"size":83860633,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ce185f120f5d694cc1a979130bee36539c0e0c0&amp;dn=Terry+Melcher+-+Same+%281974%29+MP3%40320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"AaronVincent","files":12,"time":1392516836,"description":"On first listen Terry Melcher's 1974 solo debut is a glitzy and somewhat awkward country-rock effort, but with repeated exposure the underlying darkness and despair creeps up from behind the wall of pedal steel guitars. The professional sheen of the production contrasts with Melcher's unschooled but heartfelt voice, soaked most of the time with a pretty heavy echo effect. The band is comprised entirely of studio musicians, but the album remains intensely personal. The hired guns, after all, were some of Melcher's closest and most trusted friends and confidants, including Ry Cooder, Hal Blaine and Chris Hillman. The album deals directly with Terry's experiences in the L.A. pop/folk/country-rock scene and addresses a very specific audience that probably didn't exist outside of his immediate group of peers. It's difficult to imagine that he expected the record buying public to closely relate to the ode &quot;Beverly Hills,&quot; in which he disses inferior suburbs such as Brentwood and Pacific Palisades, and reminisces about the good old days of Î“Ã‡Â£dinner and some drinks at the Luau, Sunday brunch at Nate &amp; Al's.Î“Ã‡Â¥ Elsewhere, he complains that he &quot;can't even get along with (his) guru&quot; and implores his psychiatrist to help him &quot;come to grips&quot; even though he's unsure that the shrink will be any more helpful than his flirtations with Christianity and vegetarianism.\n\n\nA version of the Jackson Browne song &quot;These Days,&quot; famously covered by Nico, is one of the most gut-wrenching moments on the album. Accompanied by a sparse string arrangement and a harmonica that sounds straight out of a Morriccone score, Melcher sings the song as a duet with his mother. When he addresses the closing line to her, &quot;please don't confront me with my failures, I have not forgotten them,&quot; it is absolutely shattering. Terry also covers some pretty bleak Bob Dylan tunes. Two of them, in a medley near the end of the album, pretty much sum up Terry's position in life and in the music scene in 1974. &quot;They said they were my friends, but when I was down you know they all just sat there and they were grinning,&quot; he sings, paraphrasing the opening lines to &quot;Positively 4th Street,&quot; before he goes into a searing chorus of &quot;Like A Rolling Stone.&quot; He seems to be singing to the famous friends who weren't there for him during his time of need, but he could just as easily have been singing about himself. He knew better than anyone what it felt like to be &quot;like a complete unknown, like a rolling stone.&quot; It's an apt climax to this rich self-portrait of a once-great Hollywood record producer in the wake of his extremely unpleasant fall from grace.\n\nBy Rob Hatch-Miller (Dusted)\t\t","torrent":{"xt":"urn:btih:1ce185f120f5d694cc1a979130bee36539c0e0c0","amp;dn":"Terry+Melcher+-+Same+%281974%29+MP3%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ce185f120f5d694cc1a979130bee36539c0e0c0","infoHashBuffer":{"type":"Buffer","data":[28,225,133,241,32,245,214,148,204,26,151,145,48,190,227,101,57,192,224,192]},"announce":[],"urlList":[]}}