{"title":"Bugs Bunny &amp; Taz : TiME BUSTERS","uid":4762390,"size":671088843,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1cf7dcdb00f38ff23da9daff89c88f8220e11547&amp;dn=Bugs+Bunny+%26+Taz+%3A+TiME+BUSTERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"70R4N","files":2,"time":1236742201,"description":"Description :\n\nOn duty as the top pest controller for &quot;Jet Age Pest Control&quot; Daffy Duck accidentally breaks Granny's time regulator and is thrown back in time with the core of the machine, a precious gem. It's up to our heroes, Bugs Bunny and the Tasmanian Devil to bring back this gem and restore the time order.\n\n\nFeatures :\n\n* Experience original gameplay that allows you switch between Bugs and Taz.\n\n* Enjoy over 30 levels of sporting contests, quests, boss encounters and \n  dare devil chases.\n\n* Explore 4 exciting time periods : The Aztec Era, The Viking Era, The Arabian    \n  Nights and Transylvania.\n\n* Face off classic Looney Tunes adversaries like : Yosemite Sam, Elmer Fudd,Babba \n  Chop and Count Bloodcourt.\n\n\nSystem Requirements :\n\n* OS : Windows 95/98/Me/Xp (Vista - not tested)\n* Cpu : Pentium 233MHz\n* Video card : 8 MB\n* Ram :32 MB\n\n\n                Seed ! = Don`t blame me for your selfishness.\n\nHINTS :\n\n\nExtra life :\nWhen you win the Pelota game or any of the others you will get a coin of 25. Play again for an extra life. Play it two more times and you will get another extra life. Note: The Pelota game is easy when Taz is on the court.\n\nBorrowing health :\nWhen you are Bugs Bunny or Taz, hit the other character and they will cough up a carrot or two. You can use this trick to get extra health if you there are no carrots available or if you really need it.\n\nGet more carrots from smaller enemies :\nNormally you only can get three carrots when you jump on a enemy's head and then kick them. To get a few more carrots out of each small enemy, sneak up behind them and kick them a couple of times. Then, jump on their heads and kick them. This will give you a total of five or six carrots. Note: This cannot be done on monkeys.\n\nAztec Era: Eat Bugs Bunny :\nIn the Aztec Era, play as Taz and stand by Bugs Bunny. Wait a while and Taz will eat him. Note he will just take a bite, and not eat him completely.\n\nMoon Valley: Catapult :\nWhen in the Moon Valley level and you cannot get the catapult to work, there is another way. When near the second light, go up the little hill, jump on the anvil, then jump to the light. Note: You can only stay on the anvil for a short amount of time or you will fall off. This may take several attempts.\n\nTransylvania Era: Play as a monster :\nPut Bugs Bunny or Taz on the Transfer Machine. Then, have a monster chase you. Run towards the circle on the Transfer Machine. You will then be able to play as a monster. Note: You also have to make your character stand perfectly on a circle so you can swap brains.\n\nDefeating Yosemite Sam :\nWhen he gets in the room, run him around the place a little bit. He will eventually get tired and take a couple of breaths. While he is taking his breaths, kick him. His hat will get stuck on his face. This will give you time to grab the torch that he is holding. When you get the torch, place Taz near one of the blocks. Then, have Bugs jump on Taz's head to get up on the block. Flame the rope and do the same thing on the other blocks. After this is done the platform will fall on Yosemite Sam's head and Daffy Duck will automatically take the Time Gem and it will warp him to Elmer's Domain.\n\nDefeating Elmer Fudd :\nJump on the switches that will take down the statue that Elmer is standing on. When this is done, go nearby and he will try to hit you with his hammer. Dodge him and his hammer will get stuck in the cement. This will give you time to kick him, and he will drop his hammer. Hit the switches around the cage that holds the Time Gem. Do this to all the switches and the cage will break. Elmer will fall of the cliff and Daffy Duck will take the Time Gem and it will warp him to Babba's Cave.\n\nDefeating Babba :\nWhen Babba is chasing you, run him under one of the shadows. A huge chest of gold will fall on his head and he will be unconscious. Make sure Bugs is on one of the switches and the gong will turn towards you. Pick up Babba and throw him at the gong. Do this to all four gongs and you will defeat Babba. Daffy Duck will then pick up the Time Gem and warp him to Counts Castle.\n\n\n\n                  Seed ! = Don`t blame me for your selfishness...\n\n\n1. Full Install (select Recommended)\n\n2. Copy the folders &quot;SPEECH&quot; and &quot;BZE&quot; from the ISO/&quot;Datas&quot; folder in your HDD       \n   install (example:C:gamesBugs Bunny &amp; Taz - Time Busters)\n\n3. Copy the file &quot;BBLIT2&quot; from the CRACK folder , in your HDD where you installed \n   the game (example:C:gamesBugs Bunny &amp; Taz - Time Busters/bin)","torrent":{"xt":"urn:btih:1cf7dcdb00f38ff23da9daff89c88f8220e11547","amp;dn":"Bugs+Bunny+%26+Taz+%3A+TiME+BUSTERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cf7dcdb00f38ff23da9daff89c88f8220e11547","infoHashBuffer":{"type":"Buffer","data":[28,247,220,219,0,243,143,242,61,169,218,255,137,200,143,130,32,225,21,71]},"announce":[],"urlList":[]}}