{"title":"SpyStopper Pro 5.0","uid":3652886,"size":2776177,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d8f5ae10a535a17dd22035dcd10269d772ecc97&amp;dn=SpyStopper+Pro+5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"khiladi_420","files":2,"time":1175493947,"description":"\nThe Award Winning SpyStopper blocks spyware and adware to protect you from being profiled and tracked in real time. Deliver instant alerts for detected intrusive devices. When you are online, you may be monitored or tracked without your knowledge or explicit permission. Hackers and advertisers may use intrusive devices to gain access to your information and invade your privacy. SpyStopper Pro is designed to block those devices in real time and is the best choice for prevention.\n\nAn ounce of prevention is worth a pound of cure. In real time, SpyStopper Pro blocks spyware, Web bugs, worms, cookies, ads, scripts, phishing sites, and other intrusive devices to protect you from being profiled and tracked. When you are online, you may be monitored or tracked without your knowledge or explicit permission. Hackers and advertisers may use Web bugs, spyware, cookies, worms, ads, and scripts to gain access to your information and invade your privacy. SpyStopper Pro is designed to block those devices and phishing sites that are used without your knowledge. It functions like a firewall and block spyware and phishing sites from reaching your computer. Works with Windows 95/98/Me/NT/2000/XP.\n","torrent":{"xt":"urn:btih:1d8f5ae10a535a17dd22035dcd10269d772ecc97","amp;dn":"SpyStopper+Pro+5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d8f5ae10a535a17dd22035dcd10269d772ecc97","infoHashBuffer":{"type":"Buffer","data":[29,143,90,225,10,83,90,23,221,34,3,93,205,16,38,157,119,46,204,151]},"announce":[],"urlList":[]}}