{"title":"True.Blood.1x01.Uno.Strano.Incontro.ITA.DVDMux.XviD-NovaRip[volp","uid":4893972,"size":733712384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ea6086fa317b47d39bca174ad7622c71057bc56&amp;dn=True.Blood.1x01.Uno.Strano.Incontro.ITA.DVDMux.XviD-NovaRip%5Bvolp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Volpebianca","files":1,"time":1242213079,"description":".: Dati Serie :.\n\nTitolo: True Blood\nTitolo originale: True Blood\nGenere: drammatico, fantasy, horror\nEpisodi: 12\nDurata episodio: ~ 55 minuti\nTrasmesso in America: 7 settembre 2008\nTrasmesso in Italia: 27 aprile 2009\nCreatore: Alan Ball\nCast: Anna Paquin (Sookie Stackhouse), Stephen Moyer (Bill Compton), Sam Trammell (Sam Merlotte), Ryan Kwanten (Jason Stackhouse), Rutina Wesley (Tara Thornton), Chris Bauer (Andy Bellefleur), Nelsan Ellis (Lafayette Reynolds), Jim Parrack (Hoyt Fortenberry), Carrie Preston (Arlene Fowler), Michael Raymond-James (Rene Lenier), William Sanderson (Sceriffo Bud Dearborne), Lynn Collins (Dawn Green), Lois Smith (Adele Stackhouse)\n\n\n.: Trama :.\n\nLa serie, basata sulla serie di romanzi Southern Vampires della scrittrice Charlaine Harris, ÃƒÂ¨ ambientata in un futuro non ben precisato dove i vampiri e gli umani possono vivere assieme pacificamente, grazie ad un'invenzione rivoluzionaria di una ditta farmaceutica giapponese, che ha inventato uno speciale tipo di sangue sintetico di nome Tru Blood che puÃƒÂ² soddisfare i bisogni dei vampiri.\nOrmai sono due anni che vampiri e umani vivono gli uni accanto agli altri, pur se con difficoltÃƒÂ  e contrasti, e il centenario vampiro Bill Compton decide di trasferirsi a Bon Temps, una piccola e tranquilla cittadina della Louisiana dove puÃƒÂ² iniziare una nuova vita. Ben presto incontra Sookie, una cameriera che ha il dono di leggere nel pensiero delle persone. Sookie vive male il suo dono speciale, non sopportando l'idea di conoscere tutti i pensieri delle persone, ma quando si accorge di non poter sentire i pensieri di Bill, capisce che tra i due puÃƒÂ² nascere un legame speciale.\n\nL'integrazione tra vampiri e umani viene minata da una serie di misteriosi omicidi...","torrent":{"xt":"urn:btih:1ea6086fa317b47d39bca174ad7622c71057bc56","amp;dn":"True.Blood.1x01.Uno.Strano.Incontro.ITA.DVDMux.XviD-NovaRip%5Bvolp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ea6086fa317b47d39bca174ad7622c71057bc56","infoHashBuffer":{"type":"Buffer","data":[30,166,8,111,163,23,180,125,57,188,161,116,173,118,34,199,16,87,188,86]},"announce":[],"urlList":[]}}