{"title":"The.Dark.Knight.2008.avi","uid":4305945,"size":762758394,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f72c6e1f4923dc266d19151726841f027ebe2be&amp;dn=The.Dark.Knight.2008.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Smallville1981","files":1,"time":1216513058,"description":"This is a real copy its the vob files converted for easy use for everyone \n\nplse leave comments at end so people know this is real thanks\n\n\n\n\n\n\n\nBatman raises the stakes in his war on crime. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the city streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as The Joker. Written by Peteagassi \n\nWith just one year passed after taking out Ra\\\\\\&amp;#039;s Al Ghul\\\\\\&amp;#039;s plan to have Gotham eliminated and the mysterious disappearance of Dr. Jonathan Crane AKA the Scarecrow, after the city was nearly plundered with his toxins, Bruce Wayne and his vigilante alter-ego the Batman, continue the seemingly-endless effort to bring order to Gotham, with the help of Lt. James Gordon and newly appointed District Attorney Harvey Dent, but a new threat has now emerged into the streets. The Dark Knight faces a rising psychopathic criminal called The Joker, who\\\\\\&amp;#039;s eerie grin, laughter, and inhuman morality makes him more dangerous than what he has yet to unleash. It becomes an agenda to the Batman to stop the mysterious Joker at all cost, knowing that the both of them are in the opposite line. One with no method at all and seeks to see the world plunge into the fire he has yet to lit. One who represents the symbol of hope and uses his own shadow to bring the peace and order he has yet to accomplish on doing. Written by Anonymous \n\nSet within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman\\\\\\&amp;#039;s struggle against the Joker becomes deeply personal, forcing him to \\\\\\&quot;confront everything he believes\\\\\\&quot; and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes. Written by Leon Lombardi \n\n","torrent":{"xt":"urn:btih:1f72c6e1f4923dc266d19151726841f027ebe2be","amp;dn":"The.Dark.Knight.2008.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f72c6e1f4923dc266d19151726841f027ebe2be","infoHashBuffer":{"type":"Buffer","data":[31,114,198,225,244,146,61,194,102,209,145,81,114,104,65,240,39,235,226,190]},"announce":[],"urlList":[]}}