{"title":"Ricky Skaggs - From The Word Love  (2nafish)","uid":5184277,"size":106985476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2148beb83065ac22c682efbe8db0b7aa470f778a&amp;dn=Ricky+Skaggs+-+From+The+Word+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1259400023,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nRichard Lee &quot;Ricky&quot; Skaggs (born July 18, 1954, in Cordell, Kentucky) is a country and bluegrass singer, musician, producer, and composer. He primarily plays mandolin; however, he also plays fiddle, guitar, and banjo.\n\nRicky Skaggs started playing music after he was given a mandolin by his father, Hobert. At age 5, he played mandolin on stage with Bill Monroe. At age 6, he appeared on television's Martha White country music variety show, playing with Lester Flatt and Earl Scruggs. He also wanted to audition for the Grand Ole Opry at that time, but was told he was too young.\n\nIn his mid-teens, Skaggs met a fellow teen prodigy, guitarist Keith Whitley, and the two started playing together with Whitley's banjoist brother Dwight on radio shows. By 1970, they had earned a spot opening for Ralph Stanley and Skaggs and Keith Whitley were thereafter invited to join Stanley's band, the Clinch Mountain Boys\n\nSkaggs later joined J. D. Crowe's New South. For a few years, Skaggs was a member of Emmylou Harris's Hot Band. He wrote the arrangements for Harris's 1980 bluegrass-roots album, Roses in the Snow. In addition to arranging for Harris, Skaggs sang harmony and played mandolin and fiddle.\n\nInto the 1990s and 2000s, Skaggs has embraced his bluegrass roots, as well as experimenting with new sounds. With his band, Kentucky Thunder, he is a perennial winner of Grammy Awards and International Bluegrass Music Association for best bluegrass album.\n\n&quot;I always want to try to promote the old music, as well as trying to grow, and be a pioneer too,&quot; Skaggs once said.\n\nIn 2000, he shared the stage with Vermont-based jam band, Phish. On March 20, 2007, Skaggs released an album with rock musician Bruce Hornsby.\n\nIn 2007, Skaggs is slated to release an album he recorded with The Whites on his Skaggs Family Records label.\n\nIn 2008, Skaggs recorded a bluegrass version of &quot;Old Enough&quot; by the Raconteurs with Ashley Monroe and the Raconteurs. He played mandolin on the track as well as shared vocals with Jack White, Brendan Benson, and Ashley Monroe.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2148beb83065ac22c682efbe8db0b7aa470f778a","amp;dn":"Ricky+Skaggs+-+From+The+Word+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2148beb83065ac22c682efbe8db0b7aa470f778a","infoHashBuffer":{"type":"Buffer","data":[33,72,190,184,48,101,172,34,198,130,239,190,141,176,183,170,71,15,119,138]},"announce":[],"urlList":[]}}