{"title":"Hoola Bandoola Band - Jakten PÃƒÂ¥ Dalai Lama (Live GÃƒÂ¶teborg 1996","uid":4879384,"size":41484458,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2229abb2d15c8cc6d5a8e1158fbb2f70b104b3fc&amp;dn=Hoola+Bandoola+Band+-+Jakten+P%C3%83%C2%A5+Dalai+Lama+%28Live+G%C3%83%C2%B6teborg+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RosaMannen","files":1,"time":1241298884,"description":"Hoola Bandoola Band was, together with Nationalteatern, the biggest band of the Swedish progg movement. And where Nationalteatern put social realistic lyrics to rock songs, Hoola Bandoola had more political lyrics and swerved further from traditional rock.\n\nThe name is inspired by a fictional language spoken by ants in a Donald Duck short cartoon, most likely &quot;Tea for Two Hundred&quot;, directed in 1948 by Jack Hannah, with ant language spoken by Pinto Colvig.\n\nThe band was formed in 1970. In 1971, they had their first radio hit and were immediately contacted by two record companies, one commercial and one alternative, MNW. In the political climate of the 1970s, the choice of side was crucial, and by choosing the alternative company, Hoola Bandoola came to be the most well-known band on the alternative side in Sweden.\n\nTheir debut in 1971, Garanterat individuell, (Guaranteed to be individual) was hailed as the start of a new era for Swedish pop and was elected the album of the year. It was not overly political when it came to lyrics, but on the second album Vem kan man lita pÃƒÂ¥?, (Who can you trust?) released the next year, the socialist message was clearer. It still sold very well and included long-lasting hits like Keops pyramid.\n\nWith PÃƒÂ¥ VÃƒÂ¤g, (On the way) recorded with a balalaika orchestra, Hoola Bandoola became one of the best-selling groups in Sweden. In 1975 they released the fourth album Fri information (Free information), where the socialist message was more outspoken than ever before. And this time, Afzelius had written half of the songs, where before it had been Wiehe writing almost everything.\n\nIn 1975, the alternative movement gathered in opposition to a tennis game played between Sweden and Chile, which at the time was under the military dictatorship of Pinochet, and for that event, Hoola Bandoola released Stoppa matchen (Stop the game) as a single. This was to be their last studio recording. In 1976, the band broke up and Wiehe and Afzelius started very successful careers as singer/songwriters, both together and by themselves.\n\nAfter 20 years' absence, Hoola Bandoola reunited in 1996, playing warmup for Bob Dylan and going on their own nationwide tour playing over 50 shows with a total over 200.000 people attending the tour. Recordings from this tour was released in 1999 after the death of BjÃƒÂ¶rn Afzelius on the album FÃƒÂ¶r dom som kommer sen (For those who come later). Each year on the anniversary of Afzelius death an award is given out to a person who has &quot;done work in the spirit of BjÃƒÂ¶rn Afzelius&quot;.\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:2229abb2d15c8cc6d5a8e1158fbb2f70b104b3fc","amp;dn":"Hoola+Bandoola+Band+-+Jakten+P%C3%83%C2%A5+Dalai+Lama+%28Live+G%C3%83%C2%B6teborg+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2229abb2d15c8cc6d5a8e1158fbb2f70b104b3fc","infoHashBuffer":{"type":"Buffer","data":[34,41,171,178,209,92,140,198,213,168,225,21,143,187,47,112,177,4,179,252]},"announce":[],"urlList":[]}}