{"title":"Terra.Formars.S01E06.1080p.WEBRip.x264-ANiHLS","uid":11367448,"size":567100836,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:23ded1f0543a352224a5be96a0e29100496688a6&amp;dn=Terra.Formars.S01E06.1080p.WEBRip.x264-ANiHLS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xKTRx","files":-1,"time":1415056655,"description":"Terra.Formars.S01E06.1080p.WEBRip.x264-ANiHLS\n\n\nIn an attempt to colonize Mars, 21st century scientists were tasked with warming up the planet so that humans could survive on its surface. They came up with an efficient and cost effective plan of sending cockroaches and mold to the surface so that the mold would absorb the sunlight and purify the atmosphere, while feeding the insects whose corpses would help the mold spread throughout the planet.\n\nFive hundred years later, the first manned ship to Mars lands on the planet and the six crew members are attacked by giant mutated humanoid cockroaches with incredible physical strength later labeled as Terraformars. Before the crew members are easily wiped out, they manage only to send a transmission back to Earth. Decades later, a multinational expedition is sent to exterminate the mutated bugs and take control of the planet just to be wiped out as well, except for two survivors who managed to return to Earth, with one of them swearing to one day return to Mars and avenge their fallen companions. As a third expedition is assembled, questions are raised about the true origin of the Terraformars and their connection with a mysterious disease that is afflicting mankind back on Earth.\n\nTo fight the Terraformars' strength and agility, the members of the second and third expedition undergo genetic modification to inherit the characteristics of other organisms, only possible after having a special organ implanted inside their bodies with only a 30% chance of surviving the surgery","torrent":{"xt":"urn:btih:23ded1f0543a352224a5be96a0e29100496688a6","amp;dn":"Terra.Formars.S01E06.1080p.WEBRip.x264-ANiHLS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ded1f0543a352224a5be96a0e29100496688a6","infoHashBuffer":{"type":"Buffer","data":[35,222,209,240,84,58,53,34,36,165,190,150,160,226,145,0,73,102,136,166]},"announce":[],"urlList":[]}}