{"title":"Death Note Vol 1","uid":4301589,"size":7463069696,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:251d7cd92fe01ef785e9384cdd4196bf22fbb91a&amp;dn=Death+Note+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheeMalevolent","files":16,"time":1216332069,"description":"Death Note: Vol. 1  -English\n\n\n\n\n\n\n\nProduct Description\nMeet Light Yagami, a brilliant but bored high school student whose life is changed when he finds the Death Note, a notebook dropped by a rogue Shinigami, or god of death, named Ryuk. When Light discovers that any human whose name is written in the book dies, he vows to use its power to rid the world of evil. But every action has its consequences, and Light soon finds himself in a life or death battle of wits with the mysterious genius detective called L. Humanity itself becomes the battleground to determine what form of justice will prevail! \n\n\n\n\nAlthough he\\&amp;#039;s one of the top-ranked high school students in Japan, Light Yagami, the hero of the dark fantasy Death Note (2006), is alienated and bored. His life changes dramatically when he finds the Death Note, a notebook dropped into human space by Ryuk, an equally bored and alienated Shinigami, or god of death. If anyone writes the name of a human in the notebook, that person will die within minutes. After testing the Death Note\\&amp;#039;s powers, Light quickly overcomes his initial qualms and launches a grandiose vigilante campaign: he will rid the world of criminals and evil people to create his version of a perfect society. But the string of deaths he causes inevitably attracts the attention of the police. The mysterious investigator known only as \\&quot;L\\&quot; vows to track down the murderer and bring him to justice. This high-stakes battle of wits pits Light against L, while Ryuk watches with icy bemusement. Death Note is less overtly violent than Elfen Lied or Gantz, but it revels in a similarly off-putting amoral cruelty. (Rated Teen+ Older Teen, suitable for ages 15 and older: grotesque imagery, violence, violenec against women) --Charles Solomon \n\t\t\t\t","torrent":{"xt":"urn:btih:251d7cd92fe01ef785e9384cdd4196bf22fbb91a","amp;dn":"Death+Note+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251d7cd92fe01ef785e9384cdd4196bf22fbb91a","infoHashBuffer":{"type":"Buffer","data":[37,29,124,217,47,224,30,247,133,233,56,76,221,65,150,191,34,251,185,26]},"announce":[],"urlList":[]}}