{"title":"The Fugitive S02E01 F.A.R.T. 1964 Version Man in a Chariot with ","uid":4467222,"size":566419557,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2562ef2cdfb6dccd3fad092cd2b7a83bd8fb3e86&amp;dn=The+Fugitive+S02E01+F.A.R.T.+1964+Version+Man+in+a+Chariot+with+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rkimble","files":-1,"time":1224965348,"description":"From the Fugitive Audio Restoration Team (F.A.R.T.) comes this excellent quality video with the original soundtrack restored! As you probably know, the DVD's of season two of The Fugitive were released with a completely new, synthesized music score which destroyed much of the show's drama. Now, thanks to the Fugitive Audio Restoration Team, you can enjoy the show in top quality as it was originally intended to be experienced.\n\nAlso included in this torrent is the introduction of this episode by none other than Barry Morse, who played Lt. Philip Gerard for four seasons of The Fugitive.\n\nThe Fugitive Season 2 (1964)\nS02E01 Man in a Chariot\nFirst aired: 9/15/1964 \n\nKimble happens to watch a TV debate in which a once-renowned attorney, named G. Stanley Lazer, claims that he could reverse Kimble's criminal conviction if the case went back to trial. Lazer once a respected lawyer, had his license revoked after getting into a car accident years before while driving drunk in which his wife was killed. Lazer now spends his days teaching law at a small college in Harrisburg. Kimble travels to Pennsylvania and meets with Lazer and his assistant, Nancy Gilman, to enlist their help. To prove his theory, Lazer decides to conduct a mock trial with his students playing the prosecutor, defense lawyer, and jury in front of a live TV audience. But while the mock trial continues, Kimble becomes aware that Lazer is really putting himself on trial for his past misdeeds. Ed Begley guest stars.\n\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice)\n\nGuest cast: Kathleen Maguire (Nancy Gilman), Robert Drivas (Lee Gould), Ed Begley (Professor G. Stanley Lazer), Gene Lyons (McNeil), Dort Clark (Sgt. Pulaski), Walter Brooke (Moderator), Harold Gould (Eller), Stewart Moss (Judge Tyler), Peter Duryea (Paul Mitchell), Edward Madden (Dr. Gary) \n(thanks to circlensess for this synopsis)\n\nLeave a comment if you want to see more.","torrent":{"xt":"urn:btih:2562ef2cdfb6dccd3fad092cd2b7a83bd8fb3e86","amp;dn":"The+Fugitive+S02E01+F.A.R.T.+1964+Version+Man+in+a+Chariot+with+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2562ef2cdfb6dccd3fad092cd2b7a83bd8fb3e86","infoHashBuffer":{"type":"Buffer","data":[37,98,239,44,223,182,220,205,63,173,9,44,210,183,168,59,216,251,62,134]},"announce":[],"urlList":[]}}