{"title":"Bangkok Girl","uid":3562005,"size":458980466,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:25ba26d8de88126022eebe94ec606c2cda64c267&amp;dn=Bangkok+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"etxkgh","files":1,"time":1164143192,"description":"Excellent quality. English. Some subs for broken english. Bangkok Girl is a &amp;#039;remarkably accomplished, beautifully photographed and intimate debut documentary that puts a human face on the devastating social issue that, sadly, is the fate of too many impoverished girls.&amp;#039; Producer/Director Jordan Clark enters a world with various levels of prostitution -- from basic bargirls, who merely pour you a drink, money for sex relationships, to hooking on both sides of the gender line. The documentary provides a glimpse of Thailand&amp;#039;s sex tourism told through the experiences of a 19-year-old bar girl named Pla. Working in the bars since the age of thirteen, Pla has managed to avoid selling her body for sex, a remarkable discovery, given her surroundings that sadly cannot last. En route to the film&amp;#039;s startling conclusion, you are given a true understanding of why and how she ended up in her current environment and wonder if she will ever escape. The introduction of &amp;#039;falangs&amp;#039;, or foreigners, to Thailand has forever changed their city, their economy, their lives, and their desires. This film is a daring and unabashed look at ourselves, through the eyes of one girl, in an honest, morally gripping story, which challenges the worldwide, accepted practice of sex tourism. Bangkok Girl was produced by High Banks Entertainment Ltd. (Victoria, B.C.) in association with CBC Newsworld.","torrent":{"xt":"urn:btih:25ba26d8de88126022eebe94ec606c2cda64c267","amp;dn":"Bangkok+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ba26d8de88126022eebe94ec606c2cda64c267","infoHashBuffer":{"type":"Buffer","data":[37,186,38,216,222,136,18,96,34,238,190,148,236,96,108,44,218,100,194,103]},"announce":[],"urlList":[]}}