{"title":"Sailor Moon. Temp.1x023","uid":4841753,"size":105900032,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:27d547f9f30f7add18b5671afef62f04305cfc26&amp;dn=Sailor+Moon.+Temp.1x023&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sagleon","files":1,"time":1239535743,"description":"Todo empieza cuando Bunny Tsukino conoce a una extraÃƒÂ±a gata llamada Luna que puede hablar y la convence de que debe transformarse en Sailor Moon. Se enfrentarÃƒÂ¡ a los youmas ( demonios ) del Reino de la Oscuridad y a su comandante, Daniel, encontrando la ayuda del misterioso SeÃƒÂ±or del antifaz , del que Bunny se enamora. Muy pronto encontrarÃƒÂ¡ apoyo de Amy y Ray, Sailor Mercurio y Sailor Marte respectivamente. Tras unirse a ellas Patricia, Sailor JÃƒÂºpiter, Luna les revela que estÃƒÂ¡n buscando el Guinzuishou, el Cristal de Plata que revelarÃƒÂ¡ donde estÃƒÂ¡ la Princesa Selene, heredera del Milenio de Plata Lunar. Los enemigos son los componentes del Reino de la Oscuridad, primero Daniel, despuÃƒÂ©s Ramiro y posteriormente ZÃƒÂ³site y Lord Constite. ZÃƒÂ³site usa el poder del Cristal Negro para localizar los siete cristales Arco Iris, que indicarÃƒÂ¡n el lugar donde se encuentra el Cristal de Plata, ademÃƒÂ¡s de liberar a siete poderosos demonios. En una trampa ideada por ZÃƒÂ³site, y una vez se les han unido a las Guerreros Carola, Sailor Venus, y su gato Artemis, se revela que Bunny es en realidad la reencarnaciÃƒÂ³n de la Princesa Selene, del Milenio de Plata, y que Armando, el SeÃƒÂ±or del Antifaz, lo es de su enamorado, el PrÃƒÂ­ncipe Endymion de la Tierra. En un enfrentamiento final en el Polo Norte, Bunny se enfrenta a la Reina Beryl, del Reino de la Oscuridad y, dando su vida, vence en el combate. El mal ha desaparecido, pero todas las Guerreros y el SeÃƒÂ±or del Antifaz han muerto. Se ve una luz y se oye la voz de Bunny recordando su vida en la Tierra. Las chicas y Armando han vuelto a la vida en sus vidas anteriores, sin recuerdos de haber sido guerreros de la justicia. Tan sÃƒÂ³lo Luna y Artemis recuerdan lo que pasÃƒÂ³.\n\n","torrent":{"xt":"urn:btih:27d547f9f30f7add18b5671afef62f04305cfc26","amp;dn":"Sailor+Moon.+Temp.1x023","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27d547f9f30f7add18b5671afef62f04305cfc26","infoHashBuffer":{"type":"Buffer","data":[39,213,71,249,243,15,122,221,24,181,103,26,254,246,47,4,48,92,252,38]},"announce":[],"urlList":[]}}