{"title":"Coast.to.Coast.AM.June.11.2009-komie","uid":4949528,"size":56065011,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2bd61693af3676b735acd1dfcbf2687c05e47fe8&amp;dn=Coast.to.Coast.AM.June.11.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":6,"time":1244824897,"description":"Anthrax Attacks &amp; Germ Warfare\n\n  \n\nDate:\n06-11-09\n\nHost:\nGeorge Noory\n\nGuests:\nEric Nadler, Bob Coen, Kevin Miller\n\n\nJournalists and filmmakers Bob Coen and Eric Nadler discussed their work on the untold story of the 2001 anthrax attacks, the dark secrets of germ warfare research, and how it ties in with the untimely deaths of microbiologists around the world. Biodefense researcher Bruce Ivins, the suspect the FBI eventually named in the anthrax attacks, apparently committed suicide before he could be brought to trial. Ivins' co-workers at Fort Detrick in Maryland, whom Nadler &amp; Coen spoke with, said his death was convenient-- and that it was a set-up. They claimed the kind of equipment needed to make the 'weaponized' anthrax used in the 2001 attacks wasn't available to Ivins.\n\nCoen &amp; Nadler also investigated the mysterious &quot;suicide&quot; of biological warfare expert David Kelly, who worked as a UN weapons inspector in Iraq, as well as at the UK's Porton Down in the Defence Microbiology Division. Forensic evidence showed his death was a murder, said Nadel, who noted there were no fingerprints on the knife he allegedly used to cut his wrist. Kelly may have worked with &quot;Dr. Death&quot; (Wouter Basson) in South Africa, where ethno-specific bioweapons were being developed in the 1980s, said Coen. They speculated Kelly might have wanted to get out of his field and reveal secrets, and thus had to eliminated as a &quot;man who knew too much.&quot;\n\nA Soviet biological warfare expert, who defected to the UK, Vladimir Pasechnik, died of a &quot;stroke&quot; in 2001 and may have been another case of someone who knew too much, said Nadler. The big picture is that there's a germ warfare race underway globally, and that the corporate sector is profiting from it, he continued. The late Stephen Dresch, an investigator who followed the trail, referred to the &quot;international bioweapons mafia,&quot; which he said included university professors, spooks, corporate leaders, and European industrialists. To raise public awareness of this issue, and for further information, see Nadel &amp; Coen's Get Involved page.\nGeneration Rx\n\nFirst hour guest, writer/producer Kevin Miller talked about his film project, Generation Rx, which looks at how serious side effects such as suicide are associated with psychiatric drugs like Prozac. The pharmaceutical industry has acted in collusion with the FDA to downplay or hush-up the dangers of these substances, he asserted.\nWebsite(s):\n# anthraxwar.com\n# kevinmiller.com\nBook(s):\n# Dead Silence: Fear and Terror on the Anthrax Trail\n","torrent":{"xt":"urn:btih:2bd61693af3676b735acd1dfcbf2687c05e47fe8","amp;dn":"Coast.to.Coast.AM.June.11.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd61693af3676b735acd1dfcbf2687c05e47fe8","infoHashBuffer":{"type":"Buffer","data":[43,214,22,147,175,54,118,183,53,172,209,223,203,242,104,124,5,228,127,232]},"announce":[],"urlList":[]}}