{"title":"POtHS 4 - Conspiracy Facts - Part 24 - Secret Societies - Illumi","uid":7409430,"size":1668496546,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:30009de9a384a005fe5fc5cf79a789bd32d5a5dc&amp;dn=POtHS+4+-+Conspiracy+Facts+-+Part+24+-+Secret+Societies+-+Illumi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":7,"time":1341339349,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\n\nPOtHS 4 - Conspiracy Facts - Part 23 - Secret Societies - Illuminati\n\n\n\nPOtHS Comments on This one: The Illuminated Ones\n\nIt doesn't take very much light to Illuminate a person in the Dark, as deep in the PIT as these so called Illuminati are. If you think The Rothschild's, The Windsor's, The Rockefeller's and whoever else you think might be on the Illuminati list a famous Luciferians, your wrong. All these foney earth dwellers are mere puppets and Cannon Fodder for the Real Illuminati. You all know the 13 Level Masonry Pyramid on The Dollar Bill. You probably think that those names listed above are at the top of The Pyramid. Wrong. Those guys are the midrange of the Pyramid. They are more like Lieutenants or Captains in The Military. The upper levels of The Enlightened ones are not even known to them. The top 2 levels I think are in Direct fellowship with Satan, the Eye at The Top of the Pyramid. They are considered Holy Priests and worship their god Lucifer the Light Bringer as Deity. 1st Commandment violation.\n\nWhat is all this Illuminati Bloodline stuff??? That is simple to Answer. Nephilim blood. When The Sons of God (Angels)saw the Daughters of Man...they saw that they were FAIR them and took them as they pleased, creating the offspring known as the Nephilim. They were the Men of Renown. The offspring of The Pharaohs who were The offspring of The Snake in The Garden, They are the Reptilians. (see POTHS - Conspiracy Facts - Part 39 - The Reptilian Alien Agenda)The Flood of Noah was to Remove them from the Planet...........they are back.\n\nSo now you know, The Blue Bloods are of The Reptilian Blood Line of Satan. They are The NEPHILIM...Are They illegible for Resurrection??? Did Jesus Die for Nephilim??? Did he die for the Obaminations of The Fallen Angels. I don't think so. Thats the Satanic Hook. Jesus did not die for Nephilim. SATAN PROMISES THEM THAT HE WILL RESURRECT THEM. WOW RESURRECTED by EVIL. Imagine all the Little Obamanations that will Create.\n\nOne thing kinda funny about this Bloodline is: You can buy your way in with MONEY.\n","torrent":{"xt":"urn:btih:30009de9a384a005fe5fc5cf79a789bd32d5a5dc","amp;dn":"POtHS+4+-+Conspiracy+Facts+-+Part+24+-+Secret+Societies+-+Illumi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30009de9a384a005fe5fc5cf79a789bd32d5a5dc","infoHashBuffer":{"type":"Buffer","data":[48,0,157,233,163,132,160,5,254,95,197,207,121,167,137,189,50,213,165,220]},"announce":[],"urlList":[]}}