{"title":"The Cure - Lovesong (Live Rome 2008)","uid":4951577,"size":43553484,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:33330a531ecb8fef4577add603839624a71331ed&amp;dn=The+Cure+-+Lovesong+%28Live+Rome+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RosaMannen","files":1,"time":1244912191,"description":"The Cure are an English rock band formed in Crawley, West Sussex in 1976. The band has experienced several lineup changes, with frontman, vocalist, guitarist and principal songwriter Robert Smith being the only constant member.\n\nThe Cure first began releasing music in the late 1970s with their debut album Three Imaginary Boys (1979); this, along with several early singles, placed the band as part of the post-punk and New Wave movements that had sprung up in the wake of the punk rock revolution in the United Kingdom. During the early 1980s the band's increasingly dark and tormented music helped form the gothic rock genre. After the release of Pornography (1982), the band's future was uncertain and Smith was keen to move past the gloomy reputation his band had acquired. With the 1982 single &quot;Let's Go to Bed&quot; Smith began to inject more of a pop sensibility into the band's music. The Cure's popularity increased as the decade wore on, especially in the United States where the songs &quot;Just Like Heaven&quot;, &quot;Lovesong&quot; and &quot;Friday I'm in Love&quot; entered the Billboard Hot 100 charts. By the start of the 1990s, The Cure were one of the most popular alternative rock bands in the world, and although their profile has lessened in more recent years, they are estimated to have sold 27 million albums as of 2004.[1] The Cure have released thirteen studio albums and over thirty singles during the course of their career.\n\n\nLive in Rome, Italy 2008.\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:33330a531ecb8fef4577add603839624a71331ed","amp;dn":"The+Cure+-+Lovesong+%28Live+Rome+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33330a531ecb8fef4577add603839624a71331ed","infoHashBuffer":{"type":"Buffer","data":[51,51,10,83,30,203,143,239,69,119,173,214,3,131,150,36,167,19,49,237]},"announce":[],"urlList":[]}}