{"title":"Our.Family.Wedding.CamV2.With.SAMPLE-GPB2008","uid":5458969,"size":645583074,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:35854b0246defda39579c12b103bf822a4490f34&amp;dn=Our.Family.Wedding.CamV2.With.SAMPLE-GPB2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GPB2008","files":-1,"time":1269420459,"description":"NOTES***** Same As Previous Release Except Resized To 720x320\n\n\n\nAudio is OK, Video Is A Bit Dark, But Still Watchable, Judge Off The Sample\n\n\n\n&quot;Our marriage, their wedding.&quot; It's lesson number one for any newly engaged couple, and Lucia (America Ferrera) and Marcus (Lance Gross) are no exception. In Our Family Wedding, they learn the hard way that the path to saying &quot;I do&quot; can be rife with familial strife. When they return from college and too suddenly announce their marriage plans, they soon discover that their fathers - two highly competitive over-the-top egos - can wreak a major amount of havoc on their special day. With insults flying and tempers running high, it's anyone's guess if the alpha dads (Forest Whitaker and Carlos Mencia) will survive to make it down the aisle in one piece. Lucia's mother (Diana Maria Riva) is busy planning the wedding of &quot;her&quot; dreams and the only levelheaded one in the bunch is Angela (Regina King), the groom's father's best friend and lawyer, who manages to keep her cool when the madness reaches a crescendo. With only weeks to plan their wedding, Lucia and Marcus soon discover the true meaning of love and find there is truth to the saying - that when you marry someone, you marry their entire family.  \n\n\nSEED... COMMENT... ENJOY!!!","torrent":{"xt":"urn:btih:35854b0246defda39579c12b103bf822a4490f34","amp;dn":"Our.Family.Wedding.CamV2.With.SAMPLE-GPB2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35854b0246defda39579c12b103bf822a4490f34","infoHashBuffer":{"type":"Buffer","data":[53,133,75,2,70,222,253,163,149,121,193,43,16,59,248,34,164,73,15,52]},"announce":[],"urlList":[]}}