{"title":"Stifler's Mom - Greatest Hits (2003-1996)","uid":4450325,"size":54114370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35c340b79f01cc26db9fc9f278ab3ac2e566af2e&amp;dn=Stifler%5C%27s+Mom+-+Greatest+Hits+%282003-1996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pinespree","files":33,"time":1224232674,"description":"Stifler's Mom was a musical journey for all of us involved...and would probably tell you more about us than you ought to know.\n\nFrom the liner notes of the 2003 compilation:\n\nfinch lives.\n\nthe music of stifler's mom, which either lived from april 2001 - sometime in the summer or from 2003-1996 or eternally, depending on how you count it, hasn't had a place to live since i took down stiflersmom.net, which has been over a year, i think. there aren't many people who would want to hear it, but there aren't many people who would want to hear swx001 either. So I'm releasing A Millenium of Mom, our complete works in three volumes. This is volume 1, we rock the game which contains all of the pop songs. volume 2, ro ready, coming soon, will contain the &quot;experimental&quot; music, most of which was produced in the &quot;rock and roll barn&quot; sessions. volume 3, coming soon after that and tentatively titled hash man will contain all of the really awful crap.\n\nThere's not too much I can say about stifler's mom music, but one significant thing I can say is that by and large, bands like stifler's mom are the only kind of groups that put their music out for free on the internet. And although most of the point of this music club project is to get better musicians to put real music on the internet for free, there's no reason not to include some of the traditional material.\n\ni think i can resist pretty well the temptation to say anything about these songs, even though there's plenty i could say. looking back at them, the only thing i regret about our output, and in particular the pop part of it, is that i wrote so damn much of it. eight songs on this disc i wrote entirely by myself, and a couple of those i performed by myself too. f that. they are, of course, not the better songs (although i don't think any of them are going on volume 3 - but maybe they deserve to. hashman is on volume 3 because of my contribution to it). my favorites on this disc are the soul songs (tracks 13, 15, and above all number 5), the electro-freestyles (1 and 6), and the rap (4 and 14). but that's all i'm a say, except for the technical detail that i didn't remaster these to make the levels right, or re-mp3 them at a decent bitrate, because i don't have the original material and that was never our style anyway. so enjoy as is.","torrent":{"xt":"urn:btih:35c340b79f01cc26db9fc9f278ab3ac2e566af2e","amp;dn":"Stifler%5C%27s+Mom+-+Greatest+Hits+%282003-1996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35c340b79f01cc26db9fc9f278ab3ac2e566af2e","infoHashBuffer":{"type":"Buffer","data":[53,195,64,183,159,1,204,38,219,159,201,242,120,171,58,194,229,102,175,46]},"announce":[],"urlList":[]}}