{"title":"halloween2007","uid":3790101,"size":730046966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:364bd56dd6204755b86434d6a49ec71f8b728208&amp;dn=halloween2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"daimusero92","files":2,"time":1188529687,"description":"2007 \n\nAfter young Michael Myers killed his older sister one Halloween night he was committed for 15 years to a mental institution were he soon broke out and is in search for his little sister Laurie Strode as he returns back to his home town Haddonfield and finds his sister she and hers friends must put up a battle to survive as Michael Myers tries to kill them.  Written by Nick F.\n\nThe residents of Haddonfield don&amp;#039;t know it yet... but death is coming to their small sleepy town. Fifteen years ago a small six year old boy called Michael Myers brutally slashed his elder sister to death. Locked up till his 21st birthday, he escapes the mental institution that held him for fifteen years and makes his way back to his hometown intent on a murderous rampage pursued by Dr Sam Loomis who is Michael&amp;#039;s doctor and the only one who knows Michael&amp;#039;s true evil. Elsewhere a shy teenager by the name of Laurie Strode is babysitting on the night Michael comes home... is it pure coincidence that she and her friends are being stalked by him? Written by TheSteph\n\nOn Halloween 1963, Haddenfield, 6-year-old Michael Myers (Daeg Farch), estranged and mentally unstable, is imprisoned in Smith&amp;#039;s Grove Sanitarium under the care of Dr. Sam Loomis (Malcolm McDowell) for the murders of his mother&amp;#039;s (Sheri Moon) boyfriend, his older sister, and her boyfriend. Now, 15 years later, he is accidentally released and now in search of his baby sister Laurie (Scout Taylor-Compton) and Dr. Loomis must warn the residents of Haddenfield and get to Laurie before Michael does. Written by Corey Semple (aka Hairsprayer07) ","torrent":{"xt":"urn:btih:364bd56dd6204755b86434d6a49ec71f8b728208","amp;dn":"halloween2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"364bd56dd6204755b86434d6a49ec71f8b728208","infoHashBuffer":{"type":"Buffer","data":[54,75,213,109,214,32,71,85,184,100,52,214,164,158,199,31,139,114,130,8]},"announce":[],"urlList":[]}}