{"title":"Some YoYo Stuff by Anton Corbijn","uid":4655897,"size":88528896,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:36d14527b30ab1d073c41027f378596adbb2e0b0&amp;dn=Some+YoYo+Stuff+by+Anton+Corbijn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ultracinema","files":1,"time":1232204006,"description":"Don van Vliet, alias &quot;Captain Beefheart&quot;, is one of the most influential, misunderstood, talked about, admired, copied, treasured, loved and quoted musicians and yet he is still an obscure and mysterious artist. His quite abrupt artistic transformation from working with a microphone to a paintbrush in 1982 and his consequent move from the desert to the ocean meant even less direct contact with the outside world than before. Subsequently there is very little information about Don from this time onwards and this short black-and-white film made in 1993 is an unique opportunity to see and hear this unique man. The film is approximately 13 minutes long, directed and photographed in black and white by Anton.\n\nThis is Anton Corbijn's short (13 minute) black-and-white film from 1993. It is a personal and revealing look at the former master of Dadaist rock. Through the cryptic answers and strange metaphors, the man sounds so broken and old-beyond-his-years that it can be difficult to take in, as if this were too personal and revealing to be enjoyed from a film. Still, it is one of the few windows (if even only a keyhole) allowed into the life of Don Van Vliet since his 1982 retirement from music. Don's mother introduces the film and filmmaker David Lynch makes a running appearance as the questioner.\n\nThere aren't too many films around that are worth almost a dollar a minute - but if you're a fan of dada-blues icon Captain Beefheart, Some YoYo Stuff will justify that price. Shot in 1993, a decade after the singer born Don Van Vliet gave up music for painting, this 13 minute black-and-white short juxtaposes shots of Van Vliet's art, clips of his mother and director David Lynch, and a few audio remniscences from the Captain himself, speaking in a craggy voice that quivers with age but hasn't lost its magnetism. If you're a Beefheart completist (and is there any other kind of Beefheart fan ?), it's essential at any price.\n\nAnton Corbijn's luminous tribute to Don Van Vliet aka Captain Beefheart (&quot;an observation of his observations&quot;) is a decade old and at 13 minutes running time, still worth a shelf full of subsequent sedulous biographical research. Its opening shot sees the subject's mother plant a little cut-out Don in the desert, as if to suggest that the 'retired', retiring ex-Captain is both a flatly iconic simulacrum of his former self and a very real presence rooted in the Mojave: a desert-visionary painter and (on the svelte evidence here) gnomically hilarious raconteur. Corbijn frames Van Vliet's fragile stillness with ravishing desertscapes and two Captain Beefheart tracks (&quot;What Are We Gonna Do With You ?&quot; and &quot;Evening Bell&quot;), but it's his speaking voice that lingers. Illness may have grounded the flighty Captain's whoops and hollers, but his halting delivery still swerves into gravelled, lucid insistence on a single syllable : &quot;the fish i used on the cover of Trout Mask Replica stank so bad.....Humans are so mean !&quot; He's also a pure joy to watch : puffing on his cigar or suddenly executing one of those splayed, sweeping arm gestures that were the essence of his stage presence. Which is not to say that Some YoYo Stuff is a mere wake for pre-1982 Beefheart, evidence of some spectral half-life lived out after the fact. Here too is Van Vliet the artist and desert prophet, formulating 'naive' aphorisms (&quot;when you sculpt little things, it makes your fingers feel delightful&quot;) and obliquely generous tributes to his peers (&quot;he was the only Frank Zappa i knew&quot;). His desert retreat may be legendary, but this is an artist still with an eye and ear outside his own myth &quot;I'd like to tell you people watching and listening.....BOO!&quot;\n\n\n\n","torrent":{"xt":"urn:btih:36d14527b30ab1d073c41027f378596adbb2e0b0","amp;dn":"Some+YoYo+Stuff+by+Anton+Corbijn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d14527b30ab1d073c41027f378596adbb2e0b0","infoHashBuffer":{"type":"Buffer","data":[54,209,69,39,179,10,177,208,115,196,16,39,243,120,89,106,219,178,224,176]},"announce":[],"urlList":[]}}