{"title":"AC/DC - Anything Goes","uid":4854549,"size":118861828,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:36f554f7353ad37da788fa4adba290ce8ab4e939&amp;dn=AC%2FDC+-+Anything+Goes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1240006720,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nAnything Goes is a song by the Australian hard rock group AC/DC. It is the 4th track from their latest album Black Ice. &quot;Anything Goes&quot; is one of five songs from the album that is played live on their Black Ice World Tour. The single cover for Anything Goes is the only AC/DC cover to feature Brian Johnson, as most others feature only Angus Young.\n\nThe music video for &quot;Anything Goes&quot; was filmed live in Paris on February 25th &amp; 27th by David Mallet.\n\nBlack Ice is the 15th studio album by Australian hard rock band AC/DC, produced by Brendan O'Brien and released worldwide between October 17 and 22, 2008. AC/DC were known to be working on the album as early as January 2006, with it being delayed because of an injury to bassist Cliff Williams and a change of record labels to Sony Music, and in turn Columbia Records. It is their first album since the release of Stiff Upper Lip in 2000, the longest gap between two AC/DC studio albums to date.\n\nThe album is their longest to date. The band recorded it in The Warehouse Studio in Vancouver, Canada, the same studio as their previous album Stiff Upper Lip.\n\nBlack Ice sold around 1,762,000 units in its first week, shipping 5,000,000 copies worldwide. The album went to number one in 29 different countries, including Australia, Canada, the United Kingdom, and the United States. In its first week, it sold 784,000 copies in the US alone, with it receiving a three times platinum certification in Australia and selling upwards of 110,000 in the UK. As of January 2009 the album has sold 6 million copies worldwide. Rolling Stone magazine also ranked Black Ice number 41 on their list &quot;Top 50 Best Albums of 2008&quot;. Black Ice was also named the 3rd best album of 2008 by Metal Hammer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:36f554f7353ad37da788fa4adba290ce8ab4e939","amp;dn":"AC%2FDC+-+Anything+Goes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36f554f7353ad37da788fa4adba290ce8ab4e939","infoHashBuffer":{"type":"Buffer","data":[54,245,84,247,53,58,211,125,167,136,250,74,219,162,144,206,138,180,233,57]},"announce":[],"urlList":[]}}