{"title":"Hidden Palms","uid":4669718,"size":363261005,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3736d1a21e3ead9b0ccbfcacf2e5cb5fd949e546&amp;dn=Hidden+Palms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"electric_bug","files":2,"time":1232691893,"description":"Johnny Miller was a happy, well-adjusted high school student with good grades and a room full of sports trophies until the terrible night a year ago that his father committed suicide. Unable to cope, he tried to drown his pain in alcohol and drugs. Now, fresh out of rehab, Johnny is struggling to deal with an uncertain future in the surreal glare of Palm Springs, where his mother, Karen, and her new husband, Bob, have decided to make a new start. The lush oasis of Palm Springs, with its golf courses, country clubs and beautiful people, is an unsettling new environment for Johnny. He quickly discovers that this paradise isn't quite what it seems when he meets his next-door neighbors: Cliff, a handsome high school junior whose considerable charm can't quite hide his disturbing dark side; and Cliff's mother, Tess, a former Southern beauty queen with a taste for younger men. Johnny learns that his new neighborhood is consumed by a tragedy when Cliff reveals that his best friend, Eddie, who lived in Johnny's house, recently died under mysterious circumstances. Eddie's death seems to haunt everyone Johnny meets, especially Greta, a stunning young beauty who fascinates Johnny from the moment he lays eyes on her. Intriguing and secretive, Greta has been on her own since the death of her mother many years before. With her father always away on business, Greta has become a self-sufficient loner. She quickly realizes, however, that Johnny is a kindred soul; someone forced by tough circumstances to grow up too soon. Even though Greta is drawn to Johnny, she refuses to talk about Eddie's death. In his search for answers to the deepening mystery, Johnny turns to another neighbor, Liza, a gifted but awkward high school student who conducts explosive science experiments in her garage, yet still manages to keep a close eye on everything that happens in the neighborhood. Liza and Johnny soon bond in their pursuit of the truth. While Johnny adjusts to his new circle of friends, he is surprised by the arrival of Nikki, a troubled L.A. party girl he met in rehab, whose family has written her off as a lost cause. Nikki is also fighting to stay sober, so Johnny introduces her to his colorful AA sponsor, Jesse Jo, who just happens to be a drag queen. Jesse Jo cares deeply about Johnny's recovery, and he immediately takes Nikki under his wing as well.","torrent":{"xt":"urn:btih:3736d1a21e3ead9b0ccbfcacf2e5cb5fd949e546","amp;dn":"Hidden+Palms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3736d1a21e3ead9b0ccbfcacf2e5cb5fd949e546","infoHashBuffer":{"type":"Buffer","data":[55,54,209,162,30,62,173,155,12,203,252,172,242,229,203,95,217,73,229,70]},"announce":[],"urlList":[]}}