{"title":"The Dance of the Fertile Universe: Are We Alone?","uid":4744470,"size":196756910,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3818c5ff316f41361eb0b9a28822389ebba7d431&amp;dn=The+Dance+of+the+Fertile+Universe%3A+Are+We+Alone%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1235759605,"description":"Father George Coyne, an astronomer and Jesuit priest, Lynn Rothschild, an astrobiologist, offer their unique perspectives on the question and potential of extraterrestrial life.\n\nIs the Earth the only place where life was realized? Is it possible the physical universe offered other potential niches for life?\n\nFather George Coyne - George Coyne is the former director of the Vatican Observatory and the President of the Vatican Observatory Foundation. The Vatican Observatory is one of the oldest astronomical research institutions in the world, and its research group operates the Vatican Advanced Technology Telescope (VATT) at the Mount Graham International Observatory (MGIO) in southeastern Arizona. It does leading research on current issues in astronomy such as dark matter, dark energy, quasars, and supernovae. Dr. Coyne has published many papers on polarimetric studies of interstellar medium, stars with extended atmospheres, interacting binary star systems that give off sudden bursts of intense energy, and dust about young stars. The asteroid 14429 Coyne discovered by Shoemaker and Levy is named for him. Dr. Coyne has commented often on the differences between science and theology, for example, opposing intelligent design as defined by many of its supporters. Richard Dawkins, author of The God Delusion, interviewed Dr. Coyne for Dawkins' television program The Genius of Charles Darwin in the UK.\nLynn Rothschild - Lynn Rothschild is an evolutionary biologist-astrobiologist at NASA's Ames Research Center and a consulting professor at Stanford and Brown Universities where she teaches Astrobiology and Space Exploration. Dr. Rothchild's research has focused on how life, particularly microbes, has evolved in the context of the physical environment on Earth and potentially elsewhere in the solar system and universe. Her work has taken her to the harsh environments in some wild places on Earth. Most recently she has taken to the air in conjunction with the Aeronautics and Astronautics Department at Stanford, flying experiments up to 106,000 feet on high altitude balloons. Dr. Rothschild has appeared on a number of Naked Science TV programs on the National Geographic Channel and on the Alien Faces episode for The Universe TV program on the History Channel.\nSimon P. Worden - General Worden was commissioned in 1971 after receiving a bachelor of science degree from the University of Michigan. He entered the Air Force in 1975 after graduating from the University of Arizona with a doctorate in astronomy. Throughout the 1980s and early 1990s, General Worden served in every phase of development, international negotiations and implementation of the Strategic Defense Initiative, a primary component in ending the Cold War. He twice served in the executive office of the presidents. As the staff officer for initiatives in the George Bush administration's National Space Council, the general spearheaded efforts to revitalize U.S. civil space exploration and earth monitoring programs, and was the architect of the &quot;faster, cheaper, better&quot; approach now adopted throughout the U.S. space program. General Worden commanded the 50th Space Wing that is responsible for more than 60 Department of Defense satellites and more than 6,000 people at 23 worldwide locations. He then served as Deputy Director for Requirements at Headquarters Air Force Space Command, as well as the Deputy Director for Command and Control with the Office of the Deputy Chief of Staff for Air and Space Operations at Air Force headquarters. Prior to assuming his current position, General Worden was responsible for policy and direction of five mission areas: force enhancement, space support, space control, force application and computer network defense. General Worden has written or co-written more than 150 scientific technical papers in astrophysics, space sciences and strategic studies. He was a scientific co-investigator for two NASA space science missions.\n\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:3818c5ff316f41361eb0b9a28822389ebba7d431","amp;dn":"The+Dance+of+the+Fertile+Universe%3A+Are+We+Alone%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3818c5ff316f41361eb0b9a28822389ebba7d431","infoHashBuffer":{"type":"Buffer","data":[56,24,197,255,49,111,65,54,30,176,185,162,136,34,56,158,187,167,212,49]},"announce":[],"urlList":[]}}