{"title":"freenet.zip","uid":4560404,"size":671,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:395399025613e1cd82dae2911da1af3f452d9a58&amp;dn=freenet.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"powerace","files":1,"time":1228659696,"description":"Freenet is free software which lets you anonymously share files, browse and publish &quot;freesites&quot; (web sites accessible only through Freenet) and chat on forums, without fear of censorship. Freenet is decentralised to make it less vulnerable to attack, and if used in &quot;darknet&quot; mode, where users only connect to their friends, is very difficult to detect.\n\nCommunications by Freenet nodes are encrypted and are routed through other nodes to make it extremely difficult to determine who is requesting the information and what its content is.\n\nUsers contribute to the network by giving bandwidth and a portion of their hard drive (called the &quot;data store&quot;) for storing files. Files are automatically kept or deleted depending on how popular they are, with the least popular being discarded to make way for newer or more popular content. Files are encrypted, so generally the user cannot easily discover what is in his datastore, and hopefully can't be held accountable for it. Chat forums, websites, and search functionality, are all built on top of this distributed data store.\n\nFreenet has been downloaded over 2 million times since the project started, and used for the distribution of censored information all over the world including countries such as China and the Middle East. Ideas and concepts pioneered in Freenet have had a significant impact in the academic world. Our 2000 paper &quot;Freenet: A Distributed Anonymous Information Storage and Retrieval System&quot; was the most cited computer science paper of 2000 according to Citeseer, and Freenet has also inspired papers in the worlds of law and philosophy. Ian Clarke, Freenet's creator and project coordinator, was selected as one of the top 100 innovators of 2003 by MIT's Technology Review magazine.\n\nAn important recent development, which very few other networks have, is the &quot;darknet&quot;: By only connecting to people they trust, users can greatly reduce their vulnerability, and yet still connect to a global network through their friends' friends' friends and so on. This enables people to use Freenet even in places where Freenet may be illegal, makes it very difficult for governments to block it, and does not rely on tunneling to the &quot;free world&quot;. \n\nFinns ÃƒÂ¤ven pÃƒÂ¥ deras hemsa nedan. Kommentera gÃƒÂ¤rna om funktionen.\n\nSee link below:","torrent":{"xt":"urn:btih:395399025613e1cd82dae2911da1af3f452d9a58","amp;dn":"freenet.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"395399025613e1cd82dae2911da1af3f452d9a58","infoHashBuffer":{"type":"Buffer","data":[57,83,153,2,86,19,225,205,130,218,226,145,29,161,175,63,69,45,154,88]},"announce":[],"urlList":[]}}