{"title":"Cop Shoot Cop - Ask Questions Later","uid":5536535,"size":332440574,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b9ba6136f94fbe28440216a4e624b2a2b574da1&amp;dn=Cop+Shoot+Cop+-+Ask+Questions+Later&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nmoscar","files":14,"time":1273088051,"description":"Enjoy!\n\nThe band's full album debut on Interscope resulted in a surprise alt-radio hit in &quot;$10 Bill.&quot; It's definitely Cop Shoot Cop at its most accessible while still being abrasive -- the guest horn section continues the jazz-via-Foetus  connection, while Puleo's impressive drumming and Tod A's piercing whistle set the initial tone nicely. A pity Tod A's lyric is one of his most pedestrian -- unless one really gets off on the idea about how money equals murder -- but his delivery is as fierce as always. As for the album as a whole, the foursome sounds resolutely unchanged by becoming part of the major-label machine; having already disposed of that contradiction on Suck City (&quot;Nowhere&quot; reappears from that EP), they cranked the amps further and let fly. About the only across-the-board change would be slightly clearer singing from Tod A, but given how the band values getting its message across, this hardly compromises the group's art. Musically, Filer  is given even more room to breathe with his array of random, disturbing samples, hot-fusing electronic/industrial keyboards and the continual air of imminent destruction that past albums showed. &quot;Surprise, Surprise&quot; makes for a fantastic, corrosive beginning, trashing American society left, right, and center, while &quot;Furnace,&quot; dedicated to a deceased friend, crackles with angst and fire. &quot;Room 429&quot; shows a subtler sense of aggression sneaking in, with an almost elegiac chorus and gripping midsection where the band slowly builds to an explosion behind Tod A's almost whispered singing. Guest appearances throughout lend even more artistic edge to the proceedings -- besides the &quot;$10 Bill&quot; appearance, the three-member Motherhead Horns (including David Ouimet, future Tod A collaborator in Firewater) take a bow on &quot;Got No Soul.&quot; April Chung's violin on &quot;Cut to the Chase,&quot; meanwhile, adds a distinctly Eastern European folk vibe to the fierce clang. \n\nAll Apple Lossless (ALAC) (average 900kbps)","torrent":{"xt":"urn:btih:3b9ba6136f94fbe28440216a4e624b2a2b574da1","amp;dn":"Cop+Shoot+Cop+-+Ask+Questions+Later","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9ba6136f94fbe28440216a4e624b2a2b574da1","infoHashBuffer":{"type":"Buffer","data":[59,155,166,19,111,148,251,226,132,64,33,106,78,98,75,42,43,87,77,161]},"announce":[],"urlList":[]}}