{"title":"[DC] Sega GT &amp; Sega Rally 2 [NTSC] [SB] [CDI]","uid":5103895,"size":779086225,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3bf3fa7e1344f9b80e3767e5f556ea71e4de52aa&amp;dn=%5BDC%5D+Sega+GT+%26+Sega+Rally+2+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":-1,"time":1254221629,"description":"Sega GT &amp; Sega Rally 2 Championship for the Sega Dreamcast       \n                                                           \nRel. 1999 &amp; 2000\n                                                   \n\nFormat:\t      CD-R NTSC-USA\nLang.:\t      English\nDiscs:         2\nImage:         CDI\nRated:         E (Everyone)\ngener:         Racing/Driving Simulation\nSelfboot:      Yes - Both Games.\nRequirements:  Dreamcast Console, or DC Emulator.\n\n\nCompressed with WinRar, Both Games were tested and work. \nTry 7Zip its free google it, if you don't have WinRar.\n\n\nRelease Notes: Both of these classic games for the dreamcast are selfboot on a\n               standard CD-R. Read below for info on type of media you should use\n               &amp; how to burn them. All's thats needed is some cd-r's and a \n               dreamcast console or you can try an emulator. These games were \n               tested on a regular dc console (made in 1999) and ran fine.\n             \n     \nImportant: Some later versions of Sega dreamcast consoles supposedly won't allow \n           utopia or copies of games,not sure if this is true but to be on the \n           safe side try to use a console manufactured before october 2000.  \n           You can find the manfacture date on the bottom of the console on the \n           sticker in fine print just look for it. Of course the only way to know \n           is to just try it on your dreamcast.\n\n\n\nGame Description Sega GT:\n\nWith a nod towards GT2, Sega tosses in their entry in the race-career-category, meaning that this game is all about racing. Racing to win competitions, cars, money and other prizes (such as licenses for bigger cars), buying new cars to race in, upgrading cars to race in and gaining licenses to race with.\n\nIt features realistic controls, graphic and physics, and spans over career, multiplayer or arcade modes, and hundreds of cars to boot.\n\n\nGame Description Sega Rally 2:\n\nBack in the days this game was pretty popular for the dreamcast when it first\ncame out and is what prompted many people that didn't have it to go out and \nbuy a dreamcast and/or the game when the dc was still going strong in market.\n\nSega Rally 2 is the sequel to Sega's hit arcade game, Sega Rally. This game, like it's predecessor, is based on Rally racing. Rally racing is unique in that races take place on both race tracks and off-road courses. The courses in this game reflect this nicely. Some take place in the desert or forest, others take place in cities. \n\nThe cars in this game are all actual rally cars, with manufacturers from Europe and Japan both well represented. You do not get to see very many of them at one time, however, since rally races are typically time-based events. In this game, you are not competing directly against the other cars, you simply have to have the best time through the course. So, during any race you will usually see a handful of other cars on the track.\n\nSega Rally 2 contains several modes of play. The first mode is the simple arcade mode of play. Here, you race in 4 courses, one right after another. The second mode is the 10 year championship. In this mode you race on 16 courses, and can make modifications to your car between races. Finally, there is a 2-person split screen mode for head-to-head competition.\n\n\nGame Pics included.\n\n\nBurn with Alcohol 120% or Discjuggler (Both included in download).\n\nIn Options enable overburn disc in Alcohol or DiscJuggler. (Do for all DC games)\n\nSet Write Method To Raw/Dao and burn at 4x Speed for Alcohol 120%.\n\n\nIf you wanna burn using DiscJuggler Set Burn settings to Raw Write Mode 2 \n2352 CD-DA or Mode 1 2048 Raw Write and burn at 4x Speed.\n\n\nUse Verbatim or Tayio Yuden CD-R Media for best quality, or if other media isn't working.\n\n(No CD-RW will not work only CD-R's).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:3bf3fa7e1344f9b80e3767e5f556ea71e4de52aa","amp;dn":"%5BDC%5D+Sega+GT+%26+Sega+Rally+2+%5BNTSC%5D+%5BSB%5D+%5BCDI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bf3fa7e1344f9b80e3767e5f556ea71e4de52aa","infoHashBuffer":{"type":"Buffer","data":[59,243,250,126,19,68,249,184,14,55,103,229,245,86,234,113,228,222,82,170]},"announce":[],"urlList":[]}}