{"title":"The Tourists - Don't Say I Told You So [1980].mpg","uid":5254933,"size":69421060,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3c2ff8f08441efb146b1f45866d32cfa6a827a59&amp;dn=The+Tourists+-+Don%5C%27t+Say+I+Told+You+So+%5B1980%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"claudeq","files":1,"time":1262516948,"description":"The Tourists (1977 - 1980) were a British power pop band, but are better known for two of their members (Annie Lennox and David A. Stewart) who went on to achieve great success as Eurythmics. The band formed around a nucleus of two musicians from Sunderland in north-east England, Peet Coombes and Dave Stewart.\n\n\n\nPeet Coombes was a guitarist singer-songwriter, while Dave Stewart, also a guitarist, had been a member of the folk rock band, Longdancer, who were signed to Elton John's Rocket Records label. The two moved to London and encountered Scottish singer Annie Lennox who had dropped out of her course at the Royal Academy of Music, where she had been studying flute and keyboards, to pursue her ambitions in pop music. The three of them initially called themselves The Catch, and released a single &quot;Borderline&quot; in 1977 on Logo Records, which failed to chart.\n\nBy 1977, they recruited bass guitarist Eddie Chin and drummer Jim Toomey, and rechristened themselves The Tourists. This saw the beginning of a productive two years for the band and they recorded three albums: The Tourists, Reality Effect, and Luminous Basement, as well as half a dozen singles, including &quot;Blind Among the Flowers&quot; (1979), &quot;The Loneliest Man in the World&quot; (1979), &quot;Don't Say I Told You So&quot; (1980), and two major hits, the Dusty Springfield cover &quot;I Only Want to Be with You&quot; (1979) and &quot;So Good to Be Back Home Again&quot; (1980), both of which reached the top 10 in the UK. &quot;I Only Want to Be With You&quot; was also a top 10 hit in Australia, and made the US Billboard Hot 100 at no.83. Coombes was the band's main songwriter, although later releases saw the first compositions by Lennox and Stewart. The band's music expanded using their folk roots, demonstrating some punk energy, reggae and 1960's pop influences. A key development was their decision to record later material with legendary German avant-garde producer Conny Plank, and a transfer to RCA Records in 1980. The band toured extensively in the UK and abroad, including a support role on the Roxy Music Manifesto Tour, but despite modest chart success, they were critically savaged by the punk-championing UK music press. This, combined with legal wranglings and some personal tensions, led to the group disbanding in 1980.\n\nCoombes and Chin reputedly began a new project Acid Drops, but this met with little success and Coombes, despite originally being the main artistic force behind The Tourists, drifted out of the music business into obscurity. Lennox and Stewart split as a couple, but decided to continue working as an experimental musical partnership, under the name Eurythmics. They retained their RCA recording contract and links with Conny Plank, and by 1983 had achieved global success with their hit single &quot;Sweet Dreams (Are Made of This)&quot;.\n\n\nEnjoy","torrent":{"xt":"urn:btih:3c2ff8f08441efb146b1f45866d32cfa6a827a59","amp;dn":"The+Tourists+-+Don%5C%27t+Say+I+Told+You+So+%5B1980%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c2ff8f08441efb146b1f45866d32cfa6a827a59","infoHashBuffer":{"type":"Buffer","data":[60,47,248,240,132,65,239,177,70,177,244,88,102,211,44,250,106,130,122,89]},"announce":[],"urlList":[]}}