{"title":"Kidnap Kings - Flashing Lights And Sound (2010)","uid":5452569,"size":96042959,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d11bf464cd172afea21407e5a77e30d4bd1ff9c&amp;dn=Kidnap+Kings+-+Flashing+Lights+And+Sound+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doabarrelroll","files":13,"time":1269232479,"description":"This is the first studio album by this band under the name &quot;Kidnap Kings&quot; formerly known as Dropping Daylight.  &quot;Flashing Lights And Sound&quot; is the follow up release to 2006's &quot;Brace Yourself.&quot;  While the band's sound has changed somewhat, old loyal fans won't be disappointed, while the new sounds will most likely attract new fans as well.  The opening, title track starts off with ferocious guitars and although only 2 minutes in length, sets the pace for the rest of the album.  While the whole album is solid all the way through, highlights include the catchy &quot;Take A Bow&quot; which you will most certainly be humming to yourself, the more mellow &quot;Something New&quot; will most likely be a hit to those who were fans of Dropping Daylight's &quot;Apologies,&quot; and the second track &quot;Into This Disaster&quot; has an amazing blend of catchy vocals, driving guitar and unique piano riffs.  Also included on the disk are a remake of their old song &quot;Back To Nowhere,&quot; which like &quot;Into This Disaster&quot; also stands out on the record and it finishes off with a cover of Journey's &quot;Don't Stop Believing.&quot; \n\nNote that this is not the final mix of the album, as the album is due out later this year, but they are high quality songs which fans of this band are sure to enjoy.  If you haven't heard of this band, they are brilliant and I highly recommend you listen.\n\nEnjoy.","torrent":{"xt":"urn:btih:3d11bf464cd172afea21407e5a77e30d4bd1ff9c","amp;dn":"Kidnap+Kings+-+Flashing+Lights+And+Sound+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d11bf464cd172afea21407e5a77e30d4bd1ff9c","infoHashBuffer":{"type":"Buffer","data":[61,17,191,70,76,209,114,175,234,33,64,126,90,119,227,13,75,209,255,156]},"announce":[],"urlList":[]}}