{"title":"Dracula (1931)","uid":4978713,"size":376437696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f9f19b45b0075e90e25a24db73d83ae69340ca0&amp;dn=Dracula+%281931%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"big_dad_e","files":-1,"time":1246147266,"description":"Director: Tod Browning    (720x480 resolution)\n\nOn Walpurgisnacht, Renfield (Dwight Frye) goes to the Borgo Pass where he is met by Count Dracula's coach. The next day, Renfield and Dracula (Bela Lugosi) take 'the Vesta' to England. Ship arrives in Whitby harbor in a storm, captain lashed to boat, everyone dead, Renfield mad. Renfield is taken to Dr Jack Seward (Herbert Bunston)'s sanitarium near London. Newspaper clipping notes Renfield's strange desire to eat small living things.\n\nDracula arrives in London. He goes to a play where he is introduced to Dr Seward, daughter Mina (Helen Chandler), Lucy Weston (Frances Dade) and John Harker (David Manners). Dracula announces he has taken Carfax Abbey which adjoins the Sanitarium. Shortly thereafter, Lucy dies of blood loss. Professor Van Helsing (Edward Van Sloan) arrives to examine her. At the same time, Dracula visits, and Van Helsing notes no reflection in mirror. While Van Helsing, Seward and Harker discuss vampires, Dracula summons Mina outside. She is found fainted on the lawn.\n\n&quot;Bloofer lady&quot; in white is reported by children in park. Mina admits that she has seen Lucy. Mina goes to bed wearing wolfbane while Renfield talks to Van Helsing, Harker and Seward about Dracula. Dracula comes into house, tells Van Helsing to return to his own country and that his blood flows through Mina's veins. Harker goes to Mina's room and finds her awake, dressed and on terrace. She is 'changed'. She attempts to bite him but Harker is saved by Van Helsing. At 4:45 am Dracula comes to sleeping Mina and carries her off to the Abbey. Renfield escapes to abbey; Van Helsing and Harker follow. Dracula pushes Renfield downstairs. Dracula carries Mina to coffin. Van Helsing and Harker find Dracula's coffin; Van Helsing stakes him. Mina is released from his hold. Dracula is dead. [Original synopsis by bj_kuehl] \n\n\n\tBela Lugosi\t... \tCount Dracula\n\tHelen Chandler\t... \tMina Harker\n\tDavid Manners\t... \tJohn Harker\n\tDwight Frye\t... \tRenfield\n\tEdward Van Sloan\t... \tProf. Abraham Van Helsing\n\tHerbert Bunston\t... \tDr. Jack Seward\n\tFrances Dade\t... \tLucy Weston\n\tJoan Standing\t... \tBriggs (a nurse)\n\tCharles K. Gerrard\t... \tMartin (as Charles Gerrard)\n\nFormat                           : MPEG-4\nFormat profile                   : Base Media\nCodec ID                         : isom\nFile size                        : 359 MiB\nDuration                         : 1h 14mn\nOverall bit rate                 : 675 Kbps\nMovie name                       : DRACULA_Title01\nEncoded date                     : UTC 2009-06-27 02:24:42\nTagged date                      : UTC 2009-06-27 02:24:42\nComment                          : QuickTime 6.0 or greater\n\n    When using TPB please read these important notes: \n    \n\n01- Anti-malware apps may warn about keygens, patches, cracks, etc., because of \n    their capabilities, (generating codes, etc.). Sometimes they're added to \n    the virus/spyware database and will be detected as malware. If you don't trust\n    the keygens, patches, cracks, etc., don't use them. \n    \n02- Before running .exe-files, keygens, patches, cracks, etc., always check first \n    if they can be unpacked. Often some third party added a virus to the \n    original file, repacked it and uploaded it again.\n\n03- Letting anti-malware apps send scan results to their companies can cause\n    keygens, patches, cracks, etc., to be added to their virus-database.\n\n04- Firewalls which are set to automatically determine connections will allow \n    apps &amp; MALWARE!. Avoid this by manually configuring your firewall.\n\n05- Usually (new) torrents with many downloads and seeders in a brief period\n    suspicious! Torrents with the Skull &amp; Crossbones icon are trusted.\n\n06- Some people use multiple accounts and post fake comments \n    and/or files trying to spread confusion. They seldom seriously\n    comment or have any torrents, or just a few to look passable.\n\n07- Clicking on unknown links can cause malware to be installed on your machine.\n  \n08- In general often there are more fake and negative comments than reliable and\n    positive comments.\n\n09- In some countries uploading/downloading copyright protected material is \n    forbidden, but showing some appreciation to reliable up-loaders is not.\n\n10- Posting fake and negative comments or fake/infected uploads on TPB can result\n    in getting banned from TPB!\n \n\nFor reporting bad or suspicious torrents: &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor more of my torrents:\nhttps://thepiratebay.se/user/big_dad_e/    (SSL)\n\nAll torrents scanned with:\nNorton Anti-virus\nMalwarebytes' Anti-malware\n\nALWAYS SEED!\n\n\nQuicktime for iPod\n","torrent":{"xt":"urn:btih:3f9f19b45b0075e90e25a24db73d83ae69340ca0","amp;dn":"Dracula+%281931%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f9f19b45b0075e90e25a24db73d83ae69340ca0","infoHashBuffer":{"type":"Buffer","data":[63,159,25,180,91,0,117,233,14,37,162,77,183,61,131,174,105,52,12,160]},"announce":[],"urlList":[]}}