{"title":"Defraggler 1.08.132","uid":4778520,"size":773640,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:40da3af29aca969c67534f09c03f7ef50a3794b4&amp;dn=Defraggler+1.08.132&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1237301781,"description":"Copied from Defraggler Homepage:\n\n\nDefrag Individual Files\n\nMost defragmentation tools only let you defrag the whole drive. Defraggler gives you the power to select individual files and folders to defrag. So you can get the job done in seconds, rather than waiting for the whole drive to complete. Of course if you want to defrag the whole drive Defraggler will let you do that too. \n\nCompact and Portable\n\nDefraggler was written in the same compact architecture as other Piriform products (CCleaner and Recuva). This results in a compact single EXE application, which can be copied to a thumbdrive and then used whenever you need it, without a complex installation process. The EXE itself is less than 1MB! \n\nVista Support\n\nDefraggler supports all OSs released since Windows 2000, this includes Windows 2000, 2003, XP and Vista. 64-bit support has also just been added! Additionally Defraggler supports both NTFS and FAT32 file systems.\n\nLocate Files on the Drive\n\nAfter analysis Defraggler lists all the fragmented files on the drive. Selecting one or many will highlight their location on the disk. Allowing you to visually see the location of files on the disk.\n\nFreeware\n\nWhy pay hundreds of dollars for a commercial defragmentation tool, when you can use Defraggler for free! This includes corporate use as well!\n\n\nThis version will install on PCs running Windows 2000, XP, 2003 and Vista.\n64-bit OSs are now supported in this new release.\n\n\n\nChangelog:\n\nv1.08.132\n\n\nImproved handling of NTFS compressed files when moving to end of disk\n\nAdded /shutdown option to df.exe\n\nAdded /large file option to df.exe\n\nDrive list now includes a % fragmented column\n\nBlank file types no longer allowed in Large file options\n\nWarning when trying to set a schedule in the past\n\nRight click 'Check this' option is now greyed correctly\n\nVarious small UI tweaks","torrent":{"xt":"urn:btih:40da3af29aca969c67534f09c03f7ef50a3794b4","amp;dn":"Defraggler+1.08.132","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40da3af29aca969c67534f09c03f7ef50a3794b4","infoHashBuffer":{"type":"Buffer","data":[64,218,58,242,154,202,150,156,103,83,79,9,192,63,126,245,10,55,148,180]},"announce":[],"urlList":[]}}