{"title":"Autodesk Sketchbook Pro 2009-w.Fix Incl.","uid":5252373,"size":33325735,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:410fcf6b5e809f87ab39b1773b7aa1bc0c67b242&amp;dn=Autodesk+Sketchbook+Pro+2009-w.Fix+Incl.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Havaa_Hoplaaa","files":1,"time":1262414489,"description":"Autodesk Sketchbook Pro 2009\n\n\nOVERVIEW:\nAwarded by many experts from the world of graphic design and illustration, Sketch is the biological father of Maya, the excellent application of design illustrations and animations in 3D. Heir of that good know-how is the application SketchBook recently ported to the Mac, and product praised by users of Tablet PC, the perfect companion for the digitizer, which opens new perspectives in the field of design and illustration of hands.\n\nSketchBook is the companion of allocating the digitizer, and is handled by the stylus, with complete ease and freedom, to make sketches and drawings, adding annotations to the graphics, documents and photographs, a purely creative (sketches, paintings and illustration) or even as a business tool (add arrows, comments, diagrams or highlight parts of a document).\n\nThe interface, very intuitive, has been designed based on the movements of the fluid gesture, so opposed to reactive behavior of the stylus on the digitizer. That is how we managed the collection of brushes, pencils and fountain pens, templates and the entire set of drawing tools, the system of layers and screenshot, along with the effects of painting and much more.\n\nInnovative and sophisticated, is actually a collection of tools for drawing and illustration of great variety, with color palettes and many different dyes, annotation snapshots, in images and pictures and, finally, is presented as an excellent manager of sketches, we can organize and display through presentations with comments. Ultimately, SketchBook is unique and very receptive, with a design very well thought out and a lot of perspective.\n\n\nOS: All Windows\nNote: Fix + Instructions Included\n\n","torrent":{"xt":"urn:btih:410fcf6b5e809f87ab39b1773b7aa1bc0c67b242","amp;dn":"Autodesk+Sketchbook+Pro+2009-w.Fix+Incl.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"410fcf6b5e809f87ab39b1773b7aa1bc0c67b242","infoHashBuffer":{"type":"Buffer","data":[65,15,207,107,94,128,159,135,171,57,177,119,59,122,161,188,12,103,178,66]},"announce":[],"urlList":[]}}