{"title":"Brad Paisley - Sharp Dressed Man","uid":4950553,"size":131635204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:41844a8c3e7e594f06689fe6392591d848339349&amp;dn=Brad+Paisley+-+Sharp+Dressed+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1244868831,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Sharp Dressed Man&quot; is a song performed by ZZ Top from their album Eliminator released in 1983.\n\nThe song is featured in the 2005 video game Guitar Hero, as well as a brief appearance on an episode of Beavis and Butt-Head entitled &quot;Radio Sweethearts,&quot; in which it can be heard on a radio, as well in an episode of Two and a Half Men, in which Charlie helps Alan with his clothes shopping. It also appeared on an S&amp;K men's suits commercial. Debbie Harry covered the song on her &quot;Domination&quot; tour of the UK in July 1991.\n\nAt 2007's VH1 Rock Honors. Nickelback covered the song as a tribute (Billy Gibbons had earlier made a guest appearance on Nickelback's own song &quot;Rockstar&quot;). The song was featured during a scene in the 2007 movie Evan Almighty. ZZ Top played this song at halftime of the 2008 FedEx Orange Bowl. It was also used in promo commercials for the tv series &quot;Burn Notice's&quot; 2009 season on USA Network.\n\nBrad Paisley released a country version of the song as a single in 2002, which also appeared on the album Sharp Dressed Men: A Tribute to ZZ Top.\n\nSharp Dressed Men: A Tribute to ZZ Top is a tribute album released in 2002 featuring various country music artists performing classic ZZ Top songs.\n\nPaisley's albums have accounted for 23 singles on the Billboard Hot Country Songs charts, all but two of which have reached Top Ten. Fourteen of his singles have reached #1 on this chart as well. This includes a streak of ten consecutive chart-toppers, starting with the late 2005-early 2006 Dolly Parton duet &quot;When I Get Where I'm Going&quot;. When &quot;Waitin' on a Woman&quot;, the eighth of these, reached #1 in September 2008, Paisley set a new record for the most consecutive Number Ones by any country artist since the inception of Nielsen SoundScan in 1990.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:41844a8c3e7e594f06689fe6392591d848339349","amp;dn":"Brad+Paisley+-+Sharp+Dressed+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41844a8c3e7e594f06689fe6392591d848339349","infoHashBuffer":{"type":"Buffer","data":[65,132,74,140,62,126,89,79,6,104,159,230,57,37,145,216,72,51,147,73]},"announce":[],"urlList":[]}}