{"title":"Theatre.of.War.2.Kursk.1943-SKIDROW","uid":5423382,"size":1294350209,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:432f434d18f910d2931db2c9d0150074661605e5&amp;dn=Theatre.of.War.2.Kursk.1943-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thenoobish","files":35,"time":1268160017,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nTheatre of War 2 Kursk 1943 / Battlefront  1C Company\n\nRELEASE DATE : 09-03-2010               PROTECTION : eLicense\nGAME TYPE    : Strategy                 DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nTheatre of War 2: Kursk 1943 is a completely new game in the\nTheatre of War series of tactical World War II titles. It does\nnot require any of the previous games to play!\n\nThe Battle of Kursk lasted for forty nine days, from July 5\nuntil August 23, 1943 and has made its way into history as one\nof the most crucial conflicts of WWII. It was the last armored\nstrategic offensive the Germans were able to mount in the\neast. The resulting decisive Soviet victory gave the Red Army\nthe strategic initiative for the rest of the war.\n\nAssuming the role of either the Russian or German battle group\ncommander, acting under direct orders of division commanders\nIvan Chistyakov or Walter Hoernlein, players will control\ntheir troops in historical scenarios on precisely\nreconstructed authentic battlefields.\n\nFive days of July\n\nIn Theatre of War 2: Kursk 1943, you control the units of the\nbattle group belonging to German division Grossdeutschland or\nthe forces of the Soviet 67th Guards Rifle Division and 3rd\nMechanized Corps, which participated in the defensive stage of\nthe Kursk battle at the south face of the Kursk salient. There\nare two campaigns  German and Soviet:\n\nFiery Salient  (forces of the Soviet 6th Guards and 1st Tank\nArmy, July 5-10, 1943)\n\nOperation Citadel (German division Grossdeutschland\nKampfgruppe, July 5-10, 1943)\n\nEach campaign consists of up to 9 major battles and puts you\nin charge of a typical military unit from that period. Each\nsoldier is a unique personality with specific characteristics\nand skills which can change during the campaign. Careful\nplanning and force selection are recommended before each\nbattle.\n\nTake control over a powerful Soviet or German battle group in\none of the battles which changed the history of the war\n\nFully simulated visibility, ballistics and armor penetration\nsystems. All vital vehicle systems and crew members are\nindividually modeled\n\nTwo historical campaigns (up to 18 major engagements in total)\nand an unlimited number of customizable missions waiting to be\ncreated with a few mouse clicks using the built-in Mission\nGenerator\n\nSophisticated AI for both enemy and your own units\n\nOver 60 Soviet, German and lend-leased US and British\nplayer-controllable units (not counting various infantry\nsquads)\n\nUnsurpassed management of your soldiers. You can assign,\npromote and award up to several thousand soldiers with their\nunique characteristics. You can even rename units for easier\nrecognition in the heat of battle;\n\nTeam multiplayer for up to 8 players (control of key points or\nassault/defense) with reinforcements, artillery barrages and\nair strikes\n\nTools for creating your own missions and maps (built-in\nMission Generator, wizard-like Simple Editor, full-blown\nMission Editor and 3D Map Editor).\n\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:432f434d18f910d2931db2c9d0150074661605e5","amp;dn":"Theatre.of.War.2.Kursk.1943-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"432f434d18f910d2931db2c9d0150074661605e5","infoHashBuffer":{"type":"Buffer","data":[67,47,67,77,24,249,16,210,147,29,178,201,208,21,0,116,102,22,5,229]},"announce":[],"urlList":[]}}