{"title":"Franz Ferdinand - This Fire","uid":4732442,"size":131080196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4340f1cdac3d03d16a3eed19863623fb49e414e3&amp;dn=Franz+Ferdinand+-+This+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1235098835,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;This Fire&quot; is the fifth single by Scottish rock band Franz Ferdinand from their eponymous album. It was not as successful as their other singles, but received widespread airplay.\n\nIt was released as a download-only single, and reached #17 on the United States Billboard Modern Rock Tracks chart and #8 on the UK Download Chart. In Australia, the song was ranked #29 on Triple J's Hottest 100 of 2004.\n\nIt was featured on the in-game soundtrack to the PlayStation 2 and Xbox video game Burnout 3: Takedown. The song has become part of the hockey culture in Calgary, Alberta, where it is played in every Calgary Flames home game.\n\nThe single was released in Australia as &quot;This Fffire&quot; [sic] with identical b-sides to the UK release of &quot;Michael&quot;. The music video for the song was directed by Stylewar.\n\nThe song was later sampled for Burn This City by rapper Lil Wayne &amp; Twista.\n\nThe album artwork to &quot;This Fire&quot; is based on El Lissitzky's art work; &quot;Beat the Whites with the Red Wedge&quot;\n\nFranz Ferdinand are a Scottish rock band that formed in Glasgow, Scotland in 2002. Named after Archduke Franz Ferdinand of Austria, the band comprises Alex Kapranos (lead vocals and guitar), Bob Hardy (bass guitar), Nick McCarthy (rhythm guitar, keyboards and backing vocals), and Paul Thomson (drums, percussion and backing vocals).\n\nThe band first experienced chart success when their second single &quot;Take Me Out&quot; reached #3 in the UK Charts, followed by their debut album Franz Ferdinand which debuted on the UK album chart at #3. The band went on to win the 2004 Mercury Music Prize and two BRIT Awards in 2005 for Best British Group and Best British Rock Act. NME named Franz Ferdinand as their Album of the Year. From the album, three top-ten singles were released, &quot;Take Me Out&quot;, &quot;The Dark of the MatinÃƒÂ©e&quot; and &quot;This Fire&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4340f1cdac3d03d16a3eed19863623fb49e414e3","amp;dn":"Franz+Ferdinand+-+This+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4340f1cdac3d03d16a3eed19863623fb49e414e3","infoHashBuffer":{"type":"Buffer","data":[67,64,241,205,172,61,3,209,106,62,237,25,134,54,35,251,73,228,20,227]},"announce":[],"urlList":[]}}