{"title":"Dean Koontz - Frankenstein - Book 4 -  Lost Souls","uid":5640985,"size":509256466,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:46d4cd2b4a4657461829dc17d0b1f67d50916770&amp;dn=Dean+Koontz+-+Frankenstein+-+Book+4+-++Lost+Souls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rmctmrx6","files":108,"time":1277106538,"description":"Dean Koontz - Frankenstein - Book 4 - Lost Souls (unabridged) 128 kbps\n\nIn Frankenstein: Lost Souls, Dean Koontz puts a singular twist on this classic tale of ambition and science gone wrong, to forge a new legend uniquely suited to our times. It is a story of revenge, redemption, and the thin line that separates human from inhuman.\n\nThe work of creation has begun again. Victor Leben, once Frankenstein, has seen the future - and he's ready to populate it. Using stem cells, &quot;organic&quot; silicon circuitry, and nanotechnology, he will engender a race of superhumans - the perfect melding of flesh and machine. With a powerful, enigmatic backer and a secret location where the enemies of progress can't find him, Victor is certain that this time nothing can stop him.\n\nIt is up to five people to prove him wrong. In their hands rests nothing less than the survival of humanity itself. They are drawn together in different ways, by omens sinister and wondrous, to the same shattering conclusion: Two years after they saw him die, the man they knew as Victor Helios lives on. As they gather at a small Montana town, old alliances will be renewed and tested, from within and without, for the dangers they face will eclipse any they have yet encountered. Yet in the midst of their peril, love will blossom, and joy, and they will discover sources of strength and perseverance they have not imagined.\n\nThey will need them, for a monumental battle is about to commence that will require all their ingenuity and courage, as it defines what we are to be...and if we are to be at all.","torrent":{"xt":"urn:btih:46d4cd2b4a4657461829dc17d0b1f67d50916770","amp;dn":"Dean+Koontz+-+Frankenstein+-+Book+4+-++Lost+Souls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46d4cd2b4a4657461829dc17d0b1f67d50916770","infoHashBuffer":{"type":"Buffer","data":[70,212,205,43,74,70,87,70,24,41,220,23,208,177,246,125,80,145,103,112]},"announce":[],"urlList":[]}}