{"title":"Alex Jones Show Enhanced Edition - July 13, 2008 - Sun - Chapman","uid":4296472,"size":28452241,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:47d73d53585578eb14455ac2b397f7fd1cb24ff5&amp;dn=Alex+Jones+Show+Enhanced+Edition+-+July+13%2C+2008+-+Sun+-+Chapman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Femacamper","files":10,"time":1216103032,"description":"The Alex Jones Show, Enhanced Edition\n\nVeteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you\nthought-provoking interviews and takes an in-depth look at the news between the\ndaily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines\nhis media presence with actual physical activism, a practice that once led to\nhim being arrested on the personal order of George W. Bush! Alex Jones has\ngained international attention for standing up for what he believes in.\n\nFrom La Prensa to the Wall Street Journal and USA Today, Jones has brought the\ninformation war to the mainstream print media worldwide, speaking out against\ntyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing\npersonalities in the world from guerrilla journalists to government officials to\nwhistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any\nother on the air. Jones is a seasoned investigative journalist who has broken\nhundreds of national stories during his career. He is an aggressive\nConstitutionalist who digs deeply into the facts to defend property rights, our\nnational borders, and the Second Amendment while he sends out a rallying call to\nthe American people to resist foreign entanglements and wars for corporate\ninterests. Jones eschews the bogus political labels of left and right and\ninstead focuses on what really matters: right and wrong.\n\nSunday, July 13th, 2008\n\nCRASHING THRU THE LIES..........KLBJ Sunday\n\nListen to Alex&amp;#039;s Sunday Edition, a round-up of the week past and the week ahead,\nbroadcast from the studios of KLBJ AM in Austin, Texas. 4 to 6 pm CST and\nsyndicated coast to coast. This week, Alex talks about the impending meltdown of\nthe global economy. Guests include Bob Chapman of the International Forecaster\nand Jordan Maxwell, author, lecturer and radio host.\n\nOriginal capture by modemho (Total Recorder 4.4 Capture in 48 kbs stereo from Ku\nsatellite feed or 56 kbs internet streaming audio, two hours cut down to 1:20\nwith commercial edit). Converted to .wav, extra advertising removed. Re-encoded\ninto segments. Editing done using Audacity with labels. Genre tag set to Podcast\nfor better ipod compatibility with bookmarking and chapter support. Tags edited\nand show description inserted with Audacity. Pictures inserted with Mp3tag. Send\nfeedback to femacamper -at- gmail -dot- com. Used with permission. Alex Jones\nauthorizes you to use and redistribute his materials for non-profit, educational\npurposes:\n\nGo here if there are no seeds: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg225409#msg225409&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg225409#msg225409&lt;/a&gt;\n\nOr you can do up your own .mp3s here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=45157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=45157&lt;/a&gt;\n\nDownload the daily .mp3 here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&lt;/a&gt;\n\nOr listen live or on demand at\n\nWatch the latest Alex Jones film: Truth Rising, online at PrisonPlanet.tv: &lt;a href=&quot;\nhttp://www.prisonplanet.tv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.prisonplanet.tv&lt;/a&gt;","torrent":{"xt":"urn:btih:47d73d53585578eb14455ac2b397f7fd1cb24ff5","amp;dn":"Alex+Jones+Show+Enhanced+Edition+-+July+13%2C+2008+-+Sun+-+Chapman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47d73d53585578eb14455ac2b397f7fd1cb24ff5","infoHashBuffer":{"type":"Buffer","data":[71,215,61,83,88,85,120,235,20,69,90,194,179,151,247,253,28,178,79,245]},"announce":[],"urlList":[]}}