{"title":"THE MISSING LINK-(WTC-SWE)","uid":4499478,"size":734263140,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47e4c0e1ed6c40c0292646c6ab4e6a0e32c50444&amp;dn=THE+MISSING+LINK-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1226338021,"description":"BBC:\n----\n\n                            THE MISSING LINK\n                           ------------------\n\nYear 2000 the discovery of a tiny fossilised jawbone hit the headlines. The jawbone, only a few centimetres long with seven rows of teeth, was found abandoned in a dusty museum where it had lain unnoticed for decades. Its rediscovery has caused a sensation in the world of palaeontology because scientists now believe it may be a tiny remnant of a 'missing link', an ancient extinct animal that could provide a vital clue in our understanding of one of the great mysteries of science - how, 360 million years ago, a slimy fish-like creature grew legs and walked out of the water, onto the land to become our ancestor. This mystery has taken scientists a century to unravel. And this tiny jawbone may be a final clue.\n\nFinding what linked fish and four-limbed beasts together would become a palaeontological obsession. One explanation, developed in the 1930s, dominated all the textbooks for decades. It spoke of a drought, millions of years ago. Fish must have been trapped in drying pools and, to avoid death, a few would have hobbled on their fins, out of their puddles, in search of deeper water. On the way, their fins would have developed legs, and so it became widely accepted that our legs had evolved for the express purpose of walking on land. It seemed to explain everything.\n\nBut without anything directly linking fish to four-legged animals, no one could quite be sure. Something just had to be found. Over the decades there have been some wonderful wild goose chases in search of the elusive missing link, including the discovery in South Africa, of the ancient living fossil, the Coelacanth. But in the end the whole theory of why we grew our legs was to be completely overturned when a team of British scientists stumbled on a trail of clues that led from some scrawled notes in a student's notebook, via a mountainside in Greenland, to a chest of drawers in a museum in Latvia that had been ignored for thirty years.\n\nIt was in this chest of drawers, that palaeontologist Per Ahlberg, working for the Natural History Museum, discovered the five centimetre long jaw of a truly strange beast. The jaw was half that of a fish, half that of a land-animal. And it was the final piece of evidence for a completely new theory for the reason why we developed legs.\n\n\n\n\nFile Size: 700 MB \nFormat:AVI\nVideo Length: 00:43:45\nVideo Codec:DivX5\nVideo Resolution: 640x480\nVIdeo Bitrate: 2182 kbit/s\nFPS: 25.000\nAudio Bitrate: 128kbit/s\nAudio Codec: MPEG Layer -3\nSubtitles:(External English)\n\n\n   &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0605207/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0605207/&lt;/a&gt;\n   \n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n                                                \n                                        \n\n\n\nNote: External English subtitles included.\n------------------------------------------","torrent":{"xt":"urn:btih:47e4c0e1ed6c40c0292646c6ab4e6a0e32c50444","amp;dn":"THE+MISSING+LINK-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e4c0e1ed6c40c0292646c6ab4e6a0e32c50444","infoHashBuffer":{"type":"Buffer","data":[71,228,192,225,237,108,64,192,41,38,70,198,171,78,106,14,50,197,4,68]},"announce":[],"urlList":[]}}