{"title":"Overkill - Hello From The Gutter","uid":4767508,"size":150149124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4c695937ee9dd2b32fb150641f2f260274b5b76d&amp;dn=Overkill+-+Hello+From+The+Gutter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1236926798,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nUnder The Influence is the third studio album by thrash metal band Overkill in 1988 on Megaforce Records. This was the first Overkill release to feature Sid Falck on drums. The album spawned the single &quot;Hello From The Gutter&quot;, and the music video achieved regular airplay on MTV's Headbangers Ball.\n\nOverkill released the follow-up to Taking Over, the aptly titled Under the Influence, in 1988. Once again produced by Alex Perialas, Under the Influence was much more raw and thrashy, lacking most of the grand and epic atmosphere of its predecessor. Suffering from rushed writing and production, the album is often regarded as a snapshot and a step backwards for the band. The song &quot;Hello From The Gutter&quot; was released as a single, and the music video gained regular airplay on MTV's Headbangers Ball. Overkill kept up constant touring all over the world, furthering their reputation as one of the most active live metal bands.\n\nOverkill is an American thrash metal band, formed in 1980 in New Jersey. The band has been recording since 1984, releasing 14 studio albums, 2 EPs, 2 live albums and a &quot;covers&quot; album. Overkill has gone through many line-up changes, with singer Bobby &quot;Blitz&quot; Ellsworth and bassist D.D. Verni remaining the only consistent members. The band also has a notable mascot (named Chaly), a skeletal bat with a skull-like face, bony wings, and green eyes. It has appeared on most of their album covers.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4c695937ee9dd2b32fb150641f2f260274b5b76d","amp;dn":"Overkill+-+Hello+From+The+Gutter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c695937ee9dd2b32fb150641f2f260274b5b76d","infoHashBuffer":{"type":"Buffer","data":[76,105,89,55,238,157,210,179,47,177,80,100,31,47,38,2,116,181,183,109]},"announce":[],"urlList":[]}}