{"title":"E.M.DVD Copy v 2.7.2  WITH PATCH","uid":5362708,"size":5572129,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e988fa23389c657ce0a9eced83938a24a6cbcd4&amp;dn=E.M.DVD+Copy+v+2.7.2++WITH+PATCH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":1,"time":1266164320,"description":"E.M.  DVD Copy is a DVD rip and copy software which can Copy DVD to AVI, WMV, MPEG, FLV, Jpeg, etc.  The pro. version can rip DVD movies to iPod, iPhone, PSP video, Zune , XBOX360, Mobile phone(Nokia, Sony Ericsson, Motorola), and copy DVD to AVI, MPEG, MPEG2 TS, MP4, WMV, 3GP, GIF, FLV, SWF, H.264/MPEG-4 AVC, H.264/PSP AVC Video, MOV,FLV, etc. video format. By using E.M. Free DVD Copy, you can easily copy, shrink and burn your whole DVD at a high speed and with high quality. You can also copy or shrink your favorite titles, pgc, chapters, subtitles and audios to hard disk or blank DVD disc. The size of the compressed DVD movie can be decreased to 20% of the original file and it supports ripping and copying scratched DVD.\n\n  \n\n      \nNew Features of E.M.  DVD Copy 2.72:\nImproved DVD Ripping engine performance.\n\nNew Features of E.M. Free DVD Copy 2.60:\n1. New DVD ripper and DVD Copier GUI.\n2. New stable codec engine.\n3. Bugs Fixed: cann't out .wmv files.\n\n\n  E.M.  DVD Copy has a friendly user interface which makes copying your DVD more convenient. With an advanced video compression engine and high copy speeds. E.M. Free DVD Copy gives you a perfect copy and the quality of which will be exactly the same as the original . You can personalize your DVD by choosing your favorite chapters, subtitles and audio. In order to save your disc space, you can remove certain unwanted content and then recompress video with certain compression ratio. You can copy your dvd movie to hard disk or blank DVD disc.\n              The difference between E.M. Free DVD Copy and E.M. Pro. DVD Copy\n\nFunctions\n E.M. Free DVD Copy\n E.M. Pro. DVD Copy\n \nCopy DVD\n  yes\n  yes\n \nCompress DVD\n  yes\n  yes\n \nOutput Format\n AVI, mpeg, wmv, flv, jpeg\n mpeg4, 3gp,\nWMV, ASF, \nMov, iPod, \niPhone, Apple TV,\n PSP, Nokia, \nSonycellphone, \nAVI, Divx,\n Xvid, H264, \nMjpeg, Swf, \nFLV, Gif, \nDVD mpeg, SVCD mpeg, VCD mpeg, Apple Quicktime, HD Mpeg TS, MPEG1 etc.\n \nWater Mark\n yes\n no\n \nTime Limited\n some outformats only can be tried for 15 days\n no\n \nPrice\n free!\n $25.95\n \n\nTutorials:\n\nHow to Copy DVD \n\nHow to  Copy DVD, Rip DVD to Any Video and Audio Format\n\nHow to Copy DVD, Rip DVD to iPod\n\nHow to Copy DVD, Rip DVD to iPhone\n\nHow to Copy DVD, Rip DVD to PSP\n\nHow to Copy DVD, Rip DVD to Nokia video\n\nHow to Copy DVD, Rip DVD to Zune\n\nMain Functions:\n\n. Copy DVD to hard disc - you can copy your whole DVD collection at a high speed while giving you an exact copy of your DVD.\n\n. Shrink DVD movie - The size of the compressed DVD movie can be decreased to 20% of the original file.\n\n. Copy DVD, Rip DVD to Video - It can copy DVD, rip DVD movie to AVI, WMV, FLV, Jpeg etc.\n\nMain Features: \n\n. Copy DVD Features\n\n. Copy DVD movie to hard disc or burn it to target disc\n\n . Shrink DVD movie, The size of the compressed DVD movie can be  decreased to 20% of the original file.\n\n. Ripping and copying scratched DVDs.\n\n.Customize compression ratio\n\n. User specifies titles, PGC or chapters to be copied. \n\n. High copy speed with lossless quality .\n\n. Advanced compression engine. \n\n. Steady burn engine.\n\n. Support burning video folder to DVD movie \n\n. Support DVD-9\n\n. Easy to use.\n\nRip DVD Features:\n\n. Copy DVD and rip DVD to AVI, WMV,FLV, Mpeg, Jpeg formats\n\n. Advanced audio and video settings\n\n. Batch processing\n\n. Custom profile\n\n. Excellent audio and video quality\n\n. High ripping speed\n\nE.M. Pro. DVD Copy Main Features:\n\nThe Professional Version supports convert more formats than Free version and can convert DVD to  almost all video formats including  rip MPEG4, AVI, DivX, XviD, FLV, SWF, MOV, 3GP or FLV movie formats for iPod, iPhone, Zune, PSP or other portable video devices, MP4 player or smart phone.\n\nSupports converting DVD to the following file formats:\n\nVideo Formats:\n\n. Copy DVD, Rip DVD to MPEG4 (.mp4) \n\n. Copy DVD, Rip DVD to H264/AVC mpeg4(.mp4)\n\n. Copy DVD, Rip DVD o 3gp(.3gp, 3g2) \n\n. Copy DVD, Rip DVD to WMV (.wmv) \n\n. Copy DVD, Rip DVD to Zune (.wmv) \n\n. Copy DVD, Rip DVD to ASF (.asf)\n\n. Copy DVD, Rip DVD to SAMSUNG L55W DC (.mp4)\n\n. Copy DVD, Rip DVD to CASIO (.avi)\n\n. Copy DVD, Rip DVD to KODAK DC V550 (.mov)\n\n. Copy DVD, Rip DVD to iPod mpeg4 mov (.mov)\n\n. Copy DVD, Rip DVD to iPod mpeg4 (.mp4)\n\n. Copy DVD, Rip DVD to iPod H264 (.mp4)\n\n. Copy DVD, Rip DVD to iPhone mpeg4 (.mp4)\n\n. CCopy DVD, Rip DVD to iPhone H264 (.mp4)\n\n. Copy DVD, Rip DVD o Apple TV mpeg4 (.mp4)\n\n. Copy DVD, Rip DVD to Apple TV H264 (.mp4)\n\n. Copy DVD, Rip DVD to Game Psp (.mp4) \n\n. Copy DVD, Rip DVD to Nokia cellphone (.mp4, .3gp) \n\n. Copy DVD, Rip DVD to Sony cellphone (.mp4, .3gp) \n\n. Copy DVD, Rip DVD  to Ms Mpeg4 AVI (.avi) \n\n. Copy DVD, Rip DVD to Divx AVI (.avi) \n\n. Copy DVD, Rip DVD to Xvid AVI (.avi) \n\n. Copy DVD, Rip DVD to H264 AVI (.avi) \n\n. Copy DVD, Rip DVD to Mjpeg AVI (.avi) \n\n. Copy DVD, Rip DVD to HuffYUV AVI (.avi) \n\n. Copy DVD, Rip DVD to Swf Video (.swf) \n\n. Copy DVD, Rip DVD to FLV video(.flv)\n\n. Copy DVD, Rip DVD to Gif Animation (.gif) \n\n. Copy DVD, Rip DVD to NTSC, PAL DVD mpeg and Burn to DVD disc\n\n. Copy DVD, Rip DVD to NTSC, PAL SVCD mpeg and Burn to SVCD disc \n\n. Copy DVD, Rip DVD to NTSC, PAL VCD mpeg and Burn to VCD disc\n\n. Copy DVD, Rip DVD to Mpeg4 Mov (.mov) \n\n. Copy DVD, Rip DVD to Apple Quicktime (.mov) \n\n. Copy DVD, Rip DVD to HD Mpeg TS (.ts) \n\n. Copy DVD, Rip DVD to MPEG1 (.mpg, mpeg) \n\nAudio Formats:\n\n. Copy DVD, Rip DVD to wav and Burn to CD disc\n\n. Copy DVD, Rip DVD to wav\n\n. Copy DVD, Rip DVD  to MPEG audio(.mp3, mp2) \n\n. Copy DVD, Rip DVD to Ms WAV (.wav) \n\n. Copy DVD, Rip DVD to Ms WMA (.wma) \n\n. Copy DVD, Rip DVD to OGG (.ogg) \n\n. Copy DVD, Rip DVD to Amr audio (.amr) \n\n. Copy DVD, Rip DVD to Awb audio (.awb) \n\n. Copy DVD, Rip DVD to AC3 (.ac3) \n\n. Copy DVD, Rip DVD to SUN AU format (.au) \n\n. Copy DVD, Rip DVD to m4a (mp4 audio) \n\n. Copy DVD, Rip DVD to aac (aac audio)\n\n. Copy DVD, Rip DVD to mmf (mmf audio)\n\n. Copy DVD, Rip DVD to Flac (flac audio)\n\nImage Formats:\n\n. Copy DVD, Rip DVD to BMP (.bmp)\n\n. Copy DVD, Rip DVD to Jpeg (.jpg)\n\n. Copy DVD, Rip DVD to TGA (.tga)\n\n. Copy DVD, Rip DVD to TIFF (.tif)\n\n. Copy DVD, Rip DVD to PNG (.png)\n","torrent":{"xt":"urn:btih:4e988fa23389c657ce0a9eced83938a24a6cbcd4","amp;dn":"E.M.DVD+Copy+v+2.7.2++WITH+PATCH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e988fa23389c657ce0a9eced83938a24a6cbcd4","infoHashBuffer":{"type":"Buffer","data":[78,152,143,162,51,137,198,87,206,10,158,206,216,57,56,162,74,108,188,212]},"announce":[],"urlList":[]}}