{"title":"Legends of History and Their Final Meals - Andrew Caldwell","uid":6712601,"size":1183074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f693141973766e84d9c628b85567b528ad472e2&amp;dn=Legends+of+History+and+Their+Final+Meals+-+Andrew+Caldwell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":5,"time":1317415323,"description":"\nBook Description\n\nDid you know that Adolf Hitler was a vegetarian and his longtime private chef was Jewish? What dish played an integral role in Marilyn Monroe's unsuccessful bid to woo back Bobby Kennedy? Part historical narrative and part grilling guide and cookbook, Andrew Caldwell's Their Last Suppers: Legends of History and Their Final Meals guides history buffs and gourmands alike through gastronomically inspired biographical accounts of more than 20 legendary personalities.\n\nUnearthing recipes as far back as 323 B.C., Caldwell, the History Chef, provides insight into 2,000 years of culinary lore. Each historical figure's profile includes a brief description of pursuits and accomplishments as well as little-known anecdotes, popular foods of his or her time period, recipes for the figure's actual last meal, and cooking tips. Because the kitchens of Montezuma, Caesar, and other notables profiled within the book were often very basic, Caldwell brings their fare into modern kitchens, although he strongly believes that, whenever possible, grills and open fires should be used for most dishes and therefore provides specific preparation tips throughout.\n\nFrom the Titanic's 12-course tasting menu to personal recipes for Princess Diana's Favorite Watercress Soup, Elvis Presley's Fried Peanut Butter and Banana Sandwich, Julius Caesar's Ambrosia, Cleopatra's Hummus, and Stone Crab a la Kennedy, historians and foodies alike will relish the trivia and tastings paired within Their Last Suppers: Legends of History and Their Final Meals.\n\nAbout the Author\n\nAndrew Caldwell has worked as a classical chef in Bermuda, Mexico, and the United States. He has managed a number of resorts and overseen the development of more than 40 restaurants around the globe. A keen historian, Caldwell has visited many of the sites in this book to ensure its accuracy. He resides in Orlando, Florida, and maintains an online presence at www.thehistorychef.net.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4f693141973766e84d9c628b85567b528ad472e2","amp;dn":"Legends+of+History+and+Their+Final+Meals+-+Andrew+Caldwell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f693141973766e84d9c628b85567b528ad472e2","infoHashBuffer":{"type":"Buffer","data":[79,105,49,65,151,55,102,232,77,156,98,139,133,86,123,82,138,212,114,226]},"announce":[],"urlList":[]}}