{"title":"DVDFab Platinum 5-cracked(rip dvds to almost any format)","uid":4878360,"size":9190252,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5153d924e5b91bf3bdae0611392577d68325f116&amp;dn=DVDFab+Platinum+5-cracked%28rip+dvds+to+almost+any+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jmb2012","files":2,"time":1241248216,"description":"DVDFab 5.2.5.0 \n\nDVDFab Platinum/Gold:\n\n    * New: Added support for a new copy protection as found on &quot;Doubt&quot; (US).\n    * New: Improved DVD copying speed greatly.\n    * New: Improved PathPlayer speed in certain cases.\n    * New: Improved Preview startup speed.\n    * New: Added complete command line support, please read the readme.txt file to get the details.\n    * New: Added option &quot;Allow running multiple instances of DVDFab&quot;.\n    * New: Added option &quot;Avoid standby when processing&quot;.\n    * New: Added &quot;Tell Friend&quot; in help menu to recommend DVDFab to your friends.\n    * New: Improved Option usage logic. If you don't use an Option, it will show &quot;Never Be Used&quot; in About window, and the 30 days trial time will only be started when you use it for first time.\n    * New: Updated VSO burning engine.\n    * New: Updated language files.\n    * Fix: A PathPlayer problem that playable content be removed in certain cases.\n    * Fix: An exit problem when opening DVD using PathPlayer in certain cases.\n    * Fix: A pause problem on standalone player in certain cases.\n    * Fix: A wrong default audio/subpicture problem when removing some audio/subpicture streams.\n\nDVDFab Mobile Option:\n\n    * New: Increased DVD conversion speed greatly, especially on multi-core system.\n    * New: Added option &quot;Enable &quot;Turbo CPU&quot; for maximum cpu usage&quot; in &quot;Settings -&gt; DVD to Mobile -&gt; Convert&quot;. If you don't want to use 100% cpu, you can disable it.\n    * New: Added &quot;Output&quot; window in &quot;Settings -&gt; File to Mobile&quot;.\n    * New: Added new &quot;Name output file based on pattern&quot; feature, which you can specify the output file name based on several information like Volume, Title, Chapter, VideoCodec, AudioCodec, Year, Month and Day.\n    * New: Added &quot;Deinterlacing&quot; option in &quot;Conversion Settings&quot; window.\n    * New: Added &quot;Channel&quot; option in &quot;Conversion Settings&quot; window.\n    * New: Added &quot;Default Audio Channel&quot; option in &quot;Settings -&gt; DVD to Mobile -&gt; Convert&quot; window, user can choose from &quot;Same as Source&quot; or &quot;Specified in profile&quot;.\n    * New: Added &quot;Audio Downmix from multichannel to stereo&quot; option in &quot;Settings -&gt; DVD to Mobile -&gt; Convert&quot; window, user can choose from &quot;Stereo&quot;, &quot;Dobly Surround / ProLogic&quot; or &quot;Dobly ProLogic II&quot;.\n    * New: Added 5.1 multichannel output for PS3 and Xbox 360.\n    * New: Added 5.1 multichannel output for audio only MP4 and WAV.\n    * New: Added &quot;Dobly Surround / ProLogic&quot; and &quot;Dobly ProLogic II&quot; option for 5.1 multichannel downmix to stereo.\n    * New: Added support for stereo upmix to 5.1 multichannel.\n    * New: Added profiles to create AVI for DivX compatible player. Thanks for signals!\n    * New: Reduced memory usage when converting file to Xbox 360 or Zune.\n    * Fix: An error &quot;531 2-12&quot; for some special DVDs like &quot;GIDEON_TUBA_WARRIOR&quot; and &quot;AIRPLANE!&quot;.\n    * Fix: A freeze problem when converting subpicture to idx/sub files in certain cases.\n    * Fix: A freeze problem when converting in certain cases.\n    * Fix: A crash problem when converting file to MP3 in certain cases.\n    * Fix: A crash problem when converting file to Xbox 360 or Zune in certain cases.\n    * Fix: Converted WMV file cannot be played in certain cases.\n    * Fix: Wrong time shown in PSP for converted MP4 file.\n    * Fix: Cannot create correct thumbnails in &quot;Advanced Resolution Settings&quot; for special DVDs.\n    * Fix: Output video with double image for special DVDs.\n    * Fix: Output video is stretched (wrong aspect ratio) in certain cases.\n    * Fix: Volume adjusting doesn't work in certain cases.\n===================================================================================\n\n\nFeatures Highlight\nA. DVD to DVD\n\n   1. 8 DVD to DVD copy modes available: Full Disc, Main Movie, Split, Customize, Customize Split, Clone, Merge and Write Data.\n   2. Full Disc: All movies, menus and trailers, is copied to a DVD with just one click.\n   3. Main Movie: Just copy the movie, with specific audio/subpicture.\n   4. Split: Copy a DVD-9 onto two DVD-5 discs with 100% quality, and preserve original menus on both discs. Ideal for episodic/season DVD movies, TV series, etc.\n   5. Customize: Personalize your DVDs! Want to make a DVD with only your favorite titles? How about cutting out those annoying commercials? Or selecting specific audio/subpicture? No problem! You can select just your favorite titles, specify the title playback order, with or without original menus, to create a DVD with only the stuff you want!\n   6. Customize Split: Copy a DVD-9 onto two DVD-5 discs using &quot;Customize&quot; way. Ideal for episode/season DVD.\n   7. Clone: Make perfect 1:1 bit-to-bit copy of DVDs:\n          * Make perfect dual layer DVD copy by using the original layer break position.\n          * Copy data DVD disc, like PS2 DVD.\n   8. Merge: Combine several titles of several sources into one DVD:\n          * Combine two DVD-9 like &quot;The Lord of the Rings&quot; into one DVD-9.\n          * Merge season DVDs to fewer discs.\n          * Create your own special features collection disc.\n   9. Write Data: Burn existing DVD folder or ISO image file to DVD writer, or convert DVD folder to ISO image file.\n  10. Burn to any blank DVD Disc (DVD+R/RW, DVD-R/RW, DVD+R DL, DVD-R DL).\n  11. Constantly updated to support latest DVD burners and blank DVD discs.\n\nB. Benefits\n\n   1. Remove all DVD copy protections, like CSS, CPPM, RC, RCE, APS, UOPs, ARccOS, RipGuard, FluxDVD, CORE X2, etc.\n   2. Constantly updated to support latest DVD copy protections.\n   3. Very fast copying speed, normally it's about 10 - 20 minutes.\n   4. Backup scratched/dirty disc:\n          * Even if some information (IFO) cannot be read, you can still copy Main Movie or Customize.\n          * Recovery from DVD reading (VOB) error.\n   5. Support both NTSC and PAL DVD.\n   6. Preview title like real DVD player.\n\n\nSystem Requirements\n\n    * Windows Vista/XP/2000/98/ME\n    * Pentium II 500 MHz\n    * 256 MB of RAM\n    * 10 GB of Free Hard Disk Space\n    * A DVD-R(W) or DVD+R(W) Drive\n &lt;a href=&quot;\nhttp://www.dvdfab.com/index.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvdfab.com/index.htm&lt;/a&gt;\n\n\n\nscanned with Avast! &amp; Outpost anti-spyware","torrent":{"xt":"urn:btih:5153d924e5b91bf3bdae0611392577d68325f116","amp;dn":"DVDFab+Platinum+5-cracked%28rip+dvds+to+almost+any+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5153d924e5b91bf3bdae0611392577d68325f116","infoHashBuffer":{"type":"Buffer","data":[81,83,217,36,229,185,27,243,189,174,6,17,57,37,119,214,131,37,241,22]},"announce":[],"urlList":[]}}