{"title":"C. J. Cherryh - Deliverer","uid":11528726,"size":211466262,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:52a053cf5268fdb30d7b4598eabeff0094186e8e&amp;dn=C.+J.+Cherryh+-+Deliverer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cybotage","files":1,"time":1416546159,"description":"In the aftermath of civil war, the world of the atevi is still perilously unstable. Tabini-aiji, powerful ruler of the Western Association, along with his son and heir, and his human paidhi, Bren Cameron, have returned to their seat of power. The usurper, Murini, has escaped to the lands of his supporters, but the danger these rebels pose is far from over. Ilisidi, Tabini's grandmother, the aiji-dowager, has returned to her ancient castle in the East, for though she supports the rule of her grandson, she also has powerful ties in the lands of the rebels, and she seeks to muster whatever support she can from among those enemy strongholds.\n\nIn his father's heavily armed and tightly guarded headquarters, eight-year-old Cajeiri is horribly bored. Two years on an interstellar starship surrounded by human children have left him craving excitement and the company of his peers. But unbeknownst to this dissatisfied youngster he has become a target for forces bent on destroying his father's rule and everything it stands for. Though still a child, Cajeiri embodies a unique threat to the venerable, tradition-defined lifestyle of his people. For this innocent young boy is the first ateva youth to have lived in a human environment, surrounded by human children. And after hundreds of years of fragile, tenuous atevi-human coexistance, Cajeiri may very well be the first ateva to ever truly understand the so similar yet so dangerously different aliens who share his home planet and threaten the hidebound customs of his race","torrent":{"xt":"urn:btih:52a053cf5268fdb30d7b4598eabeff0094186e8e","amp;dn":"C.+J.+Cherryh+-+Deliverer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52a053cf5268fdb30d7b4598eabeff0094186e8e","infoHashBuffer":{"type":"Buffer","data":[82,160,83,207,82,104,253,179,13,123,69,152,234,190,255,0,148,24,110,142]},"announce":[],"urlList":[]}}