{"title":"Quadrophenia - Can You See The Real Me?","uid":7403030,"size":730873856,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:53029eb1ff1f90c14aacf103d27d9b9d0003ff91&amp;dn=Quadrophenia+-+Can+You+See+The+Real+Me%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JorgosDosBurgos","files":1,"time":1341162468,"description":"Quadrophenia: Can You See the Real Me?\nBBC 4\n\nIn his home studio and revisiting old haunts in Shepherds Bush and Battersea, Pete Townshend opens his heart and his personal archive to revisit 'the last great album the Who ever made', one that took the Who full circle back to their earliest days via the adventures of a pill-popping mod on an epic journey of self-discovery.\n\nBut in 1973 Quadrophenia was an album that almost never was. Beset by money problems, a studio in construction, heroin-taking managers, a lunatic drummer and a culture of heavy drinking, Townshend took on an album that nearly broke him and one that within a year the band had turned their back on and would ignore for nearly three decades.\n\nWith unseen archive and in-depth interviews from Townshend, Roger Daltrey, Keith Moon, John Entwistle and those in the studio and behind the lens who made the album and thirty page photo booklet.\n\nContributors include: Pete Townshend, Roger Daltrey, Ethan Russell, Ron Nevison, Richard Barnes, Irish Jack Lyons, Bill Curbishley, John Woolf, Howie Edelson, Mark Kermode and Georgiana Steele Waller ","torrent":{"xt":"urn:btih:53029eb1ff1f90c14aacf103d27d9b9d0003ff91","amp;dn":"Quadrophenia+-+Can+You+See+The+Real+Me%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53029eb1ff1f90c14aacf103d27d9b9d0003ff91","infoHashBuffer":{"type":"Buffer","data":[83,2,158,177,255,31,144,193,74,172,241,3,210,125,155,157,0,3,255,145]},"announce":[],"urlList":[]}}