{"title":"Milkcan - Make It Sweet!","uid":10458133,"size":52904949,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:536bdea4786c5e7adfd941a800b758a90d0cd08f&amp;dn=Milkcan+-+Make+It+Sweet%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lsddreamemu","files":1,"time":1404100375,"description":"Make It Sweet was the only album by the alternative rock/virtual band MilkCan, released on June 19, 1999. It acted as the soundtrack to the PlayStation video game UmJammer Lammy (a spin-off title of the revolutionary music game PaRappa the Rapper.) Instead of featuring music taken directly from the game, the album features music performed by MilkCan with vocals by Michele Burks as Katy Kat. On a few tracks, most notably &quot;Power Off! Power On!&quot;, &quot;Baby Baby!!&quot;, and &quot;Taste of Teriyaki!!&quot;, Katy shares the vocals with the masters in the game.\n\nIn November 1999 an official soundtrack with the original music from the game was released.\n\nIn the United States, the album was not released due to the commercial failure yet critical success of Um Jammer Lammy. Because of that, the album was put for download on the Internet for free, although not on iTunes or Rhapsody.\n\nCritical response to the album was mixed. Some fans praise the album for having an individuality, while some panned the album due to its &quot;shrillness&quot; or the fact that Katy now takes over the vocals.\n\nIn 2000, on MilkCan's now-defunct band site (http://milkcan.com; can be mentioned on &quot;Radio Signal Jam&quot;), the fictional band members gave their own reasons on why to buy the album via video. Ma-San's reason is unknown, as she didn't have any subtitles, but Lammy's and Katy's reasons were that the album was good in their opinions.","torrent":{"xt":"urn:btih:536bdea4786c5e7adfd941a800b758a90d0cd08f","amp;dn":"Milkcan+-+Make+It+Sweet%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536bdea4786c5e7adfd941a800b758a90d0cd08f","infoHashBuffer":{"type":"Buffer","data":[83,107,222,164,120,108,94,122,223,217,65,168,0,183,88,169,13,12,208,143]},"announce":[],"urlList":[]}}