{"title":"Coast to Coast Radio Program! Commercial Free! Nov 8th thru Nov","uid":4513813,"size":442610940,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:5637726608b8b89245c7de71e666701cec4da6fe&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+8th+thru+Nov+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":40,"time":1226889810,"description":"Well, here we are again people. Eight more broadcasts of C2C for you all to enjoy! Download, SEED, and Enjoy. Thanks in advance to all those who seed these torrents and upload to other sites. I appreciate it as do others. Until we meet again.... Stokeman Out.....\n\nSaturday November 8th, 2008\nEnd of the Industrial Age\nResearcher and explorer in alternative realities John Michael Greer discussed his new work exploring the decline and fall of the Industrial Age and what it means to our future. According to Greer, the end of our civilization will be a gradual process... \nHost: Ian Punnett\nGuest(s): John Michael Greer, Brad Matsen\n\nSunday November 9th, 2008\nMind Control &amp; Project Monarch\nJournalist and occult expert Tracy Twyman discussed the shocking stories from her new book, Mind Controlled Sex Slaves and the CIA. She covered a number of infamous accounts within this realm, such as the story of Cathy O&amp;#039;Brien, the Franklin Cover-Up,... \nHost: Ian Punnett\nGuest(s): Tracy Twyman\n\nMonday November 10th, 2008\nCatastrophic Earth Changes\nResearcher Brent Miller of the Horizon Project discussed past evidence for sudden catastrophic earth changes, and warned we could be nearing another such event, possibly occurring in 2012. Calamities such as a pole shift are likely caused by passing space... \nHost: George Noory\nGuest(s): Brent Miller, Michael Shedlock\n\nTuesday November 11th, 2008\nPurging Negative Spirits\nExorcist and psychic Jeffrey Seelman discussed his work with negative and demonic spirits, and what it takes to purge them from an environment. Negative spirits are typically deceased persons who were negative while they were alive, while demonic entities... \nHost: George Noory\nGuest(s): Jeffrey Seelman, Dannion Brinkley, Katherine Albrecht\n\nWednesday November 12th, 2008\nTales of a Paranormalist\nInvolved with the paranormal from an early age, author Timothy Green Beckley shared details of UFO encounters, and stories from his life and career. As a teenager, he created one of the first UFO periodicals, which he collated together with mimeographed... \nHost: George Noory\nGuest(s): Timothy Green Beckley, Gerald Celente\n\nThursday November 13th, 2008\nAlcohol Fuel Advantages\nAn expert in alternative fuels and sustainable agriculture, David Blume discussed the advantages of using alcohol-based fuels, which he said are 98% pollution free. In addition to making us less dependent on foreign oil, using such fuels can help reverse...\nHost: George Noory\nGuest(s): David Blume, Larry Toups\n\nFriday November 14th, 2008\nTense Moments\nDuring Open Lines, George offered a &amp;#039;tense moment&amp;#039; hotline. Jerry in Toronto said he became agitated after being approached by a stranger one night on his walk home from the subway station. According to Jerry, the man claimed to have a weapon and asked... \nHost: George Noory\nGuest(s): Open Lines, Peter Joseph\n\nSaturday November 15th, 2008\nPhony Biblical Relics\nInvestigative reporter Nina Burleigh talked about the James Ossuary and other contentious archaeological &amp;#039;finds&amp;#039; from the Holy Land. Many of the archaeological digs in Israel are being financed and carried out by Fundamentalist Christians, Burleigh said.... \nHost: Ian Punnett\nGuest(s): Nina Burleigh, Dr. Jeffrey Meldrum","torrent":{"xt":"urn:btih:5637726608b8b89245c7de71e666701cec4da6fe","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Nov+8th+thru+Nov+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5637726608b8b89245c7de71e666701cec4da6fe","infoHashBuffer":{"type":"Buffer","data":[86,55,114,102,8,184,184,146,69,199,222,113,230,102,112,28,236,77,166,254]},"announce":[],"urlList":[]}}