{"title":"I Know Why The Aliens Don't  Land","uid":4338970,"size":3038669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5debb6049abd1dea8c4844d23de87ecec5f241a7&amp;dn=I+Know+Why+The+Aliens+Don%5C%27t++Land&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fplasma","files":1,"time":1218480944,"description":"Author: Jeremy Vaeni\nTitle:  I Know Why the Aliens Don't Land\nPublication Date:  2003\nPublisher: Kynegion House\n\nREVIEWS:\n\nJim Marrs, author of Alien Agenda, Rule By Secrecy, Crossfire, and Inside Job\n&quot;[A] wild ride with many curves and loops... forthright soul searching... fascinating&quot;\n\nReview by Nick Redfern, author of Memoirs of a Monster Hunter, A Covert Agenda and The FBI Files\n\n&quot;Jeremy's is very much a personal story; one that begins in his childhood, and one that reveals a wealth of data on the man, his character and how the UFO issue came to play a part (and a big part, too) in his life.\n\nIn many ways, his book reminded me of classic Hunter S. Thompson: Gonzo, containing a plethora of entertaining characters and situations; but most important of all, having something significant and relevant to impart, and to make the reader think, ponder, consider and absorb his words on all-things alien and more.\n\nI need to stress that the book is not written in a conventional style: it's a mix of interviews, thoughts, ideas, news stories and more, all interspersed with Jeremy's humorous take on all-things-ufological and on life itself. But this doesn't take away from the book's relevance or importance; and in many ways, taking the approach that Jeremy has actually provides a refreshing diversion from the stereotypical UFO/alien abduction book.\n\nLike many abductees, Jeremy's experiences with the intelligences behind the UFO phenomenon have clearly formed and manipulated much of his life, and we get to read some intriguing and insightful data suggesting - as is also the case with a lot of abductees - that Jeremy is not the only member of his family to have encountered those pesky little gray guys with the big, black eyes.\n\nTraumatic night-time encounters with the unknown, vehicle interference cases, ominous and black &quot;Flying Triangles&quot; - they're all a part of the life and experiences of Jeremy. But rather than become the victim of the Gray guys' actions - as unfortunately does happen to some abductees - Jeremy rises above it all, and strives to make sense of the high-strangeness and craziness in his life, and in a fashion that many will be able to relate to.\n\nAnd, it's when faced with the unknown, that retaining a healthy sense of humor becomes vital - which Jeremy does capably.\n\nAs I said earlier, Jeremy's is not a conventional book. But as it's written by someone who has personally encountered the unknown, lived to tell the tale, and provided his own unique (and courageously open) take on things, in many ways I Know Why The Aliens Don't Land! makes for much more interesting and compelling reading than all those abduction books that - in monotone style - simply reel off case after case, yet utterly fail to capture the nature of the experience at an emotional, personal and human level that Jeremy skilfully describes.&quot;\n\nOther reviews can be found at amazon.com: &lt;a href=&quot;\nhttp://www.amazon.com/Know-Why-Aliens-Dont-Land/dp/0974685402&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Know-Why-Aliens-Dont-Land/dp/0974685402&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5debb6049abd1dea8c4844d23de87ecec5f241a7","amp;dn":"I+Know+Why+The+Aliens+Don%5C%27t++Land","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5debb6049abd1dea8c4844d23de87ecec5f241a7","infoHashBuffer":{"type":"Buffer","data":[93,235,182,4,154,189,29,234,140,72,68,210,61,232,126,206,197,242,65,167]},"announce":[],"urlList":[]}}