{"title":"911 Ripple Effect - DVD including cover art","uid":3746583,"size":4451140253,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5eb9937c72e2691ff77bcd92186c952373dd8b97&amp;dn=911+Ripple+Effect+-+DVD+including+cover+art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kongdvd","files":13,"time":1184840263,"description":"911 Ripple Effect is a brand new 9/11 documentary, released June 29, 2007. \n\n87 minutes. NTSC DVD. This torrent includes images of DVD cover and label.\n\nProduced &amp; Written by William Lewis &amp; Dave vonKleist\nHosted by Dave vonKleist, Edited by William Lewis\n\nFeatures Expert Analysis &amp; Explosive Interviews with:\nFred Fox, Glen Stanish, Russ Wittenberg, Gen. Albert Stubblebine, Col. George Nelson, Maj. Glen MacDonald, Maj. Doug Rokke, Kevin Barrett, Jim Fetzer, Phil Jayhan, Jim Marrs, William Rodriguez, and people like you...\n\nFeaturing the music of: \nPoker Face, Martin Noakes, William Lewis\n\n\n&quot;Ripple Effect champions a very powerful message. Backed by expert examination of video evidence, combined with eyewitness accounts and packaged in an imaginative and captivating production that will keep you on the edge of your seats, Ripple Effect is a must see.&quot;\n\n&quot;With the use of on-the-street interviews, each segment is introduced as citizens of &quot;Any town USA&quot; tell what they heard and saw as that catastrophic day in our history unfolded.  Allegedly, nineteen terrorists with box cutters, funded and trained by the infamous Osama bin Laden, hijacked four commercial airplanes, disappeared from radar, then, crashed the planes into World Trade Center Towers 1 and 2, the Pentagon, and in Shanksville, PA, the towers raged with fire, witnesses ran from the buildings, the towers collapsed, &quot;pancake&quot; style, while a huge hole was left in the Pentagon and in the landscape at Shanksville; these are some of the &quot;scenes&quot; of the day.  But what did we REALLY see?&quot;\n\n&quot;911 Ripple Effect presents evidence and information about images shown to the world that were described to us by the media, but the twist is, these very images do not support the &quot;official&quot; story the media and government continue to tell.  Even these stories have changed to fit the terrorist-riddled version of tragedy in the United States.  VonKleist and Lewis provide some fairly damning reports, especially by Pentagon Correspondent Jamie McIntyre of CNN, Marc Birnbach of FOX News, and a reporter for the BBC, that are in direct conflict with the &quot;official&quot; versions.  McIntyre, nearly five years later, is heard trying to explain away statements he made during live, first coverage broadcasts, Birnbach disappeared from FOX News for several years, and has now returned, and the BBC reported the collapse of World Trade Center Building 7 nearly twenty minutes earlier than the actual collapse.&quot;\n \nMore info: http://www.911rippleeffect.com\n\nAlso check out my other uploads:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/kongdvd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/kongdvd&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5eb9937c72e2691ff77bcd92186c952373dd8b97","amp;dn":"911+Ripple+Effect+-+DVD+including+cover+art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb9937c72e2691ff77bcd92186c952373dd8b97","infoHashBuffer":{"type":"Buffer","data":[94,185,147,124,114,226,105,31,247,123,205,146,24,108,149,35,115,221,139,151]},"announce":[],"urlList":[]}}