{"title":"ZoneAlarm Pro 10.0.241.000-ZWT","uid":6487828,"size":55519076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63b5dca8ed5dd03214b2e3b09edaa1bee31ea79f&amp;dn=ZoneAlarm+Pro+10.0.241.000-ZWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anacondaz","files":-1,"time":1308770165,"description":"ZoneAlarm Pro 10.0.241.000\n\n\nZoneAlarm Pro - a well-known firewall designed to protect your computer from threats of all kinds at work on the Internet and local networks. The program provides excellent protection on the basis of the firewall, including the possibility of completely disconnect all network and Internet activity. Firewall has flexible configuration rules, which can be configured individually or use the preset rules. Filter Application (Access List), allows you to set access rights to the network for each program. There is a possibility of instantaneous automatic or manual blocking of access applications on the Internet. The program monitors incoming and outgoing mail, and can rename potentially dangerous attachments and put them in quarantine. Number of outgoing mail can be restricted to prevent mass mailings when infecting a computer, e-mail worms.\n\nZoneAlarm Pro also supports validation of digital signatures is a detailed log of events and has the means to analyze, with the subsequent issuance of textual and graphical information. Program features customizable control cookies, blocking the transfer of personal information about users on the Web-sites. Function block banner ads and pop-ups can get rid of annoying advertising, that are sensitive accelerates page loading speed.\n\nFirewall triple protection:\n- Goes beyond traditional PC firewalls to protect the entire PC from hackers, spyware and other Internet threats\n- Blocks hackers, not giving them access to your computer\n- Automatically makes your computer invisible on the Internet\n- Spyware, preventing them from sending personal information over the Internet Users\n- Protects the program and the operating system from malicious software\n\nPowerful AntiSpyware:\n- Scans and removes thousands of spyware traces from your computer\n- Automatically removes the most dangerous viruses and useless to the user spyware\n- &quot;Clean&quot; legal software monitoring (for example, Cookies for Web sites, which are often used)\n\nService protection (SmartDefense Service):\n- Provides a PC user to a security update in real time and new ways to protect against attacks\n- SmartDefense Adviser automatically delivers new models of spyware and viruses on the PC user for a modern defense\n- DefenseNet supports the safety of PC, constantly renewing the base spyware and malware using the ZoneAlarm user community\n\nEnhanced protection of personal data and privacy:\n- Protects against theft of personal data and online backup\n- Prevents the spread of personal user data from his computer without his consent\n- Automatically stops pop-ads\n\nHome Page: http://www.zonealarm.com/\n\n","torrent":{"xt":"urn:btih:63b5dca8ed5dd03214b2e3b09edaa1bee31ea79f","amp;dn":"ZoneAlarm+Pro+10.0.241.000-ZWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63b5dca8ed5dd03214b2e3b09edaa1bee31ea79f","infoHashBuffer":{"type":"Buffer","data":[99,181,220,168,237,93,208,50,20,178,227,176,158,218,161,190,227,30,167,159]},"announce":[],"urlList":[]}}