{"title":"APOCALYPSE_NOW_REDUX","uid":4954391,"size":8314894336,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:64811d4d57e97132bd0fee43fe61138a5c84331f&amp;dn=APOCALYPSE_NOW_REDUX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thepiratao","files":1,"time":1245037329,"description":"In the tradition of such obsessively driven directors as Erich von Stroheim and Werner Herzog, Francis Ford Coppola approached the production of Apocalypse Now as if it were his own epic mission into the heart of darkness. On location in the storm-ravaged Philippines, he quite literally went mad as the project threatened to devour him in a vortex of creative despair, but from this insanity came one of the greatest films ever made. It began as a John Milius screenplay, transposing Joseph Conrad's classic story &quot;Heart of Darkness&quot; into the horrors of the Vietnam War, following a battle-weary Captain Willard (Martin Sheen) on a secret upriver mission to find and execute the renegade Colonel Kurtz (Marlon Brando), who has reverted to a state of murderous and mystical insanity. The journey is fraught with danger involving wartime action on epic and intimate scales. One measure of the film's awesome visceral impact is the number of sequences, images, and lines of dialogue that have literally burned themselves into our cinematic consciousness, from the Wagnerian strike of helicopter gunships on a Vietnamese village to the brutal murder of stowaways on a peasant sampan and the unflinching fearlessness of the surfing warrior Lieutenant Colonel Kilgore (Robert Duvall), who speaks lovingly of &quot;the smell of napalm in the morning.&quot; Like Herzog's Aguirre: The Wrath of God, this film is the product of genius cast into a pit of hell and emerging, phoenix-like, in triumph. Coppola's obsession (effectively detailed in the riveting documentary Hearts of Darkness, directed by Coppola's wife, Eleanor) informs every scene and every frame, and the result is a film for the ages. --Jeff Shannon","torrent":{"xt":"urn:btih:64811d4d57e97132bd0fee43fe61138a5c84331f","amp;dn":"APOCALYPSE_NOW_REDUX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64811d4d57e97132bd0fee43fe61138a5c84331f","infoHashBuffer":{"type":"Buffer","data":[100,129,29,77,87,233,113,50,189,15,238,67,254,97,19,138,92,132,51,31]},"announce":[],"urlList":[]}}