{"title":"Anacrusis-Complete Discography (mp3 128-192 kb/s) [tntvillage]","uid":5239065,"size":2789304172,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:652955a0371bf44dc65ca7c2000052f601b5e180&amp;dn=Anacrusis-Complete+Discography+%28mp3+128-192+kb%2Fs%29+%5Btntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zachAlford","files":448,"time":1261667037,"description":"Anacrusis-Complete Discography (mp3 128-192 kb/s) [tntvillage]\n\nGenre: Thrash Metal.\nLossy mp3 CBR 192 kb/s--&gt;All Studio Albums, Bits And Pieces and Basement Tapes. Almost all demos (see below).\nLossy mp3 CBR 128 kb/s--&gt;All Lives and Manic Impressions demo (3-Song demo is 192kb/s).\nComplete artwork is included for all Studio Albums.\n\nAnacrusis was a progressive / thrash metal band from St. Louis, MO. Anacrusis was one of the first bands that attempted to blend thrash and progressive metal.\nAnacrusis' first demo, Annihilation Complete was voted Best Demo of 1987 by the readers of Metal Forces magazine and was later included in the publication's Demolition... Scream Your Brains Out! compilation album. This led to a deal with England-based indie Active Records, for whom the group created their first album, Suffering Hour, the following year on a meagre 1,200-dollar budget in just under a week. The following Reason album began revealing signs of the band's popular sound. Anacrusis toured in support of the band D.R.I., but without an album released on an American label, the drummer Mike Owen quit to join the Navy shortly after they returned home. Former Heaven's Flame member Chad Smith took over the drums, while the band eventually got signed to the American label Metal Blade Records.\n\nIn 1991, Manic Impressions was their first album proper studio recording, recorded at Royal Recorders in Lake Geneva, WI. A 38-city U.S. tour supporting Overkill and Galactic Cowboys followed a handful of Midwestern dates opening for Megadeth earlier in the year. After the tour, on returning to St. Louis, they devoted the next few months to writing new material, and after replacing Smith with drummer Paul Miles, work finally began on their 1993 album Screams and Whispers. This would remain their final album, as the band broke up after its release.\n\nIn 2009, the band announced that the original line-up of Kenn Nardi, Kevin Heidbreder, John Emery and Mike Owen would reunite for a performance at the 2010 KEEP IT TRUE XIII Festival in Germany. Also in 2009 the band released a CD/DVD anthology of early material on Stormspell Records. The package included their 1987 &quot;Annihilation Complete&quot; demo along with other demos, rehearsal recordings and early live footage.\n\n[from wikipedia]\n\n\nStudio Albums\n- Suffering Hour [1988]\n- Reason [1990]\n- Manic Impressions [1991]\n- Screams And Whispers [1993]\n- Manic Impression (Remixed) [2006]\n\nDemos\n- 2-Song Demo [1986]\n- Annihilation Complete demo [1986]\n- Annihilation Complete demo (2nd Version) [1987]\n- Quick To Doubt demo [1989]\n- Manic Impressions demo (+ 3-Song demo) [1990]\n- Screams And Whispers demo [1992]\n\nLives\n- St. Louis, MO, USA [1991]\n- Holland [1993]\n- St. Louis, MO, USA [1993]\n\nBits And Pieces\nThese are miscellaneous recordings and pieces of demos I've collected over the years. Most are very early versions of songs or pieces of music that would later become songs. There are also unreleased songs and alternate versions of &quot;official&quot; material along with radio interviews and rare rehearsal tapes.\n\nThe sound-quality varies from file to file, but each played an important part in the development of the band over the years.\n[the comments are taken from Anacrusis' official site]\n\nBasement Tapes\nThis is a collection of various rehearsal or band practice recordings of ANACRUSIS from 1986-1993. SOme are board tapes, some are single mic room recordings and some come from raw jambox recordings. All were made in Kevin's basement in Bridgeton, MO where the band regularly rehearsed over the years.\n[the comments are taken from Anacrusis' official site]","torrent":{"xt":"urn:btih:652955a0371bf44dc65ca7c2000052f601b5e180","amp;dn":"Anacrusis-Complete+Discography+%28mp3+128-192+kb%2Fs%29+%5Btntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"652955a0371bf44dc65ca7c2000052f601b5e180","infoHashBuffer":{"type":"Buffer","data":[101,41,85,160,55,27,244,77,198,92,167,194,0,0,82,246,1,181,225,128]},"announce":[],"urlList":[]}}