{"title":"The Obama Deception HQ Full length version","uid":4814102,"size":432082869,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:681b6402a083124324a409100018033fc12d95e5&amp;dn=The+Obama+Deception+HQ+Full+length+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"popseye","files":4,"time":1238484886,"description":"Get the DVD @ &lt;a href=&quot;\nhttp://infowars-shop.stores.yahoo.net...&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infowars-shop.stores.yahoo.net...&lt;/a&gt; &lt;a href=&quot;\nhttp://www.obamaimpeachment.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.obamaimpeachment.org/&lt;/a&gt;\nThe Obama Deception is a hard-hitting film that completely destroys the myth that Barack Obama is working for the best interests of the American people.\n\nThe Obama phenomenon is a hoax carefully crafted by the captains of the New World Order. He is being pushed as savior in an attempt to con the American people into accepting global slavery.\n\nWe have reached a critical juncture in the New World Order's plans. It's not about Left or Right: it's about a One World Government. The international banks plan to loot the people of the United States and turn them into slaves on a Global Plantation.\n\nCovered in this film: who Obama works for, what lies he has told, and his real agenda. If you want to know the facts and cut through all the hype, this is the film for you.\n\nWatch the Obama Deception and learn how:\n\n- Obama is continuing the process of transforming America into something that resembles Nazi Germany, with forced National Service, domestic civilian spies, warrantless wiretaps, the destruction of the Second Amendment, FEMA camps and Martial Law.\n\n- Obama's handlers are openly announcing the creation of a new Bank of the World that will dominate every nation on earth through carbon taxes and military force.\n\n- International bankers purposefully engineered the worldwide financial meltdown to bankrupt the nations of the planet and bring in World Government.\n\n- Obama plans to loot the middle class, destroy pensions and federalize the states so that the population is completely dependent on the Central Government.\n\n- The Elite are using Obama to pacify the public so they can usher in the North American Union by stealth, launch a new Cold War and continue the occupation of Iraq and Afghanistan.\n &lt;a href=&quot;\nhttp://www.prisonplanet.tv&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.prisonplanet.tv&lt;/a&gt;","torrent":{"xt":"urn:btih:681b6402a083124324a409100018033fc12d95e5","amp;dn":"The+Obama+Deception+HQ+Full+length+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"681b6402a083124324a409100018033fc12d95e5","infoHashBuffer":{"type":"Buffer","data":[104,27,100,2,160,131,18,67,36,164,9,16,0,24,3,63,193,45,149,229]},"announce":[],"urlList":[]}}