{"title":"100 Fresh and Fun Handmade Cards (gnv64)","uid":9362964,"size":50509429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68683748832a66e5d0c47038147dbf527d6fd4f0&amp;dn=100+Fresh+and+Fun+Handmade+Cards+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gnv65","files":-1,"time":1387359409,"description":"100 Fresh and Fun Handmade Cards: Step-by-Step Instructions for 50 New Designs and 50 Amazing Alternatives \nby Kimber McGray\nNorth Light Books | March 2012 | ISBN-10: 1440314993 | ePUB | 71 pages | 48.1 mb\n\nSwivels, Pop-Ups, Spinners, Shakers, Sliders and More: Handmade Cards Have Never Been So Much Fun!\nWhy settle for just any old greeting card when you can make your loved ones feel even more special with a handmade card? 100 Fresh and Fun Handmade Cards offers fabulous card inspiration and how-tos that are just right. Author Kimber McGray and select contributors share a huge variety of styles and designs with 100 cards: 50 quick and adorable cards for every occasion and 50 interactive or dimensional cards based on the quick card designs.\n\nInside you'll find:\n-    Essential techniques for cardmaking, including easy-to-follow directions for creating card bases, penny sliders and pop-ups.\n-    Cards for every occasion, from birthdays and holidays to special occasions and general greetings.\n-    Interactive or dimensional cards with parts that pop-up, shake and spin, and an awesome selection of gift card holders.\n\nLet 100 Fresh and Fun Handmade Cards lead the way to greetings that dazzle\n\nAbout the Author\nKimber McGray is the author of the bestselling books 175 Fresh Card Ideas and Scrapbook Secrets and the co-author of Remember This. She is on the design team for Scrapbook &amp; Cards Today, where her work is regularly featured, and writes the Tips &amp; Techniques article in each issue of Card Maker Magazine. Kimber is also an active instructor, teaching across the US and internationally. She currently works on the design teams for several manufacturers including Core'dinations, Jillibean Soup and Unity Stamp Company, and regularly attends CHA with them.","torrent":{"xt":"urn:btih:68683748832a66e5d0c47038147dbf527d6fd4f0","amp;dn":"100+Fresh+and+Fun+Handmade+Cards+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68683748832a66e5d0c47038147dbf527d6fd4f0","infoHashBuffer":{"type":"Buffer","data":[104,104,55,72,131,42,102,229,208,196,112,56,20,125,191,82,125,111,212,240]},"announce":[],"urlList":[]}}