{"title":"Britney Spears - If U Seek Amy","uid":4834581,"size":137764868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6dc6ca29dac96f56450b4f78dc2734453b34c65d&amp;dn=Britney+Spears+-+If+U+Seek+Amy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1239270098,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;If U Seek Amy&quot; is a song by American pop singer Britney Spears and the third single released from her sixth studio album Circus. The song was announced as a single by Spears's official website on January 7, 2009. The track was co-written and produced by Max Martin, who also wrote previous hits for Spears, including &quot;...Baby One More Time&quot; and &quot;Oops!... I Did It Again&quot;.\n\nThe music video was originally planned to begin shooting on February 10, 2009, but instead began filming on February 7, 2009. It was directed by Jake Nava, who previously worked with Spears for her 2004 music video &quot;My Prerogative&quot;. The &quot;If U Seek Amy&quot; video also contains references to other Spears videos. The music video premiered on March 12, 2009 on both Virgin Mobile (USA)'s official website and Spears's official websites.\n\nThe video starts off with a news anchor saying the title of the song above a newsbanner that reads &quot;Britney Spears song lyrics spell out obscenity in disguise,&quot; a parody of a FOX News report by Megyn Kelly. It then skips to a house, in which a party is coming to an end. Spears gets up from the bed to sing the first verse. After looking out the window, she dances with other party goers as the chorus starts. She is looking around for Amy while she is singing and begins to dance with four other female dancers dressed in cheerleading outfits.\n\nAll the guys are watching them dance until the screen fades to white and Britney begins to change into a conservative '50s-style outfit including a Lacoste polo shirt, white skirt, and white heels. As the chorus begins again, she comes out of her bedroom. She walks down the stairs where a woman gives her a potholder, which she uses to pick up a pie. She then takes the pie outside to be joined by her children and her husband. As they go down the walkway, they are surrounded by paparazzi who have no idea what goes on behind closed doors. While the kids and husband wave, Spears smiles for the camera and blows a kiss. The video then ends with the anchor, who says &quot;It doesn't make any sense, does it?&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6dc6ca29dac96f56450b4f78dc2734453b34c65d","amp;dn":"Britney+Spears+-+If+U+Seek+Amy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dc6ca29dac96f56450b4f78dc2734453b34c65d","infoHashBuffer":{"type":"Buffer","data":[109,198,202,41,218,201,111,86,69,11,79,120,220,39,52,69,59,52,198,93]},"announce":[],"urlList":[]}}