{"title":"TsSeduction------4 movies 1","uid":5950745,"size":2661461269,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6ff2ebe28d87d65db624a74ea8a2a0302ebf9e7a&amp;dn=TsSeduction------4+movies+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":1060,"time":1289517928,"description":"From Kink.com    (Ts Seduction)   + Pics\n\n\n\nFoxy is a new girl with a huge cock and hungry to devour boy pussy. She's tall, dominant, and hot as hell. In this set she ravages her submissive, teasing him with her cock, letting him suck her deep, long and slow. All the ways she likes it. Once her cock is wet and hard she plants it deep in his ass pulling out only to cum on his willing stomach.\n\n\n\nScreens &lt;a href=&quot; http://www.tsseduction.com/site/shoot.jsp?shootId=6176&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tsseduction.com/site/shoot.jsp?shootId=6176&lt;/a&gt;\n\n\n\nThe beautiful Jesse is back and hungry for prey. On the menu today is a submissive male, who will do anything to please her. Jesse locks her slave in a cage and teases his cock through the bars with a torturous blow job. Kade eagerly pleases Jesse by sucking her rock hard cock and worshiping her body. But this is mere foreplay for Jesse who wants nothing more than to fuck her slave in the ass. After an intense fucking complete with a zipper of clothes pins that are ripped off Kade's body, Jesse cums on his sensitive chest.\n\n\n\nScreens &lt;a href=&quot; http://www.tsseduction.com/site/shoot.jsp?shootId=6345&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tsseduction.com/site/shoot.jsp?shootId=6345&lt;/a&gt;\n\n\n\nJesse loves to play rough. She loves licking, biting, sucking and fucking. Jason willing gives into all Jesse desires - sucking her cock and opening his ass for her is the least he can do. Jesse has him bound and helplessly worship her body until she is ready to spread him open and fuck his ass. Jason cums on Jesse's beautiful tits and then she returns the pleasure by cumming on his back and ass checks. \n\n\n\nScreens &lt;a href=&quot; http://www.tsseduction.com/site/shoot.jsp?shootId=6346&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tsseduction.com/site/shoot.jsp?shootId=6346&lt;/a&gt;\n\n\n\nJesse and Diezel met on the road during the Ts Road trip. Jesse wanted Diezel all to herself so the two scheduled a date in a Vegas Hotel room. \nDiezel careful sets out all the toys - the crop, the flogger, the rope...he does every Jesse asks him including wearing a butt plug while he waits for her to arrive. Once in the hotel room, Jesse grabs hold of Diezel and barely lets him up for air. She fucks his ass hard for most of the night and even after Diezel cums, Jesse still wants more. She has him ride her cock in cowgirl. Diezel takes all the ass fucking and sucking Jesse desires until she can barely contain herself and she dumps cum on his face and mouth.\n\n\n\nScreens   &lt;a href=&quot; http://www.tsseduction.com/site/shoot.jsp?shootId=6747&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tsseduction.com/site/shoot.jsp?shootId=6747&lt;/a&gt;\n\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:6ff2ebe28d87d65db624a74ea8a2a0302ebf9e7a","amp;dn":"TsSeduction------4+movies+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ff2ebe28d87d65db624a74ea8a2a0302ebf9e7a","infoHashBuffer":{"type":"Buffer","data":[111,242,235,226,141,135,214,93,182,36,167,78,168,162,160,48,46,191,158,122]},"announce":[],"urlList":[]}}