{"title":"Hard Drive Inspector Professional 4.21 Build 189 + For Notebooks","uid":9332758,"size":6306828,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:719e78e7e2195130da4059308ee3854bcc7ec1e4&amp;dn=Hard+Drive+Inspector+Professional+4.21+Build+189+%2B+For+Notebooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":-1,"time":1386796645,"description":"Hard Drive Inspector Professional 4.21 Build 189 + For Notebooks\n\nHard Drive Inspector is a powerful, effective and easy-to-use program that monitors hard drive health. The value of information stored on an average computer hard drive often exceeds the value of the computer itself. But a hard drive is one of the most unreliable internal computer devices. When it crashes (which happens quite frequently), the stored information will be lost fully or partially. Subsequent information recovery is either not possible at all, or constitutes a very sophisticated and expensive procedure that can be performed only by specialists. Modern hard drives support S.M.A.R.T. (Self-Monitoring, Analysis, and Reporting Technology) that was specially developed to detect upcoming disk failures. Using this technology Hard Drive Inspector can monitor the current state of various life-critical parameters describing a disk's reliability and performance. Hard Drive Inspector analyzes this data and warns the user if the parameters indicate a critical reduction of disk reliability. Timely alerts make it possible to copy the data and replace an unreliable disk, thus preventing information loss.\n\nChanges in Hard Drive Inspector 4.21 (11/12/2013):\n + added the support of the Samsung M3 Portable USB 3.0 external drives\n\nOS: Windows 2000, XP, 2003, Vista, 2008, Windows 7, Windows 8.\nInterface: English, Russian, Norwegian, Italian, German, Hebrew, French, Spanish, Dutch-Belgium, Slovak, Arabic, Vietnamese, Ukrainian, Portuguese-Brazil, Chinese-Taiwan, Czech, Greek, Hungarian, Bulgarian, Belorussian, Portuguese, Indonesian, Polish, Romanian\n\nHome Page www.altrixsoft.com\n","torrent":{"xt":"urn:btih:719e78e7e2195130da4059308ee3854bcc7ec1e4","amp;dn":"Hard+Drive+Inspector+Professional+4.21+Build+189+%2B+For+Notebooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"719e78e7e2195130da4059308ee3854bcc7ec1e4","infoHashBuffer":{"type":"Buffer","data":[113,158,120,231,226,25,81,48,218,64,89,48,142,227,133,75,204,126,193,228]},"announce":[],"urlList":[]}}