{"title":"Yaaba 1989 DVD5 (dir. Idrissa Ouedraogo) Burkina Faso","uid":4626457,"size":4681125860,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:72ea509b44770d5b5fbb0b22ccb7c28cfe9ece59&amp;dn=Yaaba+1989+DVD5+%28dir.+Idrissa+Ouedraogo%29+Burkina+Faso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yamdaabo","files":-1,"time":1231233232,"description":"The title of the Burkina Faso-produced Yaaba translates to &quot;Grandmother.&quot; That character, played by Fatimata Sanga, has been accused of witchcraft by her village. In fact, Sanga is a kindly, serene old woman, perhaps the wisest person in the community. Only Bila, a troubled and troublesome young boy, is respectful of her. Though he isn't related to her in any way, he regards her as his grandmother, and addresses her as such. When Bila's cousin, Nopoko, falls ill, a medicine man insists that Yaaba has stolen the girl's soul. Though it is she who undergoes a grueling journey to find a medicine that will cure the girl, the villagers are still convinced that she is a sorceress of some sort. Only after Yaaba's death do we discover why her neighbors fear and despise her so-and, on a happier note, we are assured that the love and wisdom that &quot;Yaaba&quot; has invested in Bila and Nopoko will live on as long as they do.\n\nYaaba was the 1989 winner of the International Critics Prize at the Cannes Film Festival.\n\n\n\n\nfilm in more language, subtitles german, french, english, italian.\n\n90min., PAL, color, all zones\n\nDVD Extras: short film &quot;Parlons grand-mere&quot; (Making of Yaaba) 30min.","torrent":{"xt":"urn:btih:72ea509b44770d5b5fbb0b22ccb7c28cfe9ece59","amp;dn":"Yaaba+1989+DVD5+%28dir.+Idrissa+Ouedraogo%29+Burkina+Faso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ea509b44770d5b5fbb0b22ccb7c28cfe9ece59","infoHashBuffer":{"type":"Buffer","data":[114,234,80,155,68,119,13,91,95,187,11,34,204,183,194,140,254,158,206,89]},"announce":[],"urlList":[]}}