{"title":"Fallout New Vegas (Japanese Version) (PS3) (Jailbreak) (Mods)","uid":6095126,"size":9109525702,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7385fc111a9b09cf95729546b63fe9ef87f48761&amp;dn=Fallout+New+Vegas+%28Japanese+Version%29+%28PS3%29+%28Jailbreak%29+%28Mods%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FNVMods","files":-1,"time":1294736081,"description":"Japanese PS3 version of Fallout New Vegas, files for play on Jailbroken PS3's. Some mods included, and more can be added. Have fun!\n\n\n---\n\n\n\nWelcome to Vegas. New Vegas. It's the kind of town where you dig your own grave prior to being shot in the head and left for dead...and that's before things really get ugly. It's a town of dreamers and desperados being torn apart by warring factions vying for complete control of this desert oasis. It's a place where the right kind of person with the right kind of weaponry can really make a name for themselves, and make more than an enemy or two along the way. As you battle your way across the heat-blasted Mojave Wasteland, the colossal Hoover Dam, and the neon drenched Vegas Strip, you'll be introduced to a colorful cast of characters, power-hungry factions, special weapons, mutated creatures and much more. Choose sides in the upcoming war or declare &quot;winner takes all&quot; and crown yourself the King of New Vegas in this follow-up to the 2008 videogame of the year, Fallout 3. Enjoy your stay.\n\n\n* Feel the Heat in New Vegas! Not even nuclear fallout could slow the hustle of Sin City. Explore the vast expanses of the desert wastelands - from the small towns dotting the Mojave Wasteland to the bright lights of the New Vegas strip. See the Great Southwest as could only be imagined in Fallout.\n    \n* Feuding Factions, Colorful Characters and a Host of Hostiles! A war is brewing between rival factions with consequences that will change the lives of all the inhabitants of New Vegas. The choices you make will bring you into contact with countless characters, creatures, allies, and foes, and determine the final explosive outcome of this epic power struggle.\n    \n* New Systems! Enjoy new additions to Fallout: New Vegas such as a Companion Wheel that streamlines directing your companions, a Reputation System that tracks the consequences of your actions, and the aptly titled Hardcore Mode to separate the meek from the mighty. Special melee combat moves have been added to bring new meaning to the phrase &quot;up close and personal&quot;. Use V.A.T.S. to pause time in combat, target specific enemy body parts and queue up attacks, or get right to the action using the finely-tuned real-time combat mechanics.\n    \n* An Arsenal of Shiny New Guns! With double the amount of weapons found in Fallout 3, you'll have more than enough new and exciting ways to deal with the threats of the wasteland and the locals. In addition, Vault-Tec engineers have devised a new weapons configuration system that lets you tinker with your toys and see the modifications you make in real time.\n    \n* Let it Ride! In a huge, open world with unlimited options you can see the sights, choose sides, or go it alone. Peacemaker or Hard Case, House Rules, or the Wild Card - it's all in how you play the game\n","torrent":{"xt":"urn:btih:7385fc111a9b09cf95729546b63fe9ef87f48761","amp;dn":"Fallout+New+Vegas+%28Japanese+Version%29+%28PS3%29+%28Jailbreak%29+%28Mods%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7385fc111a9b09cf95729546b63fe9ef87f48761","infoHashBuffer":{"type":"Buffer","data":[115,133,252,17,26,155,9,207,149,114,149,70,182,63,233,239,135,244,135,97]},"announce":[],"urlList":[]}}