{"title":"Deanna Durbin Sweetheart Pack - Lady on a Train (1945) Xvid 1cd ","uid":10054679,"size":733982720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73dace9fc4729289d0d787630d9abaa7c90c6ae3&amp;dn=Deanna+Durbin+Sweetheart+Pack+-+Lady+on+a+Train+%281945%29+Xvid+1cd+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1398647058,"description":"Deanna Durbin Sweetheart Pack - Lady on a Train (1945) Xvid 1cd - Ralph Bellamy [DDR]\n\nLady on a Train is a 1945 American comedic crime film directed by Charles David and starring Deanna Durbin, Ralph Bellamy, and David Bruce. Based on a story by Leslie Charteris, the film is about a woman who witnesses a murder in a nearby building from her train window. After she reports the murder to the police, who quickly dismiss her story, she turns to a popular mystery writer to help her solve the crime. The film received an Academy Award nomination for Best Sound.\n\n    CAST:-\n    Deanna Durbin as Nikki Collins/Margo Martin\n    Ralph Bellamy as Jonathan Waring\n    David Bruce as Wayne Morgan\n    George Coulouris as Mr. Saunders, Circus Club Manager\n    Allen Jenkins as Danny\n    Dan Duryea as Arnold Waring\n    Edward Everett Horton as Mr. Haskell\n    Jacqueline deWit as Miss Fletcher\n    Patricia Morison as Joyce Williams\n    Elizabeth Patterson as Aunt Charlotte Waring\n    Maria Palmer as Margo Martin\n    Samuel S. Hinds as Mr. Wiggam\n    William Frawley as Desk Sgt. Brennan\n\nMOVIE REVIEW:- Lady on a Train (1945)\nDebutante Nikki Collins, an enthusiastic reader of detective stories, witnesses a murder in a building while passing by on a train entering New York's Grand Central Station. She goes to the police, but is frustrated to find that no one believes her. The police think that her story is the product of an overactive imagination.\n\nUndaunted, Nikki approaches mystery writer Wayne Morgan (David Bruce) to help her solve the mystery. She identifies the murdered man as Josiah Waring, a ruthless millionaire businessman, after seeing him on a cinema screen. She is then mistaken by the 'grieving' family (who all hated him) as Margo Martin, a nightclub singer and his fiancee, who stands to inherit the bulk of his fortune. But the real Margo is murdered and Nikki must stay one step ahead of two disinherited cousins out to kill her.\n\nDeanna Durbin offered her fans a change of pace in this mystery story seasoned with elements of comedy and music. Nikki Collins (Durbin) is a small-town girl visiting New York City to meet with Mr. Haskell (Edward Everett Horton), her family's attorney. As her train pulls into the station, she looks out her window into a nearby office building. She's shocked by what she sees -- a man is being strangled to death, and while she can't see the face of the killer, she gets a good look at the victim. Terrified, Nikki immediately goes to the police, but they think that her story is simply the product of an overactive imagination and send her on her way. Nikki, however, is certain that she witnessed a murder, and she approaches mystery writer Wayne Morgan (David Bruce) to help her piece together the facts of what happened. Thanks to a newsreel, Nikki is able to recognize the victim as Mr. Waring, a wealthy man who made his fortune in shipping; she attempts to contact Waring's family, but they're convinced that Nikki is a nightclub singer with whom the tycoon was having an affair. Hoping to contact the chanteuse in question, Nikki visits the club where she works, only to discover that she's also been murdered. Nikki soon finds herself being trailed by both Jonathan (Ralph Bellamy) and Arnold (Dan Duryea), two members of Waring's family whom she believes may have been involved in the crime, and could be trying to silence her once and for all. Like most of Durbin's vehicles, Lady on a Train's plot stops every now and then to give her the opportunity to sing a song; Western fans may want to keep an eye peeled for future cowboy star Lash LaRue, who has a small role as a waiter.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 94 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 94 mins","torrent":{"xt":"urn:btih:73dace9fc4729289d0d787630d9abaa7c90c6ae3","amp;dn":"Deanna+Durbin+Sweetheart+Pack+-+Lady+on+a+Train+%281945%29+Xvid+1cd+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73dace9fc4729289d0d787630d9abaa7c90c6ae3","infoHashBuffer":{"type":"Buffer","data":[115,218,206,159,196,114,146,137,208,215,135,99,13,154,186,167,201,12,106,227]},"announce":[],"urlList":[]}}