{"title":"Dean Edell Medical Show 2009.01.21","uid":4684820,"size":9085677,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7c6b3b159245ce596a40370233263b762de7571e&amp;dn=Dean+Edell+Medical+Show+2009.01.21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"katnap","files":-1,"time":1233194989,"description":"This is a full episode of Dr. Dean Edell's syndicated radio program, which airs on 136 stations across the United States. This episode aired on January 16, 2009 on the radio station KGO (810 AM). The radio station offers free downloads of Mr. Edell's show in its archive section here: http://www.kgoam810.com/Article.asp?id=49920 under the 1:00 p.m. - 2:00 p.m. section.\n\n\nIn this episode, Dr. Dean comments on elements of Barak Obama's inauguration speech; a proposed bill to require Mississippi textbooks to print disclaimers stating that evolution is a controversial theory; hand-washing and a new kind of electric hand-dryer for public restrooms; an edict from England that music teachers must wear ear protection to prevent hearing damage; and Helen Fisher's theory that human attraction is based on compatibility between neurotransmitter-based personality types.\n\nHe shares the results of a Swedish study connecting childhood obesity and stressful family life; a study refuting the link between the consumption of breakfast cereal and the resulting gender of unborn babies; an a (non-conclusive) piece on depression after sexual intercourse.\n\nHe answers questions on eye twitching after surgery for Eagle syndrome, the time it takes for lung function to improve after smokers quit smoking, whether there a correlation between adenoid problems and Sensory Integration Syndrome, and what Dr. Edell himself would do if his opinion were asked by the new Surgeon General and other health-experts in President Obama's new cabinet.\n\nType : mpeg 1 layer III\nBitrate : 32\nMode : mono\nFrequency : 22050 Hz\nEncoder : Lame 3.97","torrent":{"xt":"urn:btih:7c6b3b159245ce596a40370233263b762de7571e","amp;dn":"Dean+Edell+Medical+Show+2009.01.21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6b3b159245ce596a40370233263b762de7571e","infoHashBuffer":{"type":"Buffer","data":[124,107,59,21,146,69,206,89,106,64,55,2,51,38,59,118,45,231,87,30]},"announce":[],"urlList":[]}}