{"title":"Spider.Man.Web.of.Shadows.MULTI5.PAL.X360-UNLiMiTED","uid":4464405,"size":7835492622,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:7cbbee13f9579103a9deb8ce70ee03a6b994dc64&amp;dn=Spider.Man.Web.of.Shadows.MULTI5.PAL.X360-UNLiMiTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":3,"time":1224806978,"description":"Olvida todo lo que hayas visto, leÃƒÂ­do u oÃƒÂ­do sobre Spiderman: Web of Shadows. NingÃƒÂºn trÃƒÂ¡iler ni ninguna imagen del juego hacen justicia a lo que se ha podido ver en la ediciÃƒÂ³n de este aÃƒÂ±o de la GC en el stand de Activision; la gente que lo ha visto se ha quedado sorprendida ante el atractivo de un tÃƒÂ­tulo que empezÃƒÂ³ haciendo poco ruido y que ahora estÃƒÂ¡ intentando llegar a lo mÃƒÂ¡s alto. Y todo sea dicho, estÃƒÂ¡ por el buen camino.\n\nWeb of Shadows nos narra cÃƒÂ³mo los simbiontes atacan el planeta Tierra, apoderÃƒÂ¡ndose no sÃƒÂ³lo de nuestro amigo y vecino Spiderman, sino tambiÃƒÂ©n de otros muchos amigos y enemigos, como pueden ser el famoso Lobezno (ademÃƒÂ¡s de otros que no podemos desvelar). La importancia de los simbiontes serÃƒÂ¡ evidente desde el principio del juego, cuando Peter Parker se haga con su famoso traje negro; el usuario deberÃƒÂ¡ elegir entre seguir la senda del disfraz tradicional de Spiderman o bien seguir el camino del simbionte.\nDe este modo, nos toparemos con dos lÃƒÂ­neas argumentales bastante diferenciadas, que darÃƒÂ¡n lugar a dos finales completamente diferentes; dado que la elecciÃƒÂ³n debe hacerse prÃƒÂ¡cticamente al principio del juego, podrÃƒÂ­a decirse que son dos aventuras en una, de duraciÃƒÂ³n bastante considerable. En cierta medida, el tÃƒÂ­tulo podrÃƒÂ­a recordar a Spiderman 3, y si bien es cierto que bebe en parte de dicha entrega, la evoluciÃƒÂ³n con respecto a la misma es mÃƒÂ¡s que notable; la consola que se estÃƒÂ¡ utilizando como base es Xbox 360, y se estÃƒÂ¡ explotando al mÃƒÂ¡ximo antes de portar el tÃƒÂ­tulo a PS3, PC y Wii.","torrent":{"xt":"urn:btih:7cbbee13f9579103a9deb8ce70ee03a6b994dc64","amp;dn":"Spider.Man.Web.of.Shadows.MULTI5.PAL.X360-UNLiMiTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cbbee13f9579103a9deb8ce70ee03a6b994dc64","infoHashBuffer":{"type":"Buffer","data":[124,187,238,19,249,87,145,3,169,222,184,206,112,238,3,166,185,148,220,100]},"announce":[],"urlList":[]}}