{"title":"Jimmy Nail - Crocodile Shoes II - OST (1994)[EAC-MP3@320KBPS]","uid":4631320,"size":124891961,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7db41b99df62fda1154c26b1b3df6a0a9c5c20a6&amp;dn=Jimmy+Nail+-+Crocodile+Shoes+II+-+OST+%281994%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanprince","files":20,"time":1231401982,"description":"Jimmy Nail - Crocodile Shoes II - OST (1994)[EAC-MP3@320KBPS]\n\n\n\nTrack list\n\nJimmy Nail - Crocodile Shoes II\n\n01. Country Boy 03:37\n02. Blue Roses 03:18\n03. Running Man 03:48\n04. Fear No Evil 03:39\n05. I'm A Troubled Man 03:13\n06. My Buddy 02:42\n07. Gentle's Lament 03:23\n08. Still I Dream Of It 03:41\n09. Just Can't Win 04:23\n10. Until The Day I Die 03:28\n11. I Refuse To Lie Down 05:02\n\nBiography by John Bush\n\nVocalist Jimmy Nail first came to prominence in England as an actor during the early '80s, in the highly successful BBC-TV series Auf Wiedersehen Pet. His next TV work, Spender, was a labor of love; he wrote and produced the series, starring as undercover detective Freddie Spender as well. He won several awards for the show, which also launched a best-selling novel. More awards were forthcoming for his series Crocodile Shoes, in which he played a third-rate country singer. Nail began recording in the mid-'80s, and first gained an American contract with the 1992 album Growing Up in Public. His 1995 LP Crocodile Shoes -- based on the TV series -- went triple-platinum in Great Britain (and spawned a best-selling follow-up one year later). In 1996, Jimmy Nail earned his most popular role, that of tango singer AgustÃƒÂ­n Magaldi in Madonna's feature-film version of Evita.\n\nReview From Amazon.com\n\nJimmy Nail is an immensely talented singer, songwriter, musician and actor. American audiences will probably recognize him as the opera singer from the beginning of the movie &quot;Evita&quot;. A few years ago he starred in(and I believe wrote and produced) the BBC series &quot;Spender&quot;, as well as the serial &quot;Crocodile Shoes&quot; and the aptly titled sequel &quot;Crocodile Shoes II&quot;. In it he played a British singer who dreamt of making it big in Nashville. It showed the shadier side of the music industry, but also some incredible music. So when I saw the CS II cd at a local music store, I had to buy it.\nThe album is incredible. Nail's voice is a cross between Pete Townshend, Sting and Vince Gill (for you country music fans). THere is a country feel to this album, especially with the opening &quot;Country Boy&quot;, but this is by no means a country album. There is blues, rock and even a little jazz stirred into the mixture. Nail's voice is so flawless, and evokes so much emotion, both in his singing and his delivery of the lyrics.\nThe song &quot;Troubled Man&quot; will have you crying at the end, all about a man who realizes how much damage he has caused his loved ones, and his asking his wife, child and finally God for forgiveness. &quot;My Buddy&quot;, a slow ballad with almost a nightclub feel about it is another great tearjerker.\nBut don't worry - this album rocks as well. &quot; I Refuse to Lie Down&quot;, about a guy wrongly jailed ( figuratively or literally - doesn't really matter) offers a blistering guitar solo and amazing lyrics such as &quot;One day I will find/a simple word that fits the lock, that turns the key to set me free&quot;. And there are upbeat ditties that will have you clapping your hands.\nThis is hard album to peg - its not country, its not rock, its not blues. Stylewise, its probably along the lines of Mark Knopfler, but the fact that you can't pigeonhole Jimmy Nail is what makes him so damn good.","torrent":{"xt":"urn:btih:7db41b99df62fda1154c26b1b3df6a0a9c5c20a6","amp;dn":"Jimmy+Nail+-+Crocodile+Shoes+II+-+OST+%281994%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db41b99df62fda1154c26b1b3df6a0a9c5c20a6","infoHashBuffer":{"type":"Buffer","data":[125,180,27,153,223,98,253,161,21,76,38,177,179,223,106,10,156,92,32,166]},"announce":[],"urlList":[]}}