{"title":"Two And A Half Men - Season 6","uid":5521433,"size":4397708900,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:807191aa2c91e23f2f83ce84212fc15fd97ab0f6&amp;dn=Two+And+A+Half+Men+-+Season+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BFMV_4LIFE","files":24,"time":1272587190,"description":"                                 Two and A Half Men \n\nThe Harper brothers Charlie and Alan are almost opposites but form a great team. They have little in common except their dislike for their mundane, maternally cold and domineering mother, Evelyn. Alan, a compulsively neat chiropractor and control-freak, is thrown out by his manipulative wife Judith who nevertheless gets him to pay for everything and do most jobs in the house. Charlie is a freelance jingle composer and irresistible Cassanova who lives in a luxurious beach-house and rarely gets up before noon. Charlie &quot;temporarily&quot; allows Alan and his son Jake, a food-obsessed, lazy school kid who shuttles between his parents, to move in with them after Alan's separation/divorce. The sitcom revolves around their conflicting lifestyles, raising Jake (who has the efficient, caring dad while having a ball with his fun-loving sugar uncle who teaches him boyish things), and bantering with Evelyn and various other friends and family. Other fairly regular characters include Charlie's cleaning lady Berta and his rich, self-confessed stalker neighbor Rose who often sneaks in to spy on Charlie.\n\n\n\n\nI am really looking forward to uploading The rest of The Seasons, maybe not in chronological order.","torrent":{"xt":"urn:btih:807191aa2c91e23f2f83ce84212fc15fd97ab0f6","amp;dn":"Two+And+A+Half+Men+-+Season+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"807191aa2c91e23f2f83ce84212fc15fd97ab0f6","infoHashBuffer":{"type":"Buffer","data":[128,113,145,170,44,145,226,63,47,131,206,132,33,47,193,95,217,122,176,246]},"announce":[],"urlList":[]}}