{"title":"RemedyofCancerUrduHindiArabic","uid":11524885,"size":28468520,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:80f7bc54c56d42c0ec799ade89c5df08859f2fcc&amp;dn=RemedyofCancerUrduHindiArabic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"yaserarshad","files":1,"time":1416521087,"description":"This files contains 3 audios\n1st is the bayaan of Mufti Junaid in which he tells about how useful these audios are and one can benefit from it at its fullest.\n\n2nd and 3rd are the selected verses of the holy Quran recited by several Ulemas from around the world.\n\nThe bayan is in Urdu / Hindi. In order to let other Muslim brothers and sisters benefit from these audios I will try to translate the main points that the Mufti saab has said in the 1st audio:\n\nHe said that many people think that magic is done using na pak / profane methods so its solution is also available through the na paak / profane methods. This is however not the truth. He then quoted that Allah has said in the Qur'an,  And say: &quot;Truth has come and falsehood nullified.&quot; Verily falsehood is perishable.\nWhat We have sent down of the QurÂ´an is a healing and a grace for the faithful, and adds only loss for the sinners\nHe then quoted the Hadith of Hazrat Muhammad (P.B.U.H) that he said :&quot;Best remedy is the Quran &quot; ( Mafhoom ) \nThe Maulana further said that the audio that is available within this file contains the Ayaas from the Holy Quran that mentions about the greatness of Allah, the hell, shayaateen/ iblees, and the here after. The shayateen/ iblees are intolerant of all this. \nThe audios available contain 33 Ayaats of a Manzil along with some more ayaats that have been recited by many scholars of Islam related to magic, bad eye, or envy. According to the Maulana if after listening to these audios if someone is actually a victim of black magic, envy or bad eye, he or she will feel a change in their body such as feeling dizzy, or feeling sleepy, feeling pain in the shoulders, in the back feeling oozy or want to vomit. You will feel pains in the areas where the magic has been done on and the pain will keep increasing. \nNow the remedy is that you should listen to these ayaas again and again with the niyaah of Shifa or healing. \nDuring the healing process you might be getting a lot of vomits, or loose motions or urine. The more you listen to the audios the more you will feel the pain, but you must stand your ground and still keep on listening the audios. \nAccording to the Maulana some people vomited 100 times in a day, or had loose motions 50 times a day.\nThe method of listening to this audio from fajar till night. Awake for Fajar, perform Salah and then start listening to the audios. The shyateen will make you fall asleep, but you must not sleep. Then at Zuhur eat lunch and then take a mid day nap. The shaytaan does'nt take the midday nap hence wont let you rest as well, but you should take the midday nap. \nHe then mentions a case where a boy was diagnosed with cancer. The boy communicated with the Maulana and told about his problem, Maulana sab told him about the audio and asked him to listen on daily bases.\nOn the first day the boy complained about feeling dizzy/ sleepy / heavy headed. Maulana said in reply Alhamdulillah, the problem has been caught. The Maulana asked him to listen to the audio on daily bases. After a few days the boys father called the Maolana and told him that his son is not doing well. He seems to be near death. The Molana in reply told that death is waiting for him on either sides and its better that he listens to the Quran more than doing anything else. The father of the boy then said that I have listened to the audio as well but I do not feel anything weird. The Molana said the reason is that you have not been attacked by magic, bad eye, or envy however your son has fallen victim to the evil.\nAfter a few days the boy reported to have vomited and in the vomit there was a stone in which the word &quot;Om&quot; was written. He further vomited many other items that were the cause of black magic. \nBut as the time passes by the boy feeling better and freshness within himself. He listened to audio for two more days where he had got loose motions and lot of urination. \nThen one day he listened to the audios and nothing happened to him, no vomit, no dizziness, loose motion or no pain When he reported his condition back to the Maulana,the Maulana said in reply Alhamdulillah, you have been cured/ healed by the grace of Allah All Mighty. The boy then went to hospital once again to get himself checked and the reports were negative. \n\nAccording to scholars of Arab,cancer, heart problems and many other such big diseases are not actually diseases but attacks from shyateen, bad eye or envy.\n\nI am really sorry to my brothers and sisters for not been able to provide the bayan other than urdu / hindi. However if I get a hand on any such audio in another language, i will upload it, Insha Allah. \n\nMay Allah have mercy on us all.\nPlease spread the word.\n\nJazakAllah","torrent":{"xt":"urn:btih:80f7bc54c56d42c0ec799ade89c5df08859f2fcc","amp;dn":"RemedyofCancerUrduHindiArabic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80f7bc54c56d42c0ec799ade89c5df08859f2fcc","infoHashBuffer":{"type":"Buffer","data":[128,247,188,84,197,109,66,192,236,121,154,222,137,197,223,8,133,159,47,204]},"announce":[],"urlList":[]}}