{"title":"Azzddine - Massafat","uid":4455190,"size":412895569,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82184a266676a73f7fd9f943b4a7124746e973aa&amp;dn=Azzddine+-+Massafat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"axel_5002","files":2,"time":1224444861,"description":"While Azzddine, aka Moroccan musician Azzddine Ouhnine, and bassist Bill Laswell are the musicians to whom this CD is billed, they are actually just two elements in a multilayered recording with numerous participants. In common with many releases on the Barbarity label, it's a cross-cultural exercise of sorts, with Ouhnine's oud, darbukka, and vocals blending with violins, keyboards, background vocals, bass, and plenty of programming and electronic beats. Also in common with many such productions, it's such a dense kitchen soup of sounds that the ostensibly featured performer is a little overwhelmed by the surroundings. There's much traditional Moroccan music at the base of the mix, but there are also plenty of rap, synthetic beats, eerie distorted vocals and effects, and some dub reggae swimming around as well. Despite his co-billing, Laswell's bass isn't by any means the most dominant contribution other than the ones by Azzddine; he plays on just over half the album (eight of the fourteen tracks). The album's a dizzying mix of styles and transitions from blend to blend, impressive in its eclecticism, but a little disorienting and excessive as well.","torrent":{"xt":"urn:btih:82184a266676a73f7fd9f943b4a7124746e973aa","amp;dn":"Azzddine+-+Massafat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82184a266676a73f7fd9f943b4a7124746e973aa","infoHashBuffer":{"type":"Buffer","data":[130,24,74,38,102,118,167,63,127,217,249,67,180,167,18,71,70,233,115,170]},"announce":[],"urlList":[]}}