{"title":"AIDA64Business - 4.30.2900 ML","uid":9832472,"size":16189448,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83c72e95a5ec4708ca52b7b26721dbe3c15193a0&amp;dn=AIDA64Business+-+4.30.2900+ML&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"prodallasosoft","files":1,"time":1395864260,"description":"AIDA64 - utility is a powerful tool for identification and testing of virtually all components of personal computers running operating systems Windows. Gives you detailed information about all the hardware and software, in addition, with built-in modules for testing and calibration can be further tested the individual subsystems PC. Displays detailed information about all the hardware and software installed on your system.\n\nDuring system optimizations and tweaking it provides essential system and overclock information, advanced hardware monitoring and diagnostics to assess the effect of using those or other settings. Benchmarks CPU module floating point and memory to measure the actual system performance and compare it to previous states or other systems. Furthermore, complete software, operating system and security product AIDA64 translates into comprehensive system diagnostics tool that provides over 100 pages of information about your computer.\n\nFeatures:\nLevel information about motherboard and CPU\nDetails of the video drivers and monitor\nInformation about all storage devices\nExhaustive information about network adapters, multimedia and input devices\nInformation about other glands (PCI, PnP, PCMCIA, USB)\nDetails of Windows, including the date of installation, the license key and more\nInformation about network shares, users and groups list, and much more\nLarge amount of information about networking status, remote access, network resources and Internet settings\nDetailed information about installed programs, scheduled tasks and startup programs\nInformation about operating system security\nA list of firewalls, anti-spyware and anti-\nSystem Stability Test\nCPUID Panel\nHardware monitoring\nBenchmarks CPU and FPU\nTests of memory\nModule performance test drive\nDetection of possible misconfiguration and compatibility issues of hardware and software\nReport Wizard\nMailing and printing\n\nTested with Win7 x64\n\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! \n\n        This is a exe. This is best Quality,Just Enjoy!\n\nDownload keygen seprate   @    Keygen-Chili  TPB\n\nSEED AND ENJOY !\n\nTHE UPLOADS ARE VIRUS / MALWARE FREE.\n\nLEAVE COMMENTS FOR OTHER DOWNLOADERS TO REFER.\n\nAND REMEMBER TO ENJOY ! \n\nIF YOU DON'T SEED, YOU DON'T NEED THIS TORRENT!!! BE KIND TO OTHER DOWNLOADERS \t\t\t\t\t\t\t\t","torrent":{"xt":"urn:btih:83c72e95a5ec4708ca52b7b26721dbe3c15193a0","amp;dn":"AIDA64Business+-+4.30.2900+ML","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c72e95a5ec4708ca52b7b26721dbe3c15193a0","infoHashBuffer":{"type":"Buffer","data":[131,199,46,149,165,236,71,8,202,82,183,178,103,33,219,227,193,81,147,160]},"announce":[],"urlList":[]}}