{"title":"FarStone DriveClone Pro 5.1","uid":4283415,"size":89820759,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:853e70a120dc1088e558e021c720c3eb0043a4b1&amp;dn=FarStone+DriveClone+Pro+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"needskec","files":2,"time":1215550539,"description":"FarStone DriveClone Pro cloning software copies an exact image of a computer?s hard drive or hard drive partitions and stores the image as a compressed archive of all files, all partition information, and all security information. You can save the cloned image on a recordable CD/ DVD or USB device for easy data backup and recovery, or use it to ghost a single hard drive image onto multiple computer systems. \n\nFeatures &amp; Benefits:\nHard Drive Imaging. Make an exact copy of your hard drive, including system settings and partition information, and save it as a bootable disk image \nUniversal Restore. Transfer a system image to a hard drive of different size, format, or brand, regardless of installed drivers \nBare Metal Restore. Copy a complete system image onto a new hard drive straight out of the box ? without having to install an operating system first \nUSB Hot Drive (Optional). Use a cloned image saved to a USB hard drive just like a local hard drive on your system. This feature allows you to keep working normally on your computer, even if your hard drive fails \nComplete External Backup. Store a your hard disk image on a USB hard drive, a network share, or use the built-in burner to save a copy of your hard drive on CD or DVD \nIncremental Backup. Quickly update your saved disk image without ever leaving Windows \nSystem Snapshots. Preview and browse automatically saved system backup points to be sure that you?re picking the right one \nImaging across Multiple Hard Drives. Clone a 1:1 image across multiple computers to eliminate the time-consuming process of reinstalling operating systems and hardware drivers \nPre-Windows Recovery. Recover your disk image in pre-OS mode to get up and running after a system crash \nCD/DVD Burning. Create a bootable recovery disc directly from the software \nPartition Support. DriveClone Pro supports FAT32, NTFS, Linux EXT2/3 and other unknown partitions \n* Hardware Support. DriveClone Pro supports IDE, EIDE, SATA, and SCSI hard drives and hardware RAID 0/1\n\n\nWHAT?S NEW?\nVista Support: DriveClone Pro works on 64 or 32-bit Windows Vista, XP, and 2000 Professional \nUniversal Restore: Migrate a system to dissimilar hardware, regardless of the manufacturer \nUSB Hot Drive: Run your system off a cloned image saved to a USB drive \nDisk Imaging within Windows: Create a complete hard drive image without leaving your familiar Windows environment \nOngoing Snapshots: Preview and select an automatically created backup point to restore an entire system \nFireWire Support: Store your disk image on a FireWire device \nIncremental Backup: Quickly update a saved hard disk image to keep data current","torrent":{"xt":"urn:btih:853e70a120dc1088e558e021c720c3eb0043a4b1","amp;dn":"FarStone+DriveClone+Pro+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"853e70a120dc1088e558e021c720c3eb0043a4b1","infoHashBuffer":{"type":"Buffer","data":[133,62,112,161,32,220,16,136,229,88,224,33,199,32,195,235,0,67,164,177]},"announce":[],"urlList":[]}}