{"title":"Nfs Most Wanted+Crack+Trainer.iso","uid":4609045,"size":2223364096,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8554aa6721c2a28960fbc191874ad0603095cb21&amp;dn=Nfs+Most+Wanted%2BCrack%2BTrainer.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"headshot69","files":1,"time":1230575031,"description":" \t\nWake up to the smell of burnt asphalt as the thrill of illicit street racing permeates the air. From the makers of the hit Need for Speed? Underground series, Need for Speed? Most Wanted challenges players to become the most notorious and elusive street racer.\n\nCombining illicit street racing and tuner customization with the intensity of strategic police pursuit that surpasses any Hollywood-style chase scene, Need for Speed Most Wanted will be on every gamer's 'must-have' list this holiday season. Out-race rivals, evade cops and exploit hundreds of miles of open road as gamers make their way up the Blacklist.\n\nTo become the most wanted racer, players must build up their street cred and Rap Sheet with gripping, white knuckle, head-to-head races with the top drivers on the streets, as well as pull daring, evasive moves to out-run and out-fox the cops that patrol the open road. Players can manage their heat or utilize a number of strategic tactics to keep the cops off their tails as they leave their rivals behind to suck their exhaust fumes.\n\nNeed for Speed Most Wanted also features a variety of the hottest cars that range from tuners to super cars. You can customize your ride to race against any class of vehicles. The streets will be your playground this Fall.\n\nKey Features\n\n    * Open Road, Open World: Rule the streets as the most notorious street racer in various regions that include edgy industrial and urban environments. In the game, the environment can be a friend for a foe. Players will master short-cuts as well as use the traffic and destructible environments to their advantage.\n\n    * All-New Gameplay: Need for Speed Most Wanted features new and exciting gameplay that incorporates strategic cop pursuit and skill-based evasion techniques with illicit street racing.\n\n    * Visual Customization: Whether gamers are trying to lose the cops or they just want to pimp their ride, Need for Speed Most Wanted offers extensive visual customizations.\n\n    * Blacklist: As players enter the world of illicit street racing, they must go up against the best street racers on the scene to earn respect and rise to the top of the Blacklist.\n\n    * Rap Sheet: Players will build up their Rap Sheet with record breaking times, street challenges and out-foxing an escalation of police vehicles, tactics and technology.\n\n    * Performance Tuning: Can't compete against a sports car? Head to the safehouse and tune up your ride to race against any class of vehicles.\n\n    * Next-Gen Graphical Features: Need for Speed Most Wanted for the next generation console delivers the next level of graphical excellence in video games. Utilizing graphical techniques including normal mapping and real-time lighting, the graphical experience is incomparable to any racing game on the market.\n\n    * Race Online* Need For Speed Most Wanted features online play for Xbox 360, Xbox, the PlayStationÃ‚Â®2 computer entertainment system and the PC. \n\nEnjoy, Comment, and Seed!\nby_ Myahi","torrent":{"xt":"urn:btih:8554aa6721c2a28960fbc191874ad0603095cb21","amp;dn":"Nfs+Most+Wanted%2BCrack%2BTrainer.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8554aa6721c2a28960fbc191874ad0603095cb21","infoHashBuffer":{"type":"Buffer","data":[133,84,170,103,33,194,162,137,96,251,193,145,135,74,208,96,48,149,203,33]},"announce":[],"urlList":[]}}