{"title":"WABCO, At This Moment; 1954 *HAS-BEEN*","uid":4384021,"size":410695169,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:859c61b626faa252982fad76e19aac0dd34a78af&amp;dn=WABCO%2C+At+This+Moment%3B+1954+%2AHAS-BEEN%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Has-Been","files":1,"time":1220817778,"description":"Jam Handy production.  Westinghouse Air Brake Co. 1954.  Same copy as downloaded from archive.org.  Parts 1 and 2 have been combined into one WMV file.\n\nReviewer: Christine Hennig - [4.0 out of 5 stars] - October 9, 2003\n\nSubject: Guys Are Going On and On About Railroads (and On and On and On...)\n\nThis 50s film about railroads features a plot only an industrial filmmaker could love. A stranger walks into Scottie's, a diner frequented by railroad men, and flirts with Kelly, the waitress. \n\nThe railroad men are all abuzz about a tv documentary that's going to be made about railroads. They begin to loudly converse their opinions about what sort of things they should put into the show and are about as convincing, and as tedious, as the French noblemen in the Monty Python &quot;Dennis Moore&quot; sketch, whose entire conversation consists of facts about French history straight out of the Encyclopedia Brittanica. The worst is Scottie himself - he's a full-fledged railroad geek, a walking database of railroad facts and figures that he spouts off at the drop of a hat. Even the other railroad men are sick of him. \n\nAs if this wasn't bad enough, the stranger plays devil's advocate, periodically making comments to Kelly that are really designed to bait the railroad guys, and it works, too. One guess who turns out to be the producer of the tv documentary. Of course, Kelly falls for the guy and this causes her to do a little dance at the end of the day while she's cleaning up. Just as it threatens to turn into Design for Dreaming, Kelly suddenly remembers she's a working-class girl, thus she won't be allowed to enter The Future, and comes back down to earth. She does get some flowers and a nice note from the producer, which in Jam Handy's universe is all she has the right to expect, and she knows it. At least she doesn't get called &quot;Greasy,&quot; for which she should be grateful. \n\nMostly, though, this is just a bunch of guys going on and on and on about how great railroads are, spouting fact after boring fact. This is interspersed with the expected footage of railroads at work. Train buffs will probably like this film, and outright railroad geeks like Scottie will probably give it 5 stars. All others will want the railroad guys to shut up after about the first 10 minutes. \n\nI'm a bit surprised by this film - usually Jam Handy makes his points a lot more smoothly and cleverly. Perhaps Westinghouse, who sponsored the film, gave him a huge list of facts that he was ordered to cram into the film. \n\nThe railroad logos that go by during the opening credits are cool, though. I want all of 'em on little metal tags, like that great metal tag collection at Pioneer Village.\n\nRatings: Camp/Humor Value: ****. Weirdness: ****. Historical Interest: *****. Overall Rating: ****.","torrent":{"xt":"urn:btih:859c61b626faa252982fad76e19aac0dd34a78af","amp;dn":"WABCO%2C+At+This+Moment%3B+1954+%2AHAS-BEEN%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"859c61b626faa252982fad76e19aac0dd34a78af","infoHashBuffer":{"type":"Buffer","data":[133,156,97,182,38,250,162,82,152,47,173,118,225,154,172,13,211,74,120,175]},"announce":[],"urlList":[]}}