{"title":"Coast.to.Coast.AM.May.31.2009-komie","uid":4927002,"size":56942441,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:85a9e7cb2b40d83cce01b505609c14298778aaf3&amp;dn=Coast.to.Coast.AM.May.31.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":6,"time":1243883359,"description":"JFK Assassination &amp; Conspiracies\n\n\n\nDate:\n05-31-09\n\nHost:\nGeorge Knapp\n\nGuests:\nMark Allin, John Barbour\n\n\nGeorge Knapp welcomed award-winning broadcaster John Barbour for a discussion about the JFK assassination. Parts of Barbour's interview with the late Jim Garrison were played during the show. Garrison was the New Orleans district attorney who conducted his own investigation into the assassination and implicated the CIA. In the latter half of the program, AboveTopSecret.com's Mark Allin joined the conversation to talk about the evolution of conspiracy-related media.\n\nBarbour said his three-hour interview with Garrison was inspiring and exhilarating, but when portions aired on his TV show Real People in 1988, it was edited without his consent to make Garrison look delusional. He told Barbour that he believed six people killed Kennedy, acting in three teams of two, while around 32 individuals were involved in the conspiracy. Included was Lawrence V. Meyers, a businessman with ties to the CIA, who reportedly met with Jack Ruby on Nov. 23rd, 1963. Researcher Jim Marrs has said the CIA used Meyers to get Ruby to eliminate Lee Harvey Oswald.\n\nThere was evidence that the changing of JFK's motorcade route in Dallas was part of the conspiracy, and there were also Mafia connections to the killing, Barbour noted. Interestingly, a CIA agent named Richard Case Nagell who had been assigned to keep an eye on Oswald, claimed he wrote a letter to J. Edgar Hoover in September 1963, warning of a plot to assassinate Kennedy in November. He was ignored and subsequently jailed. Allin noted that even after all these years, people still want answers in the JFK assassination, and that the 9-11 truth movement has served to re-energize the public's interest in conspiracies. Barbour's interview The Garrison Tapes, can be viewed in its entirety on AboveTopSecret.com.\nWebsite(s):\n# abovetopsecret.com\nVideo(s):\n# The Garrison Tapes\nBook(s):\n# Above Top Secret\n","torrent":{"xt":"urn:btih:85a9e7cb2b40d83cce01b505609c14298778aaf3","amp;dn":"Coast.to.Coast.AM.May.31.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a9e7cb2b40d83cce01b505609c14298778aaf3","infoHashBuffer":{"type":"Buffer","data":[133,169,231,203,43,64,216,60,206,1,181,5,96,156,20,41,135,120,170,243]},"announce":[],"urlList":[]}}