{"title":"Sex Drive (2008)UNRATED[TabsmanRIP][H33T][Release]","uid":4946712,"size":734213413,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a42d291f23f4b82d700842c5536ab005629dc34&amp;dn=Sex+Drive+%282008%29UNRATED%5BTabsmanRIP%5D%5BH33T%5D%5BRelease%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XoLWoX","files":-1,"time":1244690312,"description":"Plot Summary~&gt;Eighteen-year-old Ian Lafferty sets out on a cross country drive with his best friends Lance and Felicia in order to lose his virginity to a red-hot babe he met on the Internet. But the journey, filled with hilarious misadventures and raunchy escapades, teaches all three more than they expected about life and love. Randy, raucous and unexpectedly romantic, Sex Drive follows three friends on the road trip of a lifetime!\n\nIan Lafferty (Josh Zuckerman) can't seem to catch a break. He's taunted by his cocksure older brother Rex (James Marsden), shown up in the romance department by his 14-year-old younger brother and humiliated by his job at a mall donut shop. But Ian's biggest problem is that he's about to start college as a virgin!\n\nGetting nowhere with the girl of his dreams and longtime best friend Felicia (Amanda Crew), Ian resorts to the Internet for dates. He soon hooks up with Ms. Tasty, a flaming hot blonde who can't wait to get busy. The only catch: Ian has to drive 500 miles from Chicago to Knoxville to consummate the deal.\n\nEgged on by his devil-may-care pal Lance (Clark Duke), Ian risks life and limb by appropriating The Judge, Rex's prized vintage Pontiac GTO. With Lance and Felicia in tow, he hits the road for a one-time rendezvous that will rock his world!\n\nCar trouble, a stint in the pokey, a buggy tow with an Amish farmer (Seth Green) and an afternoon at a roadside carnival all complicate Ian's journey. As he presses on to get to Knoxville before Ms. Tasty gives up and goes home, the trio's trail of mayhem closes in on them with hilarious consequences. Will Rex find Ian before he reaches Nirvana? Will a cuckolded husband exact revenge on Lance just as he seems to have found true love? Will Ms. Tasty live up to her Internet profile? Will Ian realize what he really wants? And most importantly, Will Ian, Felicia and Lance survive the bumpy road to adulthood with all its unexpected twists and turns?\n\nGspot Info~&gt;AVI File Details\n========================================\nName.........: Sex Drive (200UNRATED[Tabsman][H33T][Release].avi\nFilesize.....: 699 MB (or 716,770 KB or 733,972,480 bytes)\nRuntime......: 02:09:57 (186,938 fr)\nVideo Codec..: XviD\nVideo Bitrate: 620 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s (64/ch, stereo) CBR \nFrame Size...: 608x336 (1.81:1) [=38:21]\nSubs~&gt;NO\n\nIMDB &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1135985/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1135985/&lt;/a&gt;","torrent":{"xt":"urn:btih:8a42d291f23f4b82d700842c5536ab005629dc34","amp;dn":"Sex+Drive+%282008%29UNRATED%5BTabsmanRIP%5D%5BH33T%5D%5BRelease%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a42d291f23f4b82d700842c5536ab005629dc34","infoHashBuffer":{"type":"Buffer","data":[138,66,210,145,242,63,75,130,215,0,132,44,85,54,171,0,86,41,220,52]},"announce":[],"urlList":[]}}