{"title":"Adler, Elizabeth - Meet Me in Venice","uid":5243416,"size":135339298,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8bec5b583b925da3a4270a7be54f86574a194c89&amp;dn=Adler%2C+Elizabeth+-+Meet+Me+in+Venice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kzlists","files":134,"time":1261880742,"description":"Meet Me in Venice by Elizabeth Adler (2007)\n\nFOUR WORDS WOULD CHANGE HER LIFE...Precious Rafferty is an American antiques dealer living in Paris. Though Precious--known as Preshy--lives in the world's most romantic city, she keeps her feet firmly on the ground. No man will ever sweep her off her feet. Until she meets Bennett James. He's perfect in every way. Is he too good to be true? Granted, she doesn't know much about his business or personal life in Shanghai, but isn't it time to stop being so jaded about romance? And then her long-lost cousin Lily Song sends her an urgent message about Preshy's new love. &quot;Meet me in Venice&quot; are Lily's cryptic words.ONE MAN MIGHT POSSIBLY END IT...Lily lives in Shanghai and knows the antiques underworld there--and she has a secret important enough to draw her to Venice to meet Preshy for the first time, face-to-face. Ruggedly handsome, world-weary writer Sam Knight senses there's a story afoot. Precious senses he's getting closer and closer to her and enmeshed in this tangled web of danger and desire. But is Sam also not all he seems to be? Does he have a terrible secret he's keeping from Preshy? In Venice, Precious will have to weave through a maze of betrayers and seducers to discover who she can trust with her heart...and with her life. Page-turning, lushly descriptive, and intelligent, Meet Me in Venice is a cat-and-mouse game with plenty of twists and wonderful characters you'll never forget. It is Elizabeth Adler at her storytelling best.","torrent":{"xt":"urn:btih:8bec5b583b925da3a4270a7be54f86574a194c89","amp;dn":"Adler%2C+Elizabeth+-+Meet+Me+in+Venice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bec5b583b925da3a4270a7be54f86574a194c89","infoHashBuffer":{"type":"Buffer","data":[139,236,91,88,59,146,93,163,164,39,10,123,229,79,134,87,74,25,76,137]},"announce":[],"urlList":[]}}