{"title":"Mon oncle Antoine (Jutra, 1971)","uid":4421911,"size":734256314,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8d657326dcf59917be81fd4ee4383a82c85af566&amp;dn=Mon+oncle+Antoine+%28Jutra%2C+1971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ggoes","files":2,"time":1222824970,"description":"Mon oncle Antoine - Claude Jutra, 1971\n\n\tCast:\n\t\tJacques Gagnon - Benoit\n\t\tLyne Champagne - Carmen\n\t\tJean Duceppe - Uncle Antoine\n\t\tOlivette Thibault - Aunt Cecile\n\t\tClaude Jutra - Fernand, Clerk\n\n***\nAMG Summary: \n\n\tFrench Canadian director and actor Claude Jutra enjoyed his greatest critical success with this evocative and loving (but unsentimental) look at a few memorable days in the life of a boy on the verge of manhood in a small Quebec mining community in the 1940's. Benoit is just edging into his teens and learns two days before Christmas that his father, tired of dealing with the arrogant English Canadians who run the local asbestos mine, has quit his job and is heading off to a logging camp for a few months. Benoit works part-time for Antoine, his uncle who owns the local general store and moonlights as an undertaker; Antoine takes the boy under his wing for a few days while the shop is busy during the holiday rush. Benoit helps set up the store's annual Christmas window display, spies on the most beautiful woman in town as she tries on some specially ordered lingerie, finds his feelings for teenage co-worker Carmen changing from indifference to attraction, and joins his friends for a snowball raid on the owner of the town's mining operation as he contemptuously distributes gifts to the poor. But when Benoit joins his uncle to collect the body of a boy who has recently died, he confronts mortality for the first time and comes to realize what sort of a man his uncle really is. Mon Oncle Antoine won eight Genie Awards and was honored at seven international film festivals, but it wasn't until the film was broadcast on Canadian television that it was widely seen in its home country; since then, a poll of Canadian film writers named it the Best Canadian Film of all time in 1984, and similar polls in 1994 and 2004 found Mon Oncle Antoine still at the top of the list.\n\n***\nName.........: Mon oncle Antoine.avi\nFilesize.....: 700 MB (or 717,044 KB or 734,253,056 bytes)\nRuntime......: 01:44:57 (150,989 fr)\nVideo Codec..: XviD\nVideo Bitrate: 838 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 87 kb/s (43/ch, stereo) VBR LAME3.97\nFrame Size...: 640x384 (1.67:1) [=5:3]\n\nSpoken language is QuÃƒÆ’Ã‚Â©bÃƒÆ’Ã‚Â©cois French, with hardsubbed English subtitles.\n(Criterion DVD rip; ggoes) &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com/index.cgi?board=6&amp;action=display&amp;thread=2795&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com/index.cgi?board=6&amp;action=display&amp;thread=2795&lt;/a&gt;\n\n***\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde. \n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:8d657326dcf59917be81fd4ee4383a82c85af566","amp;dn":"Mon+oncle+Antoine+%28Jutra%2C+1971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d657326dcf59917be81fd4ee4383a82c85af566","infoHashBuffer":{"type":"Buffer","data":[141,101,115,38,220,245,153,23,190,129,253,78,228,56,58,130,200,90,245,102]},"announce":[],"urlList":[]}}