{"title":"vista transformation pack 9.1","uid":5992726,"size":28140375,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8dc6ac639c5c9ef40ed0e9a9768ec9dc2b6e2706&amp;dn=vista+transformation+pack+9.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hasnain11","files":1,"time":1290904895,"description":"                    \n\n\n\nVista Transformation Pack is a popular app that allows you to make superficial changes to XP that give it the Vista look.\n\nFor many people, the only reason worth upgrading to Vista is for the look, since the functionality and basic framework don't really differ that much from XP. If you think the same way, then you'll be more than happy with Vista Transformation Pack.\n\nOnce installed, Vista Transformation Pack makes your start-up screen, cursors, sounds, screen-savers, toolbars, clock, etc. look like the ones seen in Vista. The transparent effect is hard to emulate, but by combining with Windows Blinds, Vista Transformation Pack does a surprisingly impressive job. Be warned however that some users have complained Vista Transformation Pack changes driver DLLs in XP which make it difficult to remove, or at least, it leaves problems behind when you do so.\n\nTo be fair to them, the Vista Transformation Pack developers advise you to view their user discussion board before installing Vista Transformation Pack to find out about any potential problems as they readily admit that they are not aware of all the bugs it may cause.\n\nNote that if you're simply updating Vista Transformation Pack, there's no need to uninstall the original - just install the patch. The developers have also added a user selection feature whereby if you log onto your PC as a different user, you can select whether you want to transform your XP desktop to Vista.\n\nVista Transformation Pack is probably one of the best transformation packs out there although be warned that it's likely to cause conflicts with programs from time to time.\nLanguages:\n\nEnglish\nRecent changes in Vista Transformation Pack:\n\n    * Added ViSplore in unsafe applications list\n   \n * Added restrcting to set unsafe applications in Personalization page\n   \n * Fixed Windows XP Service Pack 3 compatibilities\n   \n * Fixed &quot;Do not show this welcome screen after restart&quot; option bug that always \n   keep program in startup instead\n    \n * Updated Vista Rainbar's launcher for constant waiting cursor activity issue\n   \n * Updated Vistalize basic desktop theme components to apply font and toolbar in  \n    Personalization\n \n* Updated VisualTooltip default configuration to set area space in bottom from 30 \n  to 0\n \n * Updated WinFlip's configuration for higher reliablity and compatibilities with \n   ViStas\n\n\nOS requirements for Vista Transformation Pack:\n\n    * OS: Windows XP\n\nMinimum requirements:\n\n    * Windows Blinds\n\n","torrent":{"xt":"urn:btih:8dc6ac639c5c9ef40ed0e9a9768ec9dc2b6e2706","amp;dn":"vista+transformation+pack+9.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc6ac639c5c9ef40ed0e9a9768ec9dc2b6e2706","infoHashBuffer":{"type":"Buffer","data":[141,198,172,99,156,92,158,244,14,208,233,169,118,142,201,220,43,110,39,6]},"announce":[],"urlList":[]}}