{"title":"Crasher-FANiSO","uid":6283798,"size":352569836,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8dd6c8bc1f1cc0407d62a333447861572174386d&amp;dn=Crasher-FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MAFIAA.","files":26,"time":1301540920,"description":"Supplied By: A Friend               Diskettes   : 1 CD\n\nCracked By : A Friend               Game Type   : Action\n\nPackaged By: A Friend               Released On : 30. March 2011\n\n\n\n\n\nNote\n\n~~~~\n\nGame is MULTI3 - EFG - ENG/FRA/GER\n\n\n\nGame is online ONLY! But that doesnt matter due to the excellent\n\nfake steam api config tool, where you choose your unique steam user\n\nand play worldwide with other steam users \n\n\n\nChoose your language in the config tool too!\n\n\n\nRelease\n\n~~~~~~~\n\nCRASHER is the first Multiplayer Online Battle Arena (MOBA) game to\n\nstage motorized team battles, pitting up to 5 vs. 5 players. The usual\n\nmouse-controlled heroes are replaced by heavily-armed vehicles hurtling\n\nacross huge maps at 150 mph. Each vehicle belongs to one of the\n\n6 CRASHER classes (specialized in close or range combat, defense,\n\nhealing etc.), and features specific skills and tactical features\n\nenabling players to design a well-balanced team.\n\n\n\nAmong the available game modes, the CRASHER Terrority Control mode\n\nplaces players at the heart of intense strategic battles, in which they\n\nmust capture and defend map areas. The CRASHER Battle Arena mode offers\n\nquicker, fast-paced battles in evolving maps. No respawns occur\n\nhere - each death is final, and the last standing allied survivors lead\n\ntheir team to victory.\n\n\n\nXP points and items reward team victories and individual achievements\n\nalike, offering countless skill customization possibilities. Players are\n\ntherefore free to design unique vehicles, suited to their own gaming\n\nstyle, which will lead them to the heights of the CRASHER leaderboard!\n\n\n\nFeatures:\n\n~~~~~~~~~\n\n* The first MOBA ever to stage motorized battles\n\n* Over 15 vehicles available for launch, each featuring their own\n\n specifications and tactical interests\n\n* 6 vehicle classes, allowing each player to find a specific place\n\n in the team\n\n* Over 100 unique, vehicle-specific or unlockable skills\n\n* Multiplayer team battles pitting up to 5 vs. 5 players in CRASHER\n\n Terrority Control or CRASHER Battle Arena modes\n\n* The experience earning system (and leaderboard) accounts for individual\n\n achievements in battle and team results alike\n\n* Almost infinite vehicle customization and itemization options\n\n* Original and assertive graphic style and level design\n\n* Fast-paced combat system fusing action, arcade-style\n\n driving and strategy\n\n\n\nInstall\n\n~~~~~~~\n\n1.) Unpack\n\n2.) Install\n\n3.) Play\n","torrent":{"xt":"urn:btih:8dd6c8bc1f1cc0407d62a333447861572174386d","amp;dn":"Crasher-FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dd6c8bc1f1cc0407d62a333447861572174386d","infoHashBuffer":{"type":"Buffer","data":[141,214,200,188,31,28,192,64,125,98,163,51,68,120,97,87,33,116,56,109]},"announce":[],"urlList":[]}}