{"title":"Urchin 2007","uid":6046487,"size":732504111,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:91fc0a4a33efb52b2fe95e5d74300b45f66328fc&amp;dn=Urchin+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"radumanu","files":2,"time":1292574643,"description":"In a tunnel deep under Manhattan, the Old Man rules the citizens of Scum-City. He swears to lead them to a paradise within the hollow earth once he finds five noble souls; but until then his followers must steal and deal to support him. A terminally ill hunchback named Goliath, crazed by his approaching death, decides to find the five noble souls and present them to the Old Man;by beheading New Yorkers he deems worthy of the honor. Meanwhile, another Scum-City dweller known as The Kid tries to do the Old Man\\\\\\'s bidding, tangling with deadly gangsters and eccentric drug dealers-even though The Kid is only nine and his main weapon is a water pistol filled with acid. As both Goliath and The Kid pursue paths they believe will lead to paradise, they rob, kill;and inevitably confront each other in a grand showdown.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0462591/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0462591/&lt;/a&gt;\n\n\nThis is the story of a child who lives in Scum City. When the Old Man came to Scum City, a homeless camp in the Manhattan tunnels, his story seemed wild. He was from a kingdom deep within the earth, he said, and was sent to find the five nobles who got lost up here.\n\nHe had a map that would lead him and his followers back to this paradise, and a blue crystal called The Blessing, that when smoked granted the clarity and vision needed to complete great tasks.\n\nTrivia\n\n\nTrivia\n\n    * An unfinished version of the film was shown at the 'Sixth H.O.P.E. conference'.\n    * Computer hackers Phiber Optik, Emmanuel Goldstein, and Bill From RNOC acted in the film..\n","torrent":{"xt":"urn:btih:91fc0a4a33efb52b2fe95e5d74300b45f66328fc","amp;dn":"Urchin+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91fc0a4a33efb52b2fe95e5d74300b45f66328fc","infoHashBuffer":{"type":"Buffer","data":[145,252,10,74,51,239,181,43,47,233,94,93,116,48,11,69,246,99,40,252]},"announce":[],"urlList":[]}}