{"title":"Exodus Evidence and Events Following Escape from Egypt - Jim and","uid":5423894,"size":991679520,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:92fd2a1dff5d131e6d977752135d81900bd37572&amp;dn=Exodus+Evidence+and+Events+Following+Escape+from+Egypt+-+Jim+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmman","files":1,"time":1268176070,"description":"This is an interview with a couple who went out to search for the real Mt. Sinai. Along the way they make various amazing discoveries related to the mountain where Moses received the ten commandments, golden calf, the rock at Horeb, stone pillars representing Israel, bronze found in coral, etc etc... Yes, it is a bit long, but at least watch 30 minutes. It gets better and better as you go along and what is observed really confirms the Biblical accounts in Exodus. Coincidentally, the area is highly guarded.\n\nIn the beginning they talk about it snowing Star of David snowflakes. Here's a link to that: http://splitrockresearch.org/content/109/Video_Clips/Snowflakes\n\nThey also mention a movie coming out soon about the Exodus. It looks really good: http://www.exodusconspiracy.com/\n\n&quot;This two hour DVD is packed with information about the evidence in Saudi Arabia for the Biblical Mt. Sinai. The show was broadcast first on June 1, 2009, and has replayed many times on God's Learning Channel. With numerous video clips as well as multiple photo images, the Caldwell's discuss in great detail with Al and Tommie Cooper, founders of GLC, their eye-witness accounts, and how they believe the evidence relates to Israel's Exodus from Egypt.&quot;\n\nNote: This is the HIGH resolution version. I have uploaded a smaller version as well.","torrent":{"xt":"urn:btih:92fd2a1dff5d131e6d977752135d81900bd37572","amp;dn":"Exodus+Evidence+and+Events+Following+Escape+from+Egypt+-+Jim+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92fd2a1dff5d131e6d977752135d81900bd37572","infoHashBuffer":{"type":"Buffer","data":[146,253,42,29,255,93,19,30,109,151,119,82,19,93,129,144,11,211,117,114]},"announce":[],"urlList":[]}}