{"title":"Henry Louis Gates on Lincoln and Race","uid":4744472,"size":236904315,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:93618f7a57e9947f96a9ff97067104cf2bc8cf37&amp;dn=Henry+Louis+Gates+on+Lincoln+and+Race&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1235759617,"description":"Henry Louis Gates, Jr. discusses two books he has coming out in early 2009 -- Lincoln on Slavery and Race (Princeton) and In Search of Our Roots: How 19 Extraordinary African Americans Reclaimed Their Past (Crown Books).\n\nThe Lincoln book is a companion piece to a PBS documentary. \n\nHenry Louis Gates Jr - Henry Louis &quot;Skip&quot; Gates, Jr. (born September 16, 1950, Piedmont, West Virginia) is a literary critic, educator, scholar, writer, editor, and public intellectual. Gates currently serves as the Alphonse Fletcher University Professor at Harvard University, where he is Chair of the African and African American Studies Department and Director of the W.E.B. Du Bois Institute for African and African American Research.\nWalter Isaacson - Walter Isaacson is the President and CEO of the Aspen Institute. He has been the Chairman and CEO of CNN and the Managing Editor of Time Magazine. He is the author of Benjamin Franklin: An American Life (2003) and of Kissinger: A Biography (1992) and is the coauthor of The Wise Men: Six Friends and the World They Made (1986). His biography of Albert Einstein - Einstein: His Life and Universe - was released in April 2007. Isaacson was born on May 20, 1952, in New Orleans. He is a graduate of Harvard College and of Pembroke College of Oxford University, where he was a Rhodes Scholar. He began his career at the Sunday Times of London and then the New Orleans Times-Picayune/States-Item. He joined Time Magazine in 1978 and served as a political correspondent, national editor and editor of new media before becoming the magazine's 14th managing editor in 1996. He became Chairman and CEO of CNN in 2001, and then president and CEO of the Aspen Institute in 2003. He was appointed after Hurricane Katrina to be the vice-chairman of the Louisiana Recovery Authority. He is on the Board of Directors of United Airlines, Tulane University, the National Constitution Center, and he is chairman of the board of Teach for America.\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:93618f7a57e9947f96a9ff97067104cf2bc8cf37","amp;dn":"Henry+Louis+Gates+on+Lincoln+and+Race","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93618f7a57e9947f96a9ff97067104cf2bc8cf37","infoHashBuffer":{"type":"Buffer","data":[147,97,143,122,87,233,148,127,150,169,255,151,6,113,4,207,43,200,207,55]},"announce":[],"urlList":[]}}