{"title":"The Concise Focal Encyclopedia of Photography{BBS}","uid":6720536,"size":106038562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9399057c54142c773934f9b17bb8ed7b25f73161&amp;dn=The+Concise+Focal+Encyclopedia+of+Photography%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317774811,"description":"Defining photography is impossible. Revealing it is another matter, and that's what The Concise Focal Encyclopedia of Photography does,\nwith each turn of the page.\n\nHistory: The technical origins and evolution of photography are half of the story. The other half consists of the ways that cultural forces have transformed photography into a constellation of practices more diverse than any other mode of representation. Photographers can tell a more in-depth story through a photo like Dorothea Lange's &quot;Migrant Mother&quot; than a journalist ever could with the written word alone.\n\nMajor themes and practitioners: Over 25 entries, many with supporting illustrations,\nexamine the figures, trends, and ideas that have contributed most heavily to the history and current state of photography.\n\nContemporary issues: The issues influencing photography today are more complex than at any other time in its history. Questions of ethics, desire, perception, digitization, and commercialization all vie for attention. Hear what the experts have to say about crucial\nissues such as whether or not the images we take today will last the test of time, and if so, how?\n\nWhen material is covered this skillfully, &quot;concise&quot; is no compromise. The Concise Focal Encyclopedia of Photography is packed with useful information, compelling\nideas, and - best of all - pure pleasure.\n\n* Over 100 color images\n* Images from Ansel Adams, Howard Schatz, and Jerry Uelsmann to name just a few\n* International contributors from the top of their fields\nAbout the Author\nChairman of the Biomedical Photographic Communications department at the Rochester Institute of Technology and Professor in the School of Photographic Arts and Sciences.\n\nProduct Details\n\n    * Paperback: 320 pages\n    * Publisher: Focal Press; 1 edition (September 10, 2007)\n    * Language: English\n    * ISBN-10: 024080998X\n    * ISBN-13: 978-0240809984","torrent":{"xt":"urn:btih:9399057c54142c773934f9b17bb8ed7b25f73161","amp;dn":"The+Concise+Focal+Encyclopedia+of+Photography%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9399057c54142c773934f9b17bb8ed7b25f73161","infoHashBuffer":{"type":"Buffer","data":[147,153,5,124,84,20,44,119,57,52,249,177,123,184,237,123,37,247,49,97]},"announce":[],"urlList":[]}}