{"title":"Avril Lavigne - My Happy Ending HDRiP 750Dp [BunnyxD]","uid":4696085,"size":18851736,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:953f1ef93a97301c751eafdeae7bd80d2637e265&amp;dn=Avril+Lavigne+-+My+Happy+Ending+HDRiP+750Dp+%5BBunnyxD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bunnyxd","files":1,"time":1233564366,"description":"Avril Lavigne - My Happy Ending HDRiP 750Dp [BunnyxD]\n\nArtist: Avril Lavigne\nSong: My Happy Ending\nAlbum:Under My Skin \nYear:\n\n\nDear Downlaoder,\nThis File is an RiP of an HD video. Which Contents are Similar to HD File\n\n\nThe music video for &quot;My Happy Ending&quot; was written and directed by MTV and Grammy winner Meiert Avis. The video was shot on location in Williamsburg, Brooklyn, and Harlem, New York. The video takes place out of chronological order. It begins in medias res as Lavigne enters into a cinema, where she finds the film playing is a montage of her memories concerning a specific relationship she had. At first, the memories (shown in full color) are happy, depicting Lavigne at the park with her boyfriend, as he hands her a flower and they laugh together. They are also shown goofing off inside a laundromat. However, as Lavigne sings &quot;so much for my happy ending&quot;, the memories start to lose color. Lavigne and her boyfriend lie in bed together, as she looks at him and he (obviously reeling from a disagreement) stares blankly away. The relationship culminates during the song's bridge inside a grocery store, where the boyfriend antagonizes Lavigne, insisting that he talk to her. He grabs her and tries to pull her into his embrace. Fed up, Lavigne turns and pushes him into a wall of cans. She proceeds to run out of the grocery store and down the street (the video's opening scene), and to a guitar shop where she grabs a guitar and walks to the roof of the building. There, she walks right past the unapologetic boyfriend without looking at him. The theater film tears and the memories end, leaving the final seconds of the video as a close-up on Lavigne in the theater as she tries to decide if the break-up is happy after all.\n\nLavigne said of the video &quot;It's about a relationship that doesn't work out, and having to say goodbye to all of the memories and... all that stuff.&quot; When asked if the video for &quot;My Happy Ending&quot; actually contains a happy ending, Lavigne said: &quot;I don't know if the video has a happy ending. It kind of depends on how you look at it? In one way, it is because me and &quot;the guy&quot; in the video aren't together anymore, and I think that's a better thing.&quot;","torrent":{"xt":"urn:btih:953f1ef93a97301c751eafdeae7bd80d2637e265","amp;dn":"Avril+Lavigne+-+My+Happy+Ending+HDRiP+750Dp+%5BBunnyxD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953f1ef93a97301c751eafdeae7bd80d2637e265","infoHashBuffer":{"type":"Buffer","data":[149,63,30,249,58,151,48,28,117,30,175,222,174,123,216,13,38,55,226,101]},"announce":[],"urlList":[]}}