{"title":"Caso Abierto 5x13 by Clu","uid":4539159,"size":366290944,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9872d18605dc50c352c05f0c959f6c5e86d61c71&amp;dn=Caso+Abierto+5x13+by+Clu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clu.","files":1,"time":1227872293,"description":"Caso Abierto es una serie de corte policiaco sobre Lilly Rush (Kathryn Morris, Minority Report), la ÃƒÂºnica mujer detective en la brigada de homicidios de la comisarÃƒÂ­a de policÃƒÂ­a de Philadelphia, quien de repente encuentra su trabajo ideal cuando es asignada para investigar los llamados &quot;casos abiertos&quot;, denominaciÃƒÂ³n con la que se conoce a los casos que tras aÃƒÂ±os de investigaciÃƒÂ³n continÃƒÂºan sin poder resolverse, casos que son de difÃƒÂ­cil resoluciÃƒÂ³n dado el tiempo pasado y la consiguiente pÃƒÂ©rdida de pruebas y testigos.\n\nAntes, en su anterior labor en homicidios, Lilly aplicaba su amplio conocimiento e intuiciÃƒÂ³n sobre la mente criminal de asesinos actuales. Ahora, tendrÃƒÂ¡ que interrogar a testigos de crÃƒÂ­menes pasados, cuyas vidas y circunstancias han cambiado mucho desde entonces, usando los avances cientÃƒÂ­ficos que existen en la actualidad y buscar nuevas pistas para resolver esos casos que en el pasado quedaron sin resolver, todo un gran reto para esta aguda e inteligente detective. AdemÃƒÂ¡s, ella tiene que estar preparada para las consecuencias que puedan ocasionar sus investigaciones, ya que su trabajo puede abrir viejas heridas y llevar a los criminales a cometer nuevos crÃƒÂ­menes","torrent":{"xt":"urn:btih:9872d18605dc50c352c05f0c959f6c5e86d61c71","amp;dn":"Caso+Abierto+5x13+by+Clu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9872d18605dc50c352c05f0c959f6c5e86d61c71","infoHashBuffer":{"type":"Buffer","data":[152,114,209,134,5,220,80,195,82,192,95,12,149,159,108,94,134,214,28,113]},"announce":[],"urlList":[]}}