{"title":"Day Of The Dead 1985 DVD-Rip h.264","uid":5245974,"size":734541103,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9b54442cb50c0b411390d9041376e357f85b1ae0&amp;dn=Day+Of+The+Dead+1985+DVD-Rip+h.264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mezquit","files":2,"time":1261992333,"description":"The third chapter in the saga that director George Romero started in 1968 with NIGHT OF THE LIVING DEAD moves the story further along the timeline of the zombie apocalypse to a time when survivors are few and far between. At an underground Florida research station, Dr. Logan (Richard Liberty) conducts grotesque experiments on captured zombies to search for a way that the living and the living dead can cohabitate. Begrudgingly sharing the facility with the doctor is military man Rhodes (Joe Pilato) and his underlings. Scientist Sarah (Lori Cardille) and her fellow survivors seek refuge at the compound just in time to see a clash between Logan and Rhodes reach a critical turning point.\n\nDAY OF THE DEAD stands as the most controversial film in the series. While some feel that its confined, talky nature prevents it from achieving the constant white-knuckle thrills of the previous two films, others admire its strides toward figuring out what drives the zombies. Regardless, the third act features the most extreme and well-executed special effects in the series, with several gory sequences that will leave an undeniable impression on those who witness them.\n","torrent":{"xt":"urn:btih:9b54442cb50c0b411390d9041376e357f85b1ae0","amp;dn":"Day+Of+The+Dead+1985+DVD-Rip+h.264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b54442cb50c0b411390d9041376e357f85b1ae0","infoHashBuffer":{"type":"Buffer","data":[155,84,68,44,181,12,11,65,19,144,217,4,19,118,227,87,248,91,26,224]},"announce":[],"urlList":[]}}