{"title":"The Secret Life of Marilyn Monroe - J.Randy Taraborrelli.epub","uid":9342233,"size":7730237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b7e49d86efbeabd3ae6eb5ad0eea6626cb2c55b&amp;dn=The+Secret+Life+of+Marilyn+Monroe+-+J.Randy+Taraborrelli.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386957452,"description":"From New York Times bestselling author J. Randy Taraborrelli comes the definitive biography of the most enduring icon in popular American culture.\n\nWhen Marilyn Monroe became famous in the 1950s, the world was told that her mother was either dead or simply not a part of her life. However, that was not true. In fact, her mentally ill mother was very much present in Marilyn's world and the complex family dynamic that unfolded behind the scenes is a story that has never before been told...until now. In this groundbreaking book, Taraborrelli draws complex and sympathetic portraits of the women so influential in the actress' life, including her mother, her foster mother, and her legal guardian. He also reveals, for the first time, the shocking scope of Marilyn's own mental illness, the identity of Marilyn's father and the half-brother she never knew, and new information about her relationship with the Kennedy's-Bobby, Jack, and Pat Kennedy Lawford. Explosive, revelatory, and surprisingly moving, this is the final word on the life of one of the most fascinating and elusive icons of the 20th Century.","torrent":{"xt":"urn:btih:9b7e49d86efbeabd3ae6eb5ad0eea6626cb2c55b","amp;dn":"The+Secret+Life+of+Marilyn+Monroe+-+J.Randy+Taraborrelli.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b7e49d86efbeabd3ae6eb5ad0eea6626cb2c55b","infoHashBuffer":{"type":"Buffer","data":[155,126,73,216,110,251,234,189,58,230,235,90,208,238,166,98,108,178,197,91]},"announce":[],"urlList":[]}}