{"title":"Spider-Man - iPhone","uid":4580119,"size":675143700,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:9bd0f1176a6fa2006887e7c84672940e840ea5fb&amp;dn=Spider-Man+-+iPhone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aced6","files":1,"time":1229388375,"description":"&quot;Spider-Man&quot; for the iPhone / iPod Touch\n\nConverted with XViD4PSP 5.0\n_____________________________________________\n\nLength:  1:56:15\nYear:    2002\nRating:  PG-13\nGenre:   Action &amp; Adventure\nSize:    659,321 KB\n\nSummary: \n\nPeter Parker (Tobey Maguire), his best friend Harry Osborn (James Franco), and Peter's secret crush Mary Jane Watson (Kirsten Dunst) visit a genetics laboratory at Columbia University with their high school class. While taking photos in the laboratory, Peter is bitten on the hand by a genetically engineered &quot;super spider&quot;. Feeling unwell, he passes out shortly after arriving home. Meanwhile, scientist Norman Osborn (Willem Dafoe), Harry's father, is attempting to preserve his company's military contract, knowing that its loss will mean the end of his business. He experiments on himself with his company's new, but unstable, performance-enhancing chemical vapor which increases his speed, strength, and stamina. However, it also causes him to become insane and he kills his assistant, Mendel Stromm (Ron Perkins). The next morning, Peter wakes to find that his previously impaired vision has improved and that his body has metamorphosized into a more muscular physique. At school, he finds himself producing webbing and having the quick reflexes to avoid being injured in a fight with bully Flash Thompson (Joe Manganiello). Peter escapes from the school and realizes that he has acquired spider-like abilities from the spider bite. He quickly learns to scale walls, long jump across building rooftops and swing via webs from his wrists.\n\nNotes:\n\nSpider-Man is a 2002 American superhero film based on the fictional Marvel Comics character Spider-Man. The film is the first in the Spider-Man film series. The film was directed by Sam Raimi and stars Tobey Maguire, Kirsten Dunst and Willem Dafoe. The script was credited to David Koepp.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9bd0f1176a6fa2006887e7c84672940e840ea5fb","amp;dn":"Spider-Man+-+iPhone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9bd0f1176a6fa2006887e7c84672940e840ea5fb","infoHashBuffer":{"type":"Buffer","data":[155,208,241,23,106,111,162,0,104,135,231,200,70,114,148,14,132,14,165,251]},"announce":[],"urlList":[]}}