{"title":"10,000 Maniacs - Peace Train","uid":4850969,"size":126736388,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9cbe87e2eaa5dfa5a2e021029310c61d8a47b33d&amp;dn=10%2C000+Maniacs+-+Peace+Train&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1239872574,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Peace Train&quot; is the title of a 1971 hit song by Cat Stevens, taken from his album Teaser and the Firecat. The song climbed to #7 on the Billboard Hot 100 chart during the week of October 9, 1971, becoming Stevens' first Top 10 hit. The song also spent three weeks at #1 on the adult contemporary chart. It is also featured on The Very Best of Cat Stevens compilation album.\n\nAlong with John Lennon's &quot;Give Peace A Chance&quot;, Barry McGuire's &quot;Eve of Destruction&quot; and Dire Straits' &quot;Brothers in Arms&quot;, it is reputedly one of the most famous war-protest songs in history.\n\nAside from Stevens' original recording, another well-known cover version of &quot;Peace Train&quot; was recorded by the American alternative rock band 10,000 Maniacs. The song originally appeared on the band's 1987 album, In My Tribe, and although it failed to chart, the song received airplay from alternative and college radio stations. After Stevens made comments regarding author Salman Rushdie that 10,000 Maniacs lead singer Natalie Merchant found offensive, Merchant led an effort to have &quot;Peace Train&quot; removed from all copies of the album in the U.S. in 1989. The song appeared on copies of the album outside the U.S. and later appeared on various compilation albums.\n\nIn My Tribe is an album by folk-rock band 10,000 Maniacs. It was their second major-label album and their first to achieve large-scale success. John Lombardo, Natalie Merchant's songwriting partner on previous albums, left the band in 1986. Merchant began collaborating with the other members of the band, most notably with Rob Buck.\n\nIn 1989, the track &quot;Peace Train&quot; was removed at Natalie Merchant's insistence from the U.S. CD version after the song's composer, Yusuf Islam (formerly known as Cat Stevens) made statements interpreted as supporting Ayatollah Khomeini's fatwa against Salman Rushdie. The song remains on vinyl copies and CDs released outside the United States. The song was later included in a 2-CD compilation, Campfire Songs: The Popular, Obscure and Unknown Recordings, released on January 27, 2004 by Elektra/Asylum/Rhino Records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9cbe87e2eaa5dfa5a2e021029310c61d8a47b33d","amp;dn":"10%2C000+Maniacs+-+Peace+Train","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cbe87e2eaa5dfa5a2e021029310c61d8a47b33d","infoHashBuffer":{"type":"Buffer","data":[156,190,135,226,234,165,223,165,162,224,33,2,147,16,198,29,138,71,179,61]},"announce":[],"urlList":[]}}