{"title":"ITV Britains Secret Treasures Series 2 3of8 720p x264 AAC HDTV ","uid":9344789,"size":426885664,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9cc82992ad4cfd44bfeada6771150fb44b9b2a2f&amp;dn=ITV+Britains+Secret+Treasures+Series+2+3of8+720p+x264+AAC+HDTV+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MVGroup","files":-1,"time":1387011189,"description":"Britain's Secret Treasures: Series 2\n\nHistory Documentary hosted by Bettany Hughes and Michael Buerk, published by ITV in 2013 - English narration\n\n\nInformation\n------------------------------\n\nBritain's Secret Treasures: Series 2\nAward-winning journalist Michael Buerk and leading historian and broadcaster Bettany Hughes return to ITV for a brand new series of Britain's Secret Treasures. Following its success last year, Michael, Bettany and a host of guest presenters uncover a fresh hoard of extraordinary objects found by ordinary people that have changed our understanding of British history. Continuing its successful partnership with the British Museum's Portable Antiquities Scheme, which is responsible for all finds in England and Wales, the new series of Britain's Secret Treasures also joins forces with Treasure Trove Scotland and the Ulster Museum to include stories of outstanding artefacts discovered by members of the public in Scotland and Northern Ireland. Each and every artefact included in the new eight-part series has been selected due to its national importance, beauty and cultural or historic significance. All are artefacts, objects or treasures that have been left, lost or discarded by our ancestors, which reveal the remarkable story of how we once lived.\n\n\n1)  Part 1 \nIn episode one, broadcaster and anthropologist Mary Ann Ochota uncovers the story of some seemingly scrap metal that holds an incredible secret and baffled experts when it was first found in Lincolnshire. In 2010 recycling plant worker Steve Allenby made a discovery in a field near an RAF site, just outside of Lincoln. Steve says: &quot;I dug down and recovered a piece of copper alloy. I examined it and thought, 'This is very unusual'. I dug up a further two or three more pieces and thought, 'We're definitely onto something here.'&quot; initially thought to be fragments of unexploded munitions, under closer inspection experts suspected they were actually fragments of a statue of the disgraced Roman emperor Domitian and his horse.\n\n2)  Part 2 \nIn episode two, we find out more about some erotic Roman figures, a banking crisis from the ancient world and a lost medal is returned to its rightful owners. Comedian Vic Reeves says: &quot;Don't tell anyone, but I'm an absolute history geek. I keep a metal detector in the back of my car at all times. Happiness is snuffling around in a muddy field. Only I have never ever found anything exciting.&quot; Vic investigates an intriguing bronze helmet dug up near his home in Kent in 2012, discovered by retired plumber Trevor Baker and dating back to the first century AD. The helmet and a brooch are believed to be from a Late Iron Age cremation burial from near Canterbury.\n\n3)  Part 3 \nIn episode three, Bettany Hughes finds out more about a beautiful 18th century ring with a tragic story and Russell Grant explores horoscopes, Roman-style. In 2011, a metal-detecting husband and wife duo unearthed a foot-long bronze Capricorn figurine in Somerset. They'd chanced upon one of the rarest Roman finds in Britain, which provides us with a unique way to explore ancient astrology and horoscopes. It transpires that astrology played a vital part in the life of one famous Roman emperor. In 2005 in Shropshire, local enthusiast Tony Baker uncovered a beautiful and mysterious ring inscribed with the names Mary and Sarah and the year 1735. The ring proved to be an emotional reminder of an era when giving birth was an incredibly risky affair.\n\n4)  Part 4 \nIn episode four, Lewis star Kevin Whately discovers what music sounded like 3000 years ago and Bettany Hughes travels to Northern Ireland to find out more about an extraordinary Christian artefact called the Clonmore Shrine. Kevin Whately first visited Northern Ireland in the sixties when he hitchhiked around the country in a previous incarnation as a folk singer. Returning to his musical roots, Kevin discovers more about a set of 3000 year old Bronze Age horns which were found in a bog in County Antrim by a farm labourer in 1844. The horns were perfectly preserved in the bog and have been the cause of many arguments over the years on exactly how they should be played. Simon O'Dwyer and Maria Cullen O'Dwyer from County Gallway have exact replicas of the horns and their own method of playing the ancient instruments. In a special performance the pair recreate for Kevin what music would have sounded like 3000 years ago.\n\n5)  Part 5 \nIn episode five Bettany is captivated by a piece of jewellery that once belonged to Henry Stuart, son of King James I and John Prescott finds out more about politics in Roman times. Also this week historian Suzannah Lipscomb travels to Brentford, Essex where an Elizabethan pendant was discovered five years ago by carpenter George Sparks. George found the treasure on the grounds of Ingatestone Hall. Describing his find, he says: &quot;First of all I thought 'oh it's a piece of costume jewellery'. I could see it was gold colour with some stones in, but with it covered in mud you couldn't really tell. When I got back to my van there was a puddle there so I thought I'd dip it in there and washes it off with an old toothbrush then I could see the setting of the stones and that made me realise that it could be something that little bit special.&quot; His find was very special. The 400-year-old pendant is set with diamonds, a single red ruby and coloured enamel on the back and historians believe the pendant may have even belonged to Queen Elizabeth I herself.\n\n6)  Part 6 \nIn episode six, historian Suzannah Lipscomb finds out more about the Lindisfarne Hoard and Mariella Frostrup travels from Lancashire to Cologne on the trail of a massacred saint. In 1963, Alan Short found a pile of Elizabethan silver coins under a house in Lindisfarne. Although it was an exciting discovery, it was even more interesting when a second hoard was found in almost the same spot forty years later. In 2003, Richard Mason was helping to renovate his father's house when he found a jug buried in the ground. Richard said: &quot;I was hand digging around a pipe and I heard a clunk I thought that's strange so I dug around it and exposed a little jug. I pulled the jug out, it was covered in mud and clots I had a quick look inside it appeared empty - I chucked it in the back of the van and thought nothing more of it.&quot;\n\n7)  Part 7 \nIn this episode Bettany Hughes is in Scotland where she learns about a Â£1m gold hoard whilst Michael Buerk finds out more about Bronze Age transport. Michael Portillo pays a visit to Fort George near Inverness to learn about two treasure findings that highlight relationships between Scottish Highlanders and British soldiers. Frazer Hunter talks to pig farmer Hamish Stuart who was walking on one of his fields in Birnie when he discovered a coin glinting in the light. Excavators then discovered two hoards of Roman silver coins and some jewellery dating to the late 2nd century AD.\n\n8)  Part 8 \nIn Episode Eight Katherine Jenkins travels to Boverton in the Vale of Glamorgan to tell the story of a remarkable find of Iron Age jewellery. Bettany Hughes visits the Isle of Wight to meet the girl who uncovered a 5,000-year-old tool while on a school trip, and Mary-Ann Ochota dives for treasure at the site of the sunken HMS Colossus off the Isles of Scilly.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img822.imageshack.us/img822/4721/4l9kp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/img822/4721/4l9kp.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img163.imageshack.us/img163/4046/h4ha.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img163.imageshack.us/img163/4046/h4ha.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img14.imageshack.us/img14/4031/u7d2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img14.imageshack.us/img14/4031/u7d2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img42.imageshack.us/img42/170/hz4p.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img42.imageshack.us/img42/170/hz4p.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img577.imageshack.us/img577/882/mjv0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img577.imageshack.us/img577/882/mjv0.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img812.imageshack.us/img812/9356/fwqv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img812.imageshack.us/img812/9356/fwqv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img547.imageshack.us/img547/474/5vj8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img547.imageshack.us/img547/474/5vj8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img607.imageshack.us/img607/2026/796t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img607.imageshack.us/img607/2026/796t.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img203.imageshack.us/img203/9833/0wm4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img203.imageshack.us/img203/9833/0wm4.jpg&lt;/a&gt; \n\nTechnical Specs\n------------------------------\n\n\n * Video Codec: x264 CABAC &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;88c0e1efe0c8c4bca6b9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;\n * Video Bitrate: 2459 Kbps\n * Video Aspect Ratio: 1.778 (16:9)\n * Video Resolution: 1280x720\n * Audio Codec: AAC LC\n * Audio Bitrate: 160 Kbps ABR 48KHz\n * Audio Channels: Stereo 2\n * Run-Time: 23mins\n * Framerate: 25 FPS\n * Number of Parts: 8\n * Container Mp4\n * Part Size: 410 MB\n * Source: HDTV\n * Encoded by: Harry65\n\n\n\nLinks\n------------------------------\n\n1)  Further Information &lt;a href=&quot;\nhttp://www.telegraph.co.uk/culture/tvandradio/10086132/Bettany-Hughes-new-series-Britains-Secret-Homes-unearths-properties-around-the-country-with-a-story-to-tell.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.telegraph.co.uk/culture/tvandradio/10086132/Bettany-Hughes-new-series-Britains-Secret-Homes-unearths-properties-around-the-country-with-a-story-to-tell.html&lt;/a&gt;\n\n2)  Related Documentaries &lt;a href=&quot;\nhttp://docuwiki.net/?title=Britains%20Secret%20Treasures&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/?title=Britains%20Secret%20Treasures&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:9cc82992ad4cfd44bfeada6771150fb44b9b2a2f","amp;dn":"ITV+Britains+Secret+Treasures+Series+2+3of8+720p+x264+AAC+HDTV+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cc82992ad4cfd44bfeada6771150fb44b9b2a2f","infoHashBuffer":{"type":"Buffer","data":[156,200,41,146,173,76,253,68,191,234,218,103,113,21,15,180,75,155,42,47]},"announce":[],"urlList":[]}}