{"title":"Chicago - Will You Still Love Me","uid":4746263,"size":149950468,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9d5b58c3208af54b5332df202ffdbb8020116457&amp;dn=Chicago+-+Will+You+Still+Love+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1235902821,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Will You Still Love Me?&quot; is a song written by David Foster, Tom Keane and Richard Baskin for the group Chicago and recorded for their album Chicago 18 (1986). The second single released from that album, it reached #3 on the U.S. Billboard Hot 100 chart.\n\nThe song was Chicago's first Top Ten hit after the departure of Peter Cetera, and featured new singer and playing bassist, Jason Scheff on lead vocals.\n\nChicago 18 is the eighteenth album by American rock band Chicago and was released in 1986. As the successor to 1984's multiplatinum smash hit Chicago 17, this album marked a new era for Chicago: their post-Peter Cetera years.\n\nAfter Cetera quit the band for a solo career in 1985, Chicago eventually hired Jason Scheff, son of Jerry Scheff (who had backed up Elvis Presley for years), to replace Cetera's high register vocals and bass duties. In a twist of fate, Scheff was discovered after submitting a song demo for consideration on Cetera's second solo album. With Scheff's uncanny ability to replicate his predecessor, Chicago was able to continue. Although founding member Robert Lamm still took an active part in the band, the most used voices in Chicago now belonged to their two newest recruits: Scheff and Bill Champlin, who had joined the band in 1981.\n\nThe band decided on recording an updated high-tech remake of &quot;25 or 6 to 4&quot; (#48) but it failed to scale the charts, despite a slamming high-tech opening groove. Trombonist James Pankow is listed as a co-writer on the classic Lamm tune. Chicago then retreated safely back into ballad-mode, and the follow-ups &quot;Will You Still Love Me?&quot; (#3) and &quot;If She Would Have Been Faithful...&quot; (#17) became major hits. Newcomer Scheff was the singer on all three releases.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9d5b58c3208af54b5332df202ffdbb8020116457","amp;dn":"Chicago+-+Will+You+Still+Love+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d5b58c3208af54b5332df202ffdbb8020116457","infoHashBuffer":{"type":"Buffer","data":[157,91,88,195,32,138,245,75,83,50,223,32,47,253,187,128,32,17,100,87]},"announce":[],"urlList":[]}}