{"title":"Lassie.come.home-PAL-Audio.Eng+It+Spa+Multisubs-FLIpresentation","uid":4807190,"size":4428982272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a01b6e486d2bcb58be01fcf11a140bdba8d1d69c&amp;dn=Lassie.come.home-PAL-Audio.Eng%2BIt%2BSpa%2BMultisubs-FLIpresentation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaminer","files":33,"time":1238200046,"description":"Lassie come home - 1943 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0036098/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0036098/&lt;/a&gt;\n\nOriginal DVD full rip\nAudio - Eng+It+Spa \nSubs - Eng+Cro+Dan+Dut+Fin+It+Nor+Por+Spa+Swe\nPAL\n\nHard times came for Carraclough family and they are forced to sell their dog to the rich Duke of Rudling. However, Lassie, the dog, is unwilling to leave the young Carraclough boy and sets out on the long and dangerous journey in order to rejoin him. \n\nA magnificent British collie struggles to cover the hundreds of miles that separate her from the family she loves.\nLASSIE COME HOME is one of the truly great family films. Crafted with care by MGM and based on the classic novel by Eric Knight, it will strike a warm response in the heart of anyone who has ever loved a dog.\nThe production values are first rate and the color photography is spectacular. While the scenery &amp; filming locations are strictly Western North America, they nevertheless make evocative stand-ins for the settings in the book. It might be worth the viewer's time to check the relationship of the Yorkshire Moors with the Scottish Highlands on a map, so as to better appreciate the phenomenal journey which the dog undertakes.\nThe casting is excellent throughout: Donald Crisp, Elsa Lanchester &amp; Roddy McDowall as the poor, proud family which must sell their only treasure, Lassie; Nigel Bruce as the gruffly tenderhearted Duke which buys the dog; a young Dame Elizabeth Taylor plays his lively granddaughter. J. Pat O'Malley portrays the brutal dog handler employed by the Duke.\nAlong her journey Lassie encounters old folks who need her companionship (Dame May Whitty &amp; real-life husband Ben Webster, in his last film role), a traveling tinker who values her protection (Edmund Gwenn), and suspicious sheepmen on the watch for killer dogs (Alan Napier &amp; Arthur Shields).\nLassie is played by Pal, a male dog trained by the celebrated Rudd Weatherwax (1907-1985), who was responsible for generations of Lassies which appeared in movies &amp; television. Pal gives a remarkable performance, providing the very heart &amp; soul of the film. (from imdb.com reviewer)\n\n\n=================================================================================\n\nOn peut violer les lois sans qu'elles crient. (Talleyrand)","torrent":{"xt":"urn:btih:a01b6e486d2bcb58be01fcf11a140bdba8d1d69c","amp;dn":"Lassie.come.home-PAL-Audio.Eng%2BIt%2BSpa%2BMultisubs-FLIpresentation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a01b6e486d2bcb58be01fcf11a140bdba8d1d69c","infoHashBuffer":{"type":"Buffer","data":[160,27,110,72,109,43,203,88,190,1,252,241,26,20,11,219,168,209,214,156]},"announce":[],"urlList":[]}}