{"title":"Dionne Warwick - The Dionne Warwick Collection, Her All-Time Gre","uid":8431381,"size":432994831,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1957816e5db0cd653d781bc464db7939e309f48&amp;dn=Dionne+Warwick+-+The+Dionne+Warwick+Collection%2C+Her+All-Time+Gre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":31,"time":1367506390,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nDionne Warwick - The Dionne Warwick Collection, Her All-Time Greatest Hits (1989)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/419T7G31NDL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/419T7G31NDL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by William Ruhlmann):\n\nIt is easier to define Dionne Warwick by what she isn't rather than what she is. Although she grew up singing in church, she is not a gospel singer. Ella Fitzgerald and Sarah Vaughan are clear influences, but she is not a jazz singer. R&amp;B is also part of her background, but she is not really a soul singer, either, at least not in the sense that Aretha Franklin is. Sophisticated is a word often used to describe her musical approach and the music she sings, but she is not a singer of standards such as Lena Horne or Nancy Wilson. What is she, then? She is a pop singer of a sort that perhaps could only have emerged out of the Brill Building environment of post-Elvis Presley, pre-Beatles urban pop in the early '60s. That's when she hooked up with Burt Bacharach and Hal David, songwriters and producers who wrote their unusually complicated songs for her aching yet detached alto voice. Warwick is inescapably associated with those songs, even though she managed to build a career after leaving Bacharach and David that drew upon their style for other memorable recordings, such that she remains a unique figure in popular music.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/dionne-warwick-p3158/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/dionne-warwick-p3158/biography&lt;/a&gt;\n\nAll Music Album Review (by Steve Huey):\n\nRhino's The Dionne Warwick Collection: Her All-Time Greatest Hits is the best Warwick collection on the market, culling 24 tracks from her '60s prime. Although it doesn't cover her entire career, it does feature nearly all of her very best material, and it's all in the style that made her famous; top to bottom, it's a stronger, more consistent listen than anything else out there. This was the period when she established herself as the premier interpreter of Burt Bacharach's music, and pulled off the neat trick of appealing to both R&amp;B and easy listening audiences. Warwick was soulful without necessarily singing soul music per se; her smooth, light delivery and polished technique meshed very well with the sophisticated pop of the Bacharach/Hal David team, who co-composed all but one of the songs included here. No other singer navigated Bacharach's deceptively tricky compositions with such effortless grace; the ease she projects on the rhythmically complex &quot;I Say a Little Prayer&quot; and &quot;Promises, Promises&quot; is startling. It's no wonder her versions of Bacharach's songs often became the definitive ones. This compilation doesn't cover Warwick's later hits, like the Spinners' duet &quot;Then Came You,&quot; &quot;That's What Friends Are For,&quot; or her late-'70s/early-'80s adult contemporary fare; for those, look to Arista's The Definitive Collection, which touches on every phase of her career, or the more specific Greatest Hits (1979-1990). But for a sparkling demonstration of everything that made Warwick great, there's no better buy than The Dionne Warwick Collection.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-dionne-warwick-collection-her-all-time-greatest-hits-r59845/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-dionne-warwick-collection-her-all-time-greatest-hits-r59845/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000032WJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000032WJ&lt;/a&gt;\n\nTrack List:\n\n01. Don't Make Me Over\n02. This Empty Place\n03. Anyone Who Had A Heart\n04. Walk On By\n05. You'll Never Get To Heaven (If You Break My Heart)\n06. A House Is Not A Home\n07. Reach Out For Me\n08. Who Can I Turn To\n09. Looking With My Eyes\n10. Are You There (With Another Girl)\n11. Message To Michael\n12. Trains And Boats And Planes\n13. I Just Don't Know What To Do With Myself\n14. Another Night\n15. Alfie\n16. The Windows Of The World\n17. I Say A Little Prayer\n18. (Theme From) Valley Of The Dolls\n19. Do You Know The Way To San Jose\n20. (There's) Always Something There To Remind Me\n21. Promises, Promises\n22. The April Fools\n23. I'll Never Fall In Love Again\n24. The Green Grass Starts To Grow\n","torrent":{"xt":"urn:btih:a1957816e5db0cd653d781bc464db7939e309f48","amp;dn":"Dionne+Warwick+-+The+Dionne+Warwick+Collection%2C+Her+All-Time+Gre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1957816e5db0cd653d781bc464db7939e309f48","infoHashBuffer":{"type":"Buffer","data":[161,149,120,22,229,219,12,214,83,215,129,188,70,77,183,147,158,48,159,72]},"announce":[],"urlList":[]}}