{"title":"PANZER KILLER - ADDICTION !!!","uid":4394778,"size":155111311,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a204049861fdc0428b2bbf1127946f4f69d4ca4f&amp;dn=PANZER+KILLER+-+ADDICTION+%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"straelt","files":2,"time":1221372153,"description":"PANZER KILLER!\n\n\nTHE UNOFFICIAL SEQUEL TO TIGER HUNT, THE BATTLE FOR FRANCE CONTINUES...\n\nDrive, Shoot and Destroy!\n\nAs the Allied forces broke out of the Normandy beaches and the battle for France began, American tank crews soon came to realize what they were up against. To their dismay and horror, the American Sherman tank-crews quickly found out how inadequate and inferior their tanks were, especially against Germany&amp;#039;s late model tanks. They were drastically out-gunned and out-armored by the far superior German tanks.\n\nOn the positive side, the American tanks were faster, more maneuverable and far more reliable. The Allies had a greater number of tanks, very effective artillery and total air superiority. German columns were constantly harassed from the air as American Thunderbolts and British Typhoons rained horror upon them. These were some of the factors, along with the willingness of the American crews to take chances that initially avoided disaster.\n\nFight everything in the German arsenal including the most notorious and lethal tanks such as Tigers and Panthers. Battle through over 50 missions in this fast-paced arcade-style shooter. Drive and fight rival tanks, destroy enemy positions and engage in ferocious firefights.\n\nPANZER KILLER Features include\n\no Arcade-style shooter in historically accurate settings.\no Easy-to-use game controls gets you right into the action.\no Day and night fighting in different weather conditions.\no Unique and accurate characteristics for each tank and vehicle (blue print precise), with realistic physics and motions.\no Drive and fight with Sherman&amp;#039;s, Pershing&amp;#039;s, half-tracks and jeeps as well as captured enemy tanks.\no Realistic physics and motions with each tank and vehicle with unique and accurate characteristics.\no Call in air support to take out enemy targets.\no Drive and fight in captured enemy tanks.\no Realistic battle sounds and special effects.\no Exhilarating variety of missions and combat situations.\no Different types of ammo with different effects depending on the target.\no Over 50 action-packed missions.\no Built in cheat code keys.\n\no Realistic interrelations between ammunition type, armor thickness, distance and muzzle velocity.\no Full cause and effect with accumulative damage registration for true to life action.\no Different types of ammo for different use and with different effects on armor, vehicles and objects.\no Realistic and complete tank characteristics with armor assignments, fuel consumption, weight and speed.\no Totally immersive, realistic and accurate scenarios with realistic weapons deployment.\no Texture maps from real photos taken in Normandy France.\n\nSystem Requirements\nPentium 850 MHz (Pentium III 1.0 GHz recommended\nWindows 98/Me/2000/XP\n128 MB RAM\n320 MB Free Disk Space\nDirectX: DirectX version 9.0a or higher\n16 MB video card (32 MB video card with Hardware T&amp;L support recommended)*16-bit sound card*\n","torrent":{"xt":"urn:btih:a204049861fdc0428b2bbf1127946f4f69d4ca4f","amp;dn":"PANZER+KILLER+-+ADDICTION+%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a204049861fdc0428b2bbf1127946f4f69d4ca4f","infoHashBuffer":{"type":"Buffer","data":[162,4,4,152,97,253,192,66,139,43,191,17,39,148,111,79,105,212,202,79]},"announce":[],"urlList":[]}}