{"title":"Complete (DivX) 5.6GB Karaoke DJ Collection by Michael Rizzo","uid":5173782,"size":5994595328,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a30e16e303407321738a85e048e2fedf15fb1ec3&amp;dn=Complete+%28DivX%29+5.6GB+Karaoke+DJ+Collection+by+Michael+Rizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"mrizzo2","files":-1,"time":1258840612,"description":"Our 1100k bitrate new, improved 1500+ songs version Divx DJ collection is now available here: &lt;a href=&quot; http://thepiratebay.se/torrent/5374212&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5374212&lt;/a&gt;\n\n\n\n\n\n\nThis too is a somewaht complete Karaoke collection in great DivX format, all\nready to go for your disc player, laptop computer or portable DivX device\n(some ipod sized devices will accomodate this complete collection and allow\nyou to connect to a huge enough screen and amp system at a local pub etc even,\nto set up your roadshow as a Karaoke DJ in your own right)! &lt;a href=&quot;\nhttp://bayimg.com/bAeoiaAcp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/bAeoiaAcp&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/fAejcAACP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/fAejcAACP&lt;/a&gt;\n\nThe resolution is not the best as you will get from our CD+G format files\ninstead. We do give it the full 128K audio bitrate however the video is set at\nthe familiar also industry standard of 352 X 240 instead. See here for comments\non this video resolution format:\nhttp://club.myce.com/f34/recording-resolutions-flim-flam-146738/\n\nYou might need to use the &quot;zoom&quot; feature on your divx player for fullscreen\nmode, if need be.\n\nIf you downlod the CD+G format files instead, you could also download our\nposted CD G to AVI converter torrent to create these DivX files yourself.\nIf you try for higher video rolution, however, the conversion will take ages\nto accomplish with this software Im afraid, and its the best we know of for\nthe job.\n\nYou could always try one song first as a sampler!\n\nWe have all you could want for a comprehensive enough selection:\n\nPopular\nCountry\nStandards+Christian\nIrish/Scottish\nDisco\n70's\nOldies\nMotown\nFolk\n\nSamplings from the greatest and universally known hits:\nItalian\nSpanish\nFrench\nGerman\n\nThe world is going to the dogs with the invasion of rap music\ntastes taking over tha airwaves. Its time to reverse this treand and this\nis how we do it. Set yourself up at a Bar, Church basement, Army base,\nold folks home, Hospital or wherever!\n\nMake this world a better place. Many of the renditions enclosed\nare out of print as the publishers have gone out of business Im\nafraid to say. Oh well, finders keepers. in any event we help promote\nan industry that is in ill health without our efforts to keep it\npropped up with exposure that comes from getting the folks into the\nmood.\n\nStart this weekend and make yourrself a star! An American Shure microphone\nwith a German engineered Behringer ACX1800 amp would give you a great start\nin the business for a travelling roadshow for smaller gatherings perhaps!\nJust a few hundred bucks for this equipment on ebay or your local retailer etc.\n\nMichael Rizzo Chessman\nmoviesbyrizzo.info (email me there if you run into questions along the way)","torrent":{"xt":"urn:btih:a30e16e303407321738a85e048e2fedf15fb1ec3","amp;dn":"Complete+%28DivX%29+5.6GB+Karaoke+DJ+Collection+by+Michael+Rizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a30e16e303407321738a85e048e2fedf15fb1ec3","infoHashBuffer":{"type":"Buffer","data":[163,14,22,227,3,64,115,33,115,138,133,224,72,226,254,223,21,251,30,195]},"announce":[],"urlList":[]}}