{"title":"Zeitgeist Addendum DvDRip - TokeUp","uid":5376793,"size":579431151,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a86cf5640618c268fe2aa731654cb53cbf353f30&amp;dn=Zeitgeist+Addendum+DvDRip+-+TokeUp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TokeUp","files":2,"time":1266597004,"description":"Zeitgeist: Addendum (2008)   (Watch Zeitgeist Final Edition Before Watching This!)\n\n\n&quot;Everyone should watch this movie. Everyone. That's the point of the movie. Share it. Everyone must know what's going on. And on the difference from the 1st one, this one doesn't try to make you think we leave in a conspiracy, this one explains you what kind of conspiracy we are all in at the moment. The money-conspiracy. And no one can tell they are wrong, because they just explain the system we live in, with simple words. And it makes it much easier for anyone to understand it. This gives anger and hate against the system but also hope and motivation. If everyone sees it, maybe we got a chance to change something.&quot; - (krebssebastien) from United Kingdom &lt;imdb&gt;\n\n\n\n&quot;Everyone should watch this movie. In all countries the law is to protect the shareholders of BIG companies, the political elite and the rich few. It was an eyeopener for me and also for my friends thats seen it. It shows the American way. in its real lights. Paranoia. Words like top secret, classified, need to know basis, and so on, are used too often and only for the benefit of the big business, and corrupt leaders. Maybe there will be some change with the new president, but I doubt it, and I think it will &quot;same same but different&quot;, as usual. The leaders of yesterday has left too many unanswered questions. As said &quot;Watch &amp; decide for yourself&quot;. \n\nIll be waiting for the next movie, if and when it comes.&quot; - tor-66 from Sweden &lt;imdb&gt;\n\n\n\n\n\nThis is not just a movie.... The Zeitgeist is now one of the most rapidly spreading activist movements in the World!\n\n\nCheck These links for more details on the Zeitgeist Movement:\n\n &lt;a href=&quot;\thttp://www.thezeitgeistmovement.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.thezeitgeistmovement.com/&lt;/a&gt;\n &lt;a href=&quot;\thttp://en.wikipedia.org/wiki/The_Zeitgeist_Movement&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://en.wikipedia.org/wiki/The_Zeitgeist_Movement&lt;/a&gt;\n\n\nWe can all participate for the cause and make a better tomorrow!\n\n\n\nBoth 'Zeitgeist, The Movie' and 'Zeitgeist: Addendum' were created as Not-for-Profit expressions\nto communicate what the author felt were highly important social understandings which\nmost humans are generally not aware of. The first film focuses on suppressed\nhistorical &amp; modern information about currently dominant social institutions, while\nalso exploring what could be in store for humanity if the power structures at large continue\ntheir patterns of self-interest, corruption, and consolidation.\n\nThe second film, Zeitgeist: Addendum, attempts to locate the root causes\nof this pervasive social corruption, while offering a solution. This solution is not\nbased on politics, morality, laws, or any other &quot;establishment&quot; notions of human affairs,\nbut rather on a modern, non-superstitious based understanding of what we are\nand how we align with nature, to which we are a part. The work advocates\na new social system which is updated to present day knowledge, highly influenced\nby the life long work of Jacque Fresco and The Venus Project. \n\n\n\nSo feel free to distribute this movie as much as you like! There Ain't no Unkle Sam gonna stop you for it!...\n\n\nEnjoy n Please keep Seeding.... :)\n\n-----------------------------------------------------------------------------------\n\n\nTokeUp","torrent":{"xt":"urn:btih:a86cf5640618c268fe2aa731654cb53cbf353f30","amp;dn":"Zeitgeist+Addendum+DvDRip+-+TokeUp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a86cf5640618c268fe2aa731654cb53cbf353f30","infoHashBuffer":{"type":"Buffer","data":[168,108,245,100,6,24,194,104,254,42,167,49,101,76,181,60,191,53,63,48]},"announce":[],"urlList":[]}}