{"title":"[Kung Fu] The Chieh Boxing Master aka The Chinese Stuntman (Bruc","uid":3822615,"size":377137173,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a97c4d2f0276db0f4bb8b85d0d000e3f93aec40f&amp;dn=%5BKung+Fu%5D+The+Chieh+Boxing+Master+aka+The+Chinese+Stuntman+%28Bruc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JamesKees","files":6,"time":1191001859,"description":"The Chieh Boxing Master aka The Chinese Stuntman (Bruce Li, 1981)\n\nHKFlix Says:  \t4 Stars\n\nThe plot is all over the place, but the fights are high-quality and high-quantity. A very pleasant surprise indeed!\n\nAvg. Rating: \t\n  4.3 / 5 (based on 10 ratings).\n\nPlot:\tBruce Li plays a kung fu expert who--after a series of complicated events--becomes a stuntman for a famous kung fu actor. He soon learns that the film&amp;#039;s producers are trying to kill him, so they can cash in on his insurance policy.\n\nOverview:\tThis classic Bruce Li (Ho Chung Tao) adventure is one of the most sought-after by fans because of its outstanding martial arts cast, especially the rare appearance of the great Dan Inosanto, Bruce Lee&amp;#039;s best friend and only fully authorized instructor of Jeet Kune Do. Also starring martial arts action star John Ladalski (&quot;Armor Of God&quot;) plus a guest appearance of the late Wei Ping Ao (Ngai Ping Ngo), well known for his roles in Bruce Lee&amp;#039;s &quot;Fist Of Fury&quot; and &quot;Way Of The Dragon&quot;. This is a must-have movie.\n\n&quot;Chinese Stuntman&quot; (AKA &quot;Counter Attack&quot;) sees an American student, John (Ladalski), travel to Hong Kong to improve his martial arts skills. He walks in a training room and starts to fight anyone who claims to be an expert, but is stopped by Tang Wei (Ho Chung Tao), and the proceeding fight convinces him that he has found his teacher. When Wei gets a job with an insurance company, he discovers his boss is involved in a scam to insure a famous film star, by his unscrupulous producer (Wei Ping Ao). The plan is to murder the film star, Shung Lung, and collect the insurance money needed to save his ailing company. After a series of stunts go dangerously wrong, Wei is assigned to stunt double the star and look into these accidents. The producer reacts with explosive violence and unleashes the fury of his kung fu stunt fighting team.\n\nInosanto plays one of the &quot;Gung Fu Directors&quot; set to bring down the pair and the inevitable Inosanto and Ladalski &quot;Kali/Escrima&quot; stick fighting duel captures rare footage of Inosanto in action. The Ho Chung Tao-versus-Inosanto in a staff-versus-sticks match is magical. These scenes are released uncut for the first time [in the UK] in over two decades.\n\nOverall, this is one of the best Bruce Li adventures featuring fight sequences with Guru Inosanto, and makes this movie a time capsule for martial artists and fighting film fans which they should not be without.\n\nCast: \tBruce Li (Ho Chung Tao)  ||  Sze Ma Lung  ||  John Ladalski  ||  Ngai Ping Ngo  ||  Peng Kong  ||  Chiu Ting  ||  Cheung Wan Man  ||  Kong Yeung  ||  Dan Inosanto  ||  Liu Hok Ming \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.534523/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.534523/qx/details.htm&lt;/a&gt;\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:a97c4d2f0276db0f4bb8b85d0d000e3f93aec40f","amp;dn":"%5BKung+Fu%5D+The+Chieh+Boxing+Master+aka+The+Chinese+Stuntman+%28Bruc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a97c4d2f0276db0f4bb8b85d0d000e3f93aec40f","infoHashBuffer":{"type":"Buffer","data":[169,124,77,47,2,118,219,15,75,184,184,93,13,0,14,63,147,174,196,15]},"announce":[],"urlList":[]}}