{"title":"Dragonball KAI - Episode 001 HD - (20 years DBZ)","uid":4847637,"size":182359912,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:aa3a6ecbfbfdaecc23325db7674f36563612c314&amp;dn=Dragonball+KAI+-+Episode+001+HD+-+%2820+years+DBZ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rumml","files":1,"time":1239744798,"description":"AIRED ON 5th of April on FujiTV, japan!\nDUB=japan, SUB=english\n\n\n\nDragon Ball Kai is an upcoming anime series that is set to be an HD Remaster and Recut of Dragon Ball Z done for its 20th Anniversary. It premiered on Fuji TV on April 5th 2009 at 9:00am just before One Piece, and the two shows are being marketed together as 'Dream 9', which refers to the hour in which they both air. Little is known about the series, however two Issues of Shounen JUMP have included some primary information about it.\n\n    * The series is being extensively &quot;refreshed&quot; for Japanese TV.\n    * It's being done in celebration of Dragon Ball Z's 20th anniversary.\n    * It is not new animation, but simply a remastering of the original film.\n    * Part of this will be reformatting and extending the picture to 16:9 Widescreen. \n\n        * Note: The Jump image says it will not be a cropping of the series, at least not completely. \n\n    * A complete re-recording of the dialog by most of the original Japanese voice cast.\n    * Completely new sound design with updated sound effects.\n    * The opening and ending themes are completely new, having nothing to do with the original themes.\n    * Reports have stated that the series will be cut down from 291 episodes to approximately 100, but these rumors are unsubstantiated.\n          o A report in V Jump asserts that the episodes would be edited to more closely follow the manga, resulting in a faster moving story, and to remove any damaged frames. This may indicate that Dragon Ball Kai will minimize the filler material produced for Dragon Ball Z's original production run, and may also account for the rumored drastic drop in episode count for the reworked series. \n    * &quot;Kai&quot; starts from the invasion of the Saiyans. This version will be re-edited to hew more closely to Akira Toriyama's original story, so the story's development will progress all the faster.\n    * Takayoshi Tanimoto performs the series' new opening and closing themes, &quot;Dragon Soul&quot; and &quot;Yeah! Break! Care Break!&quot;.\n    * Through digital processing, the image will be made vibrant. All the grime, damage and noise remaining on the &quot;Z&quot; film will be removed, making the image much clearer in HD.\n    * Toei Animation confirmed DBK's story will be edited to fit closer to the Manga. [2]","torrent":{"xt":"urn:btih:aa3a6ecbfbfdaecc23325db7674f36563612c314","amp;dn":"Dragonball+KAI+-+Episode+001+HD+-+%2820+years+DBZ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa3a6ecbfbfdaecc23325db7674f36563612c314","infoHashBuffer":{"type":"Buffer","data":[170,58,110,203,251,253,174,204,35,50,93,183,103,79,54,86,54,18,195,20]},"announce":[],"urlList":[]}}