{"title":"CAMP_ROCK[Dvdr][Multi].ISO","uid":4498452,"size":4649768960,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:aa702da1ef4de0db1c274880d3767f368c3029a2&amp;dn=CAMP_ROCK%5BDvdr%5D%5BMulti%5D.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"webchella","files":1,"time":1226296344,"description":"Camp Rock (2008) \n\n\nDVDR \n\n\n\nComparte zonatorrent\nIdioma: MULTI\n\nDirector:\nMatthew Diamond\nWriters (WGA):\nKarin Gist (written by) &amp;\nRegina Y. Hicks (written by) ...\nmore\nRelease Date:\n20 June 2008 (USA)\nComedia\n\nCamp Rock es una Disney Channel Original Movie del 2008. La mÃƒÂºsica estÃƒÂ¡ escrita por Julie Brown, Paul Brown, Regina Hicks y Karen Gist. La pelÃƒÂ­cula estÃƒÂ¡ dirigida por Matthew Diamond y producida por Alan Sacks.1 El estreno del filme en Disney Channel Estados Unidos se realizÃƒÂ³ el 20 de junio de 2008, junto con una programaciÃƒÂ³n especial. En LatinoamÃƒÂ©rica la pelÃƒÂ­cula se estrenarÃƒÂ¡ el 6 de julio de 2008 , mientras que en EspaÃƒÂ±a estrenarÃƒÂ­a el 20 de septiembre del mismo aÃƒÂ±o.3 Camp Rock fue el segundo DCOM al aire en ABC, el maravilloso mundo de Disney despuÃƒÂ©s de su estreno en Disney Channel, y serÃƒÂ¡ la primera DCOM al aire en ABC Family y estarÃƒÂ¡ disponible en lÃƒÂ­nea despuÃƒÂ©s de su estreno en Disney Channel. Las estrellas adolescentes de cine y sensaciones del pop Jonas Brothers y Demi Lovato tuvieron su primer papel principal en una pelÃƒÂ­cula. La pelÃƒÂ­cula promediÃƒÂ³ de 8,9 millones de televidentes en la noche de su estreno, por lo que es la segunda mÃƒÂ¡s alta calificaciÃƒÂ³n de una PelÃƒÂ­cula Original Disney Channel despuÃƒÂ©s de High School Musical 2\n\nCamp Rock cuenta la historia Cenicienta rock nÃ‚Â´ roll de Mitchie Torres (Demi Lovato), una adolescente con una extraordinaria voz que maneja la ambicion de ser una cantante pop y que quiere pasar el verano en un prestigioso campamento de rock. Desafortunadamente, un caro campamento de rock es un poco mas de lo que su familia puede alcanzar, pero su madre obtiene un trabajo como cocinera en el campamento, asi que Mitchie puede ir, siempre y cuando ayude con la cocina entre clase y clase. Ella se vuelve amiga de la miembro del campamento, Caitlyn (Alyson Stoner), pero es intimidada por la muy talentosa Tess Tyler (Meaghan Jette Martin) y sus amigas, Peggy (Jasmine Richards) y Ella (Anna Maria Perez de Tagle). Y claro no olviden al chico del que ella se termina enamorando el principe de la historia (Joe Jonas) que en la historia lleva el nombre de Shane Gray y todos saben que lo mejor de la pelicula va a ser la fantastica aparicion de los Jonas Brothers. ","torrent":{"xt":"urn:btih:aa702da1ef4de0db1c274880d3767f368c3029a2","amp;dn":"CAMP_ROCK%5BDvdr%5D%5BMulti%5D.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa702da1ef4de0db1c274880d3767f368c3029a2","infoHashBuffer":{"type":"Buffer","data":[170,112,45,161,239,77,224,219,28,39,72,128,211,118,127,54,140,48,41,162]},"announce":[],"urlList":[]}}