{"title":"The Source: Unleash Your Natural Energy, Power Up Your Health, a","uid":6158356,"size":45986230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad100bea642833873720003a4b8102cdf0fd2404&amp;dn=The+Source%3A+Unleash+Your+Natural+Energy%2C+Power+Up+Your+Health%2C+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MANTESH","files":3,"time":1297119826,"description":" &lt;a href=&quot;http://img227.imageshack.us/img227/1743/1416568166.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img227.imageshack.us/img227/1743/1416568166.jpg&lt;/a&gt;\n\n\n\n\n\n\nThe Source: Unleash Your Natural Energy, Power Up Your Health, and Feel 10 Years Younger by Woodson Merrell\n\n\nFree Press | \nWoodson Merrell\nENGLISH\nISBN: 1416568166 \n2008\n400 pages\nPDF \n43.8  MB\n\n\n\n&quot;Why do I feel so tired and drained?&quot; You're not alone if you're constantly asking yourself this question. Exhaustion is epidemic in America and &quot;lack of energy&quot; one of the top five complaints to doctors nationwide. This is because vast numbers of people have lost their connection with the inner energy that is the source of healing and radiant vitality.\n\nBut now Dr. Woodson Merrell shows us that it doesn't have to be this way. One of the nation's preeminent integrative medicine specialists, Dr. Merrell tackles this problem head on with his long-awaited first book, offering a way to break the fatigue cycle and achieve the abundant energy that leads to true health. Here is his uplifting, proven program -- a breakthrough, six-step, 21-Day Plan for how you can become an &quot;energy creator&quot; rather than an &quot;energy consumer.&quot;\n\nThe Source is the most comprehensive, authoritative, and cutting-edge health guide available on how to power up your energy, your health, and your life. In his more than twenty years of medical practice, Dr. Merrell has discovered core concepts about energy that draw on both Western and Eastern medical knowledge and healing practices. His plan has helped to transform thousands of people's lives physically, mentally, and spiritually to allow them to feel better than ever before. With myriad paths to energy and wellness, Dr. Merrell's plan gives you all the tools you need -- including relaxation practices, a sustainable exercise program, a protocol for detoxifying your body, and organic menus and recipes for each day of the 21-Day Plan.\n\nDr. Merrell is among the first physicians to give a blueprint for energy generation, providing an accessible, clear solution for living, looking, and feeling better. As you undertake his program, you will tap into &quot;The Source&quot; of life's essential force -- energy -- and increase yours as you experience incredible changes in mind, body, and spirit. You will power up your body and wake up to life.............\n\n\n\n","torrent":{"xt":"urn:btih:ad100bea642833873720003a4b8102cdf0fd2404","amp;dn":"The+Source%3A+Unleash+Your+Natural+Energy%2C+Power+Up+Your+Health%2C+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad100bea642833873720003a4b8102cdf0fd2404","infoHashBuffer":{"type":"Buffer","data":[173,16,11,234,100,40,51,135,55,32,0,58,75,129,2,205,240,253,36,4]},"announce":[],"urlList":[]}}