{"title":"Crouching Tiger, Hidden Dragon(2000)DVDRip.AC3(ENG)-DROCK","uid":6200853,"size":733142525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad178aba8108ece3635c2486a5b4ef8136b097cf&amp;dn=Crouching+Tiger%2C+Hidden+Dragon%282000%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drock232","files":-1,"time":1298610533,"description":"Taiwanese filmmaker Ang Lee took a break from making Western period dramas to fashion this wild and woolly martial arts spectacular featuring special effects and action sequences courtesy of the choreographer of The Matrix (1999), Yuen Woo Ping. In the early 19th century, martial arts master Li Mu Bai (Chow Yun-Fat) is about to retire and enter a life of meditation, though he quietly longs to avenge the death of his master, who was killed by Jade Fox (Cheng Pei-pei). He gives his sword, a fabled 400-year-old weapon known as Green Destiny, to his friend, fellow martial arts wizard and secret love Yu Shu Lien (Michelle Yeoh), so that she may deliver it to Sir Te (Sihung Lung). Upon arrival in Peking, Yu happens upon Jen (Zhang Ziyi), a vivacious, willful politician's daughter. That night, a mysterious masked thief swipes Green Destiny, with Yu in hot pursuit -- resulting in the first of several martial arts action set pieces during the film. Li arrives in Beijing and eventually discovers that Jen is not only the masked thief but is also in cahoots with the evil Jade. In spite of this, Li sees great talent in Jen as a fighter and offers to school her in the finer points of martial arts and selflessness, an offer that Jen promptly rebukes. This film was first screened to much acclaim at the 2000 Cannes, Toronto, and New York film festivals and became a favorite when Academy Awards nominations were announced in 2001: Tiger snagged ten nods and later secured four wins for Best Cinematography, Score, Art Direction, and Foreign Language Film. \n\nRipped with Handbrake.\n\nLength: 2 Hours\n\nFile Type: AVI","torrent":{"xt":"urn:btih:ad178aba8108ece3635c2486a5b4ef8136b097cf","amp;dn":"Crouching+Tiger%2C+Hidden+Dragon%282000%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad178aba8108ece3635c2486a5b4ef8136b097cf","infoHashBuffer":{"type":"Buffer","data":[173,23,138,186,129,8,236,227,99,92,36,134,165,180,239,129,54,176,151,207]},"announce":[],"urlList":[]}}