{"title":"Dream Theater - Wither   (2nafish)","uid":5264663,"size":196521988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aebcc0f8462e60e3eb67a1b661e2e92220ea458d&amp;dn=Dream+Theater+-+Wither+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1262854054,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBlack Clouds &amp; Silver Linings is the tenth studio album of the progressive metal band Dream Theater. It was released on June 23, 2009 under Roadrunner Records. The album was produced by drummer Mike Portnoy and guitarist John Petrucci, and mixed by Paul Northfield. The album was released as a single CD, 3-disc Special Edition with instrumental mixes and cover songs, double vinyl LP, as well as a Deluxe Collector's Edition Box Set. The cover songs were revealed one per week during the six week period prior to the album's release, beginning on May 19, 2009.\n\nDream Theater began work on the album in October 2008. Mike Portnoy described Black Clouds &amp; Silver Linings as, &quot;a Dream Theater album with &quot;A Change of Seasons&quot;, &quot;Octavarium&quot;, &quot;Learning to Live&quot;, &quot;Pull Me Under&quot; and &quot;The Glass Prison&quot; all on one album.&quot; Jordan Rudess later explained, &quot;We've been entering into the Gothic domain quite a bit on this album.&quot;\n\nThe album's lyrics were written by John Petrucci and Mike Portnoy, and all except one concern personal experiences about disturbing or difficult moments of their lives. Petrucci wrote &quot;A Nightmare to Remember&quot; about a car accident he was involved in as a child, &quot;The Count of Tuscany&quot; about an actual encounter he had in Tuscany, and &quot;Wither&quot; about the process of songwriting for him. &quot;The Best of Times&quot; was written by Mike Portnoy about his father, who died from cancer. &quot;I just wanted to write something that was a tribute to our life together,&quot; said Portnoy, who played the song for his father prior to his death. &quot;The Shattered Fortress&quot; is the final part of Portnoy's Twelve-step Suite, reprising and concluding themes and motifs from the suite that began on 2002's &quot;Six Degrees of Inner Turbulence&quot; album. The remaining song, &quot;A Rite of Passage&quot;, concerns Freemasonry; a video of the edited single was released on May 8, 2009.\n\n&quot;Wither&quot; was released as a single on September 15, 2009. In addition to the album version of the song, the single contained an alternate version featuring only a piano and vocals, a demo version with John Petrucci on vocals, and a demo version of &quot;The Best of Times&quot; with Mike Portnoy on vocals. There was also a video to follow it which was released on November 18, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:aebcc0f8462e60e3eb67a1b661e2e92220ea458d","amp;dn":"Dream+Theater+-+Wither+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebcc0f8462e60e3eb67a1b661e2e92220ea458d","infoHashBuffer":{"type":"Buffer","data":[174,188,192,248,70,46,96,227,235,103,161,182,97,226,233,34,32,234,69,141]},"announce":[],"urlList":[]}}