{"title":"Encyclopedia of Management","uid":4962072,"size":7273710,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afc06dc89018ae8cd8a065f3177cb07d4e04d5dc&amp;dn=Encyclopedia+of+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245356920,"description":"This specialized desktop-style encyclopedia contains more than 300 essays covering management topics such as Angels and venture capitalists, Franchising, Japanese management, Outsourcing and offshoring, and Zero sum game. Arrangement is alphabetical, but so the volume may be used as a textbook as well as a ready-reference source, a &quot;Guide to Functional-Area Readings&quot; arranges entries into 18 curriculum-related topic areas such as &quot;Emerging Topics in Management,&quot; &quot;Leadership,&quot; and &quot;Management Information Systems.&quot;\n\nThe previous edition of Encyclopedia of Management was published in 2000. Contributors to this collection are predominately scholars, practitioners, doctoral students, librarians, and professional business writers. The editor and advisory board selected topics in an attempt to &quot;represent an authoritative treatment of the entire field of management, encompassing all the current theories and functional areas of this vast and growing discipline.&quot;\n\nThe Diversification strategy and Marketing concept and philosophy essays serve well as examples of the encyclopedia's writing style and focus. The former essay is relatively long, running to eight columns of tightly packed text. It begins with an explanation of diversification in the context of growth strategies and works its way through concentric diversification, conglomerate diversification, diversification strategies, and vertical versus horizontal diversification. Main sections and subsections are separated by eye-friendly areas of white space. The writing style is straightforward and should present no difficulty to beginners or casual browsers. The marketing essay is of the shorter variety and provides more of a summary than an in-depth treatment of its subject. The inclusion of anecdotal examples makes it a pleasure to read. All entries conclude with further reading lists, and the text is complemented by tables, graphs, and other figures.\n\nAt $290 for one volume, Encyclopedia of Management is a pretty uptown purchase to consider. Small libraries with limited money to spend will want to make sure they do not already own other management sources that, in aggregate, cover this material. Larger libraries may decide it's worth the cost to have at least one solid, comprehensive print-format source on the reference shelf.","torrent":{"xt":"urn:btih:afc06dc89018ae8cd8a065f3177cb07d4e04d5dc","amp;dn":"Encyclopedia+of+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afc06dc89018ae8cd8a065f3177cb07d4e04d5dc","infoHashBuffer":{"type":"Buffer","data":[175,192,109,200,144,24,174,140,216,160,101,243,23,124,176,125,78,4,213,220]},"announce":[],"urlList":[]}}