{"title":"DVDFab Platinumv8.0.8.6 Beta BBB Carter67 ","uid":6309913,"size":19601187,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b07cc6a0558d34a944903a7759e5261fab7b1bae&amp;dn=DVDFab+Platinumv8.0.8.6+Beta+BBB+Carter67+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"carter67","files":-1,"time":1302500682,"description":" &lt;a href=&quot;http://bayimg.com/pAhhaaAdi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/pAhhaaAdi&lt;/a&gt;\n\nDVDFab Platinum 8.0.8.6 Beta (QT)\nPatch by Team BBB\n\nInstalled, Tested and Working on Win 7 - 7600 RTM x64\n\nBig thanks to DM999\n\nWhy QT?\n1. We can have some advanced UI effects like skins and animations in future versions.\n2. We have moved an important step to the Mac version.\n\nPlease help us to try it if you like to do beta testing, thank you very much!\n\nTo report problem of this version, please start your own thread at specific sub-forum, with 8086Qt in prefix or title, thanks.\n\n\nDVDFab is the most powerful and flexible DVD copying/burning software.\nWith 8 copy modes, you can back up any DVD to DVDR in just a few clicks.\nDVDFab is brand new, is completely rewritten, is based on more than 8 years of DVD copy software development.\nDVDFab is simply the easiest way to copy a DVD movie. Just insert the movie and a blank DVD then press Start.\nYour entire movie - including menus, trailers and special features - is copied to a single DVD with just one click, and everything happens automatically.\nBackup your entire DVD - including menus, trailers, and special features - onto one or multiple discs.\n\nDVDFab includes: \\&quot;DVD to DVD\\&quot;, \\&quot;Blu-ray to Blu-ray\\&quot;, \\&quot;DVD to Mobile\\&quot;, \\&quot;File to Mobile\\&quot; and \\&quot;File Mover\\&quot;.\nDVDFab \\&quot;DVD to DVD\\&quot; is the most powerful and flexible DVD copying/burning software.\nWith 8 copy modes, you can backup any DVD to DVDR or hard drive in just one or a few clicks.\nDVDFab \\&quot;Blu-ray to Blu-ray\\&quot; is the first full-featured Blu-ray copying/burning software.\nWith 4 copy modes, you can backup Blu-ray to BD-R or hard drive in just one or a few clicks.\nDVDFab \\&quot;DVD to Mobile\\&quot; converts DVD title to AVI/MP4/WMV/MKV files which can be played on mobile devices like iPod, PSP, ZUNE, cell phone, etc.\nDVDFab \\&quot;File to Mobile\\&quot; converts source video file on your PC to next generation console like PS3 and Xbox 360,\nor mobile devices like iPod, PSP, ZUNE, cell phone, etc.\nDVDFab \\&quot;File Mover\\&quot; option transfers converted files to mobile devices like iPod, PSP, ZUNE, etc.\n\nChanges:\nDVDFab 8.0.8.6 Beta (April 1, 2011)\n\nNew: Rewritten user interface with Qt.\nNew: Changed language files to Qt format.\nNew: Some minor changes and improvements.\n\nBlu-ray Copy:\nNew: Added support for ATI Stream acceleration technology.\nNote: Please update AMD Radeon video card drivers first.\n1. Visit http://sites.amd.com/US/GAME/DOWNLOA...downloads.aspx\n2. Download both \\&quot;Catalyst Software Suite\\&quot; and \\&quot;AMD Media Codec Package\\&quot; (Optional Downloads).\nCurrently the ATI Stream support is limited to H.264 and VC1 video decoding. It\\'s the problem of AMD driver, and we need to wait for driver updates to support more features like MPEG2 video decoding and H.264 encoding. Also the decoding speed of ATI Stream is not very faster than DXVA, but it should be more stable than DXVA.\nFix: A problem that output size is too small when compressing certain discs like \\&quot;The Social Network\\&quot; to BD25.\nFix: A problem that 2D copy of Blu-ray 3D disc cannot be played on certain players like PS3.\n\nBlu-ray Ripper:\nNew: Added support for ATI Stream acceleration technology.\nFix: A crash problem when converting certain discs like \\&quot;Robin Hood\\&quot;.\n\nBlu-ray to DVD Converter:\nNew: Added support for multiple audio stream selection.\nFix: A video quality problem caused by the new VBR encoding.\n\nVideo Converter:\nFix: Several problems when rendering external subtitle.\n\nInstallation Notes:\n1. UnRar, Install And Then CLOSE DVDFab\n2. Copy Patch from Patch Folder to Installation Folder (C:\\\\Program Files\\\\DVDFab 8)\n3. Run Patch as Administrator, Choose DVDFab and Type in a new Reg Name, Then Click on the [P]\n4. Exit Patch and Start DVDFab Platinum\nEnjoy !!!\nDO NOT UPDATE THIS PROGRAM\n(Disable Automatic Updates under Settings ... General)\n","torrent":{"xt":"urn:btih:b07cc6a0558d34a944903a7759e5261fab7b1bae","amp;dn":"DVDFab+Platinumv8.0.8.6+Beta+BBB+Carter67+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b07cc6a0558d34a944903a7759e5261fab7b1bae","infoHashBuffer":{"type":"Buffer","data":[176,124,198,160,85,141,52,169,68,144,58,119,89,229,38,31,171,123,27,174]},"announce":[],"urlList":[]}}