{"title":"Svenska Hemligheter Part 7, 2010","uid":5956373,"size":185478234,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b28ca063d72e468a80ab268db5eaa7c62791e363&amp;dn=Svenska+Hemligheter+Part+7%2C+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bughunter68","files":1,"time":1289733540,"description":"Seventh episode of the swedish TV show Svenska Hemligheter.\nBroadcasted on the 13/11 2010 in SVT 1.\n\n----------------\nNar bomberna faller. Det finns 65 000 skyddsrum runt om landet. Sverige ar ett av de varldsledande landerna pa att skydda sin befolkning i handelse av att samhallet hotas pa nagot satt. Med generosa bidrag och lagstiftning finns det nagot eller flera skyddsrum i de flesta stadskvarter runt om i landet.\nI Stockholms underjord, nere i tunnelbanan, finns manga hemligheter. Men det ar fa som kanner till att det ocksa finns ett system av skyddsrum dar nere. Trots att vi som medborgare borde veta det. Ofta ligger skyddsrum av olika storlekar i narhet av tunnelbanestationernas plattformar. De ar forberedda for att ta emot upp till 800 skyddssokande personer. Aven plattformarna ska kunna skydda stadens befolkning. Fasten, anordningar och forberedelser for splitterskydd, telefoner och vattenforsorjning hittar man om man vet var man ska leta. Men det mest gripande Melker Becker hittar ar sjalva verktygsupplaget i skyddsrummet. Det bestar av helt ny materiel sasom spadar, tanger, verktygslador och spett uppdelade i fyra lika stora hagar. En paminnelse om vad rummen ar forberedda for, vad som faktiskt kan intraffa aven om det kanns avlagset idag. Svenska hemligheter handlar om var vi ska overleva eventuella terrorattacker och krig.\n----------------\n","torrent":{"xt":"urn:btih:b28ca063d72e468a80ab268db5eaa7c62791e363","amp;dn":"Svenska+Hemligheter+Part+7%2C+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28ca063d72e468a80ab268db5eaa7c62791e363","infoHashBuffer":{"type":"Buffer","data":[178,140,160,99,215,46,70,138,128,171,38,141,181,234,167,198,39,145,227,99]},"announce":[],"urlList":[]}}