{"title":"[NDS]Kung_Fu_Panda[FRA][www.the-data-base.co.uk]","uid":4377877,"size":33568018,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:b2c8a231b0620f6ef97ff29eb7ea417e447405f3&amp;dn=%5BNDS%5DKung_Fu_Panda%5BFRA%5D%5Bwww.the-data-base.co.uk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"superfive12345","files":3,"time":1220502150,"description":"Master the specialized Kung Fu fighting styles of Po the Panda with Kung Fu Panda. Embark on an epic, action-packed adventure with the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five. Through 13 legendary levels from the movie and beyond, you must work your way to become the Dragon Warrior. \n\nUse the daring Tigress&amp;#039;s fluid and powerful moves focusing on fast, stylized combat Use Monkey&amp;#039;s spring-loaded tail attacks, explosive style and acrobatic abilities to execute a variety of lightning-fast platforming moves Use Viper&amp;#039;s snake-like stealth abilities to pull off such moves as the Umbrella, Enemy Taxi and Choking Coil attacks Use Crane&amp;#039;s Surface-to-Air Attacks with his graceful and light-footed movements, which let you Fly, Glide and Swoop Use Mantis&amp;#039; super strength, strong grab maneuvers and super quick burst moves to deliver powerful and paralyzing strikes Experience favorite moments based on the film and game-exclusive content including a variety of environments and characters 13 multi-stage levels from the movie and more - battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles Join friends in multi-player action and co-op mode \n","torrent":{"xt":"urn:btih:b2c8a231b0620f6ef97ff29eb7ea417e447405f3","amp;dn":"%5BNDS%5DKung_Fu_Panda%5BFRA%5D%5Bwww.the-data-base.co.uk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2c8a231b0620f6ef97ff29eb7ea417e447405f3","infoHashBuffer":{"type":"Buffer","data":[178,200,162,49,176,98,15,110,249,127,242,158,183,234,65,126,68,116,5,243]},"announce":[],"urlList":[]}}