{"title":"Extreme Double Knitting: New Adventures in Reversible Colorwork","uid":9324823,"size":20146114,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2fc0536af3a944092cdd29c543ab7aebd062885&amp;dn=Extreme+Double+Knitting%3A+New+Adventures+in+Reversible+Colorwork&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KnitLady","files":-1,"time":1386615950,"description":"Double-knitting is the art of creating a knitted fabric with no &quot;wrong&quot; side, but that's only the beginning. Alasdair Post-Quinn has created an exhaustive how-to for double-knitting that thoroughly tackles techniques you didn't even know existed, let alone thought were possible, such as cabled double-knit fabric, knitting different patterns on either side of the fabric (instead of the usual mirror images) and much more. With 14 patterns, nearly 200 pages and more than 400 photos and illustrations, Extreme Double-Knitting is the only double-knitting reference you need!\n\nWHAT OTHER DESIGNERS ARE SAYING...\n\nA brilliant book, bound to become a classic work. Acquiring these double-layer techniques will enhance all aspects of your knitting life. Extreme Double Knitting is a very thorough and clearly explained approach to this fascinating area of knitting. Even if you do not yet see yourself reaching some of the more extreme feats of double-layer knitting offered here, you will be gently enticed to expand your repertoire of skills as far as you wish, with plenty more brain candy awaiting you.\n\n-Lucy Neatby\n\nThere are floods of knitting books that beguile with pretty, ingenious patterns. A precious few push back the boundaries of an entire technique. Extreme Double-Knitting does both, exceptionally. A tour-de-force.\n\n-Franklin Habit\n\nIn this delicious guide to the subterranean wonderland of double knitting, Alasdair illuminates user-friendly and innovative techniques of layering color, texture, and design.\n\n-Cat Bordhi","torrent":{"xt":"urn:btih:b2fc0536af3a944092cdd29c543ab7aebd062885","amp;dn":"Extreme+Double+Knitting%3A+New+Adventures+in+Reversible+Colorwork","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2fc0536af3a944092cdd29c543ab7aebd062885","infoHashBuffer":{"type":"Buffer","data":[178,252,5,54,175,58,148,64,146,205,210,156,84,58,183,174,189,6,40,133]},"announce":[],"urlList":[]}}