{"title":"Chasing The Big Ones #21 - Anal Interracial Porn XXX","uid":9319189,"size":2172582042,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b3df351a3d191b86b00be78cd35800cd3bffd772&amp;dn=Chasing+The+Big+Ones+%2321+-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1386517624,"description":"Chasing The Big Ones 21 (2003)\n\nGIRLS WHO LOVE BIG DICKS!See these babes get rammed by the biggest dicks in porn ... maybe the universe!!!\n\n    Scene 1. Kami Andrews, Jack Napier\n    Scene 2. Alicia Rhodes, Mandingo\n    Scene 3. Charlotte, Julie Silver, Lexington Steele\n    Scene 4. Cynara Fox, Mandingo\n    Scene 5. Jenna Red, Jack Napier, Joachim Kessef\n\nStudio: West Coast Productions\n\nActresses:\n    Alicia Rhodes [Anal Facial A2M IR]\n    Charlotte [IR]\n    Jenna Red [Anal DP Creampie]\n    Julie Silver [Anal Facial IR]\n    Kami Andrews [Anal A2M Creampie IR]\n    Cynara Fox (as Synara Fox) [Facial IR]\n\nActors:\n    Jack Napier\n    Joachim Kessef\n    Lexington Steele\n    Mandingo\n\nReviewed by picman  on  5/12/2004\nChasing The Big Ones 21\n\nPrologue Chasing The Big Ones has always been something of an enigma for me. I'm attracted to it for the spectacle of it, and there are usually a couple of good scenes, but it usually runs out of steam quickly. The main players at WCP are more dependant than most on the enthusiasm of the women they work with. This volume has ADT's own Kami Andrews, and after seeing her with Slayer and Boz I considered this a must see. She draws Jack Napier in the first scene, so lets go to the videotape (DVD, just joking}.\n\nKami Andrews Kami is dressed in red, looking like a sweet schoolgirl with big tits. She does some posing for us and then goes around the patio looking for cock. Inside the house she goes right to work on Jack's big dick. She asks him if he gets dizzy when he gets an erection. I guess if he ever has one he'll give her an answer. Kami proceeds to make the most honest attempt I've ever seen to deep throat Jack. Pretty damn close, too. She climbs onto the bed with him and stuffs that monster in her cooch. Kami sounds like it's really hitting her spots and we get our first &quot;Oh my!&quot; Jack is poling her pretty good in cowgirl and soon deep dicking her in spoon. There was some kissing and before you know it Jack drops a load on her pubes. Right back at it Jack enters Kami's ass in spoon. She's really testing herself here and moaning nicely. Jack is really looking like he's enjoying this and gets into a nice rythm with Kami. He turns her prone on the bed and does Slayer's push up move in her ass and then a modified up and over. He pulls out for some A2M and then enters her in mish anal. Kami is trembling and looks like she's having a seizure, turning Jack on. That was about all the anal she could take from that position and Jack fucks her pussy to another cumshot, on her breasts this time with nice PCH. Kami hops on his dick for RCA and now we get an &quot;Ah, goodness!&quot; When she slows down, they go back to spoon and she implores him to &quot;fuck that ass&quot;. He really buries himself in her butt deeply and she's moaning that it's good. I can't even describe the next position, but it's like a prone doggy with scissors. That morphs into a doggy and then prone doggy. Kami squeals and Jack pulls out to show a little anal creampie. I can't believe that Jack Napier just finished a scene where he came three times. Kami is amazing.\n\nAlicia Rhodes Alicia is on camera talking about how she's heard about this guy (Mandingo) and she's going to have fun at least trying to get it in the hole. Mandingo shows up and has her shake her moneymaker for him. Alicias breasts are exposed quickly and Dingo plays with those marvelous mams. He pulls down her panties and starts to eat at the &quot;Y&quot;. Get her good and wet for the onslaught. He unleashes the hound and Alicia goes right for it sucking him and licking his balls. Alicia does some light gagging, but doesn't get much down her throat. Mandingo likes having his cock bitten and Alicia complies. She lays on the bed on her back and Mandingo stuffs his dick in while she trash talks a little. A lttle P2M for a taste and back to the task at hand. We get the gyno angle and it's hard to tell how deeply she's being penetrated. They roll into spoon and he's getting about two thirds in. More P2M and back in spoon. Most of it is getting buried now and Mandingo tells Alicia it's time to ride. She climbs up in RC and that has to be hard on her legs. If she drops down she'll be permanently impaled. That doesn't last long and they move to doggy. This is nice and Alicia likes it, her pussy is sopping wet. Dingo pulls out and they go to anal doggy. He's just filling that ass and Alicia wants a taste from there, also. Alicia asks for a gape check, but Mandingo keeps plugging away. She looks to be in another world. They do a gape and resume the doggy. They roll into RCA and Alicia is fucking about half his dick. That does the trick and Mandingo orders her into position on the floor for the pop, a decent one on her tongue. A noble effort by Alicia,\n\nJulie Silver and Charlotte Next up is Julie Silver and Charlotte. I've seen Julie before and she's gorgeous. Young and blonde with an absolutely killer body. Charlotte is darker and smaller, but very cute. That said, there's no question who the star is in this segment. Charlotte will just be support. The girls drew the short straw in this volume's matchups. Lexington Steele. I think it's safe to assume there will be a torrid tryst here. Julie is dressed in red, Charlotte in blue as they introduce themselves and stroke their bodies. Julie says she wants to fuck and likes it in the ass. She motions for Lex to come over and bares her asshole for him. Like a bitch in heat. Charlotte drops her drawers for the camera, too. Lex starts by inspecting their asses and has them start by sucking his dick. They share nicely, licking balls and the shaft. Charlotte gets bent over first for some doggy penetration and Lex then picks her up for a flying fuck while Julie laps his balls and cleans his cock up. Julie next in doggy and Lex has her moaning big time while Charlotte licks and fondles her tits. He's in her pretty deep right from the outset and soon discovers what nice tits she has. He picks Charlotte up again for another flying fuck and carries her over to a couch where Julie is playing with herself. Charlotte rides him CG. Lex enters Julie in mish and gets a good stroke going. He's getting balls deep and her pussy is turning red. Charlotte is brought over for P2M and Lex resumes his ride of Julie. There are some long sensual strokes here and she does a pussy gape. Julie climbs on for RC and that's the position for this babe. The fucking is hard and deep and her legs are splayed. Charlotte gives her a rest with some P2M and then another short cycle of RC. Charlotte gets more dick now in mish with Julie supplying cleanup. Lex fills her up good and then moves back to Julie. He dicks her in doggy and there are sounds emanating from her squishy pussy. They pick it up with Julie impaling her ass in RCA. Her spot gets hit there, too. Next is doggy anal and Charlotte furiously strums Julies clit. Lex gets her really deep, now. Charlotte gives Julies ass a break by taking a doggy vag with cleanup by Julie. There are four very hard looking nipples at this point. Lex strokes off in Charlottes pussy until it's time for the pop which goes onto Julies face and in her mouth. Another good scene.\n\nSynara Fox Synara (Cynara?) will be taking on Mandingo as we see him waiting for her at the bottom of some stairs. She is a combination of cute and slutty with tattoos and piercings. Facially, she reminds me of Cassidey. She has a lean body with nice tits that are pierced. She starts off looking like she intends to throat Dingo. Good luck! She does some ball sucking and goes back to a serious bj. She takes it deep, but if she really deep throated him he'd burn the tip with stomach acid. Synara lays back on a couch and Mandingo drops his pole into her inviting snatch. The fucking is good and deep and appreciated. Synara turns around for doggy and Dingo gets his stroke on. There's a nice feel to this scene. Synara is thouroughly enjoying big dick fucking. The view from underneath shows a very wet pussy being filled nicely. They're talking to each other and that adds to the feel. They turn around for RC and Synara drops down for a few strokes and then tells Dingo to do the fucking. She picks it up again and rotates her hips on him before relinquishing control again with her feet on his thighs. She does a standing RC and looks like she's on a pogo stick. Her snatch is really wet at this point. Synara turns around again for RC and rides him nicely. This is the final position before Synara assumes the position on her knees and takes his load in her mouth to end a very good scene.\n\nLucille We get our first view of Lucille on a Prague street. Seen from afar, the first thing I notice are some thick, shapely legs descending from a short miniskirt and an impressive rack covered by a top that's little more than a handkerchief. Jack and Joachim engage her in some conversation and invite her for some fun. She's up for it and away we go. In a hotel room Lucille does a slow striptease, displaying an amazing body, squeezably soft looking and incredibly curvy. They go to the bedroom and Joachim latches onto her tits. Jack introduces Lucille to his manhood and her lips are drawn to it like a magnet. Joachim gets some oral loving, too, and Jack again. Jack is first to penetrate in spoon while Lucille keeps polishing Joachim's knob. That's a lot of dick for Lucille to take and she's feeling it. Jack gets some good deep stroking in before Lucille climbs on Joachim and sucks Jack's rubbery prong. Joachim plays with her asshole, a portent of things to come. Lucille can barely get the tip of Jack's cock in her mouth, but she's game. Jack comes up behind her and puts his dick in her ass, turning it into a CG DP. I don't know if she knew what she was getting into when signing up for this. Cut to the same DP with the roles reversed. That has to be a little easier. They break to vag mish by Jack as Joachim feeds her his cock. Jack cums quickly in her pussy and we cut to Joachim entering her ass in spoon. They turn it into RCA and Jack stands over her head trying to bring the monster back to life. He gets hard enough to make it a DP again and then back to anal with Joachim while Jack pokes at her mouth a little. Joachim cums in her ass, showing a nice creampie without any gimmicks and we cut to Jack plowing Lucille in vag missionary for another creampie, which they try to display, but I think it was too deep. This was a borderline scene. Lucille wasn't as ready for the humongous dicks that the other women in this volume handled so well.\n\nEpilogue This was probably the most solid edition of Chasing The Big Ones that I've seen. With the exception of the last scene, the women handled the size well. Kami drew three cumshots out of Jack, showing an amazing capacity and possibly patience. Twice it seemed as though her scene was going to end unsatisfactorily but managed to continue and even get harder. She also seemed to ride the pleasure/pain tip nicely. Alicia Rhodes has become one of my favorite women. Delightfully cushiony with true cock hunger. She was a good match for Mandingo and I think she's firmed up her body a little since shooting this scene. Julie Silver is just a hardcore vision. Painfully pretty and up for deep drilling in both lower orifices. Synara produced a really lively segment and what seemed like real heat. The only false step was in the final scene. Lucille was ready and willing, but not able. She did everything asked of her, but was in some discomfort. I give her credit for bravery but she was in over her head.\n\n\n","torrent":{"xt":"urn:btih:b3df351a3d191b86b00be78cd35800cd3bffd772","amp;dn":"Chasing+The+Big+Ones+%2321+-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3df351a3d191b86b00be78cd35800cd3bffd772","infoHashBuffer":{"type":"Buffer","data":[179,223,53,26,61,25,27,134,176,11,231,140,211,88,0,205,59,255,215,114]},"announce":[],"urlList":[]}}