{"title":"LEGO BATTLES","uid":5221143,"size":123715432,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:b657e29e614054c17e48b331fb08a028a40a1a31&amp;dn=LEGO+BATTLES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"er_jonnytorrent","files":1,"time":1260937703,"description":"HistÃƒÂ³ricamente, nuestras consolas se han visto inundadas por un importante nÃƒÂºmero de entregas basadas en licencias de Lego. Pero como en los ÃƒÂºltimos aÃƒÂ±os la gran mayorÃƒÂ­a de lanzamientos compartÃƒÂ­an el tÃƒÂ­tulo con otros universos (Star Wars, Batman, Indiana Jones, o incluso los futuros Harry Potter y Rock Band), ya casi nos habÃƒÂ­amos olvidado de la herencia original de todos esos juegos. Las piezas de Lego han sido muy importantes en el desarrollo de muchos niÃƒÂ±os, y por mÃƒÂ¡s aÃƒÂ±os que pasen esta dinÃƒÂ¡mica no parece que vaya a cambiar, gracias a su simplicidad y su habilidad para dejar volar la imaginaciÃƒÂ³n de los mÃƒÂ¡s jÃƒÂ³venes del hogar.\nPrecisamente, Lego Battles se convierte en un regreso a esas raÃƒÂ­ces, a un origen que parecÃƒÂ­a casi olvidado bajo la marea de licencias adicionales. Y lo hace de una manera muy fiel, ya que estamos hablando, posiblemente, de uno de los tÃƒÂ­tulos que representan con mayor fidelidad la intenciÃƒÂ³n original de las piezas. Un juego de estrategia en tiempo real para dejar volar nuestra imaginaciÃƒÂ³n, creando batallas ÃƒÂ©picas entre facciones imposibles de aunar de otro modo que no sea en su versiÃƒÂ³n de piezas Lego. Eso sÃƒÂ­, siguiendo las mismas directrices, tambiÃƒÂ©n es un juego pensado para los mÃƒÂ¡s pequeÃƒÂ±os de la casa: un tÃƒÂ­tulo sencillo en todos sus aspectos que no busca en ningÃƒÂºn momento mÃƒÂ¡s complicaciones de las estrictamente necesarias.\nEl modo principal para un jugador es, como cabrÃƒÂ­a esperar, el modo Historia. En ÃƒÂ©l  tendremos a nuestra disposiciÃƒÂ³n unas 70 misiones, divididas entre distintos capÃƒÂ­tulos: el medieval, el de piratas, el espacial, el de los magos, el bÃƒÂ©lico y el de los Bionicle. Todas las distintas vertientes de las figuras de juego reales adaptadas a un juego de estrategia, algo que consiguen con mucho acierto gracias a que este gÃƒÂ©nero guarda abundante relaciÃƒÂ³n con los juegos infantiles en el suelo de la habitaciÃƒÂ³n, colocando las distintas bases y preparando las tropas de asalto. En este aspecto, el juego es muy sencillo y todo aquel que haya disfrutado alguna vez de un tÃƒÂ­tulo de estrategia puede hacerse una idea de quÃƒÂ© se va a encontrar.\nMuy bÃƒÂ¡sico en todo momento, pensado para los mÃƒÂ¡s pequeÃƒÂ±os de la casa, el modo historia rara vez deja de parecer un tutorial, y debido al escaso tamaÃƒÂ±o de los mapas, no son demasiadas las cosas que debemos hacer. La indicaciÃƒÂ³n casi constante de lo que debemos hacer simplifica todavÃƒÂ­a mÃƒÂ¡s las cosas, y no tenemos muchos quebraderos de cabeza. El sistema de control con la pantalla tÃƒÂ¡ctil reproduce con bastante acierto el equivalente del ratÃƒÂ³n en PC, y deberemos pinchar sobre los edificios o personajes para acceder a sus caracterÃƒÂ­sticas particulares, o bien crear un cuadro para seleccionar un grupo de personajes. Accesible y sencillo, todo estÃƒÂ¡ al alcance de la mano y no hay grandes ÃƒÂ¡rboles de desarrollo ni submenÃƒÂºs complejos.\nTodo estÃƒÂ¡ al alcance de un click, y deberemos construir las clÃƒÂ¡sicas granjas para generar riqueza y poder tener mÃƒÂ¡s tropas, cuarteles para crear nuevas unidades, aserraderos y minas para conseguir recursos, etcÃƒÂ©tera. AdemÃƒÂ¡s, podremos crear elementos defensivos y ofensivos, asÃƒÂ­ como hÃƒÂ©roes que serÃƒÂ¡n una de nuestras principales bazas para alzarnos con la victoria. El desarrollo tan simplificado y la reiteraciÃƒÂ³n de las misiones provocan que, pese a ser bastante largo, el modo Historia se antoje bastante repetitivo, sobreviviendo sÃƒÂ³lo por el encanto que las propias piezas de Lego sean capaces de transmitir al jugador. En ese aspecto, poco se puede reprochar, ya que todo el encanto de la licencia se traslada con acierto al juego.","torrent":{"xt":"urn:btih:b657e29e614054c17e48b331fb08a028a40a1a31","amp;dn":"LEGO+BATTLES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b657e29e614054c17e48b331fb08a028a40a1a31","infoHashBuffer":{"type":"Buffer","data":[182,87,226,158,97,64,84,193,126,72,179,49,251,8,160,40,164,10,26,49]},"announce":[],"urlList":[]}}