{"title":"Coast to Coast Radio Program! Commercial Free! Dec 4th thru Dec","uid":4575513,"size":498411476,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:b6a7b540a9caec4ea59a87568dc4f5fe80993528&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+4th+thru+Dec+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":45,"time":1229213700,"description":"Hello my friends! Here we are yet again with more C2C for you all to enjoy! Thanks in advance, as always, to the seeders and to those that share these with other sites. I greatly appreciate it! I ask you all though to send out your positive thoughts and prayers to my uncle who has been recently diagnosed with terminal brain cancer. Of course, the doctors here in the United States say there is nothing that can be done, but I don't believe that for one second. There is probably a cure for cancer already. The power of positive intention together with alternative forms of medication and therapy are truly incredible though. Just please do me a favor and send out those positve thoughts and prayers to Stokeman's uncle Fred. I am sure the universe will know who you are thinking about! I am going to continue to research alternative treatments for brain cancer. Thank You All! Stokeman Out!\n\nThursday December 4th, 2008\nMartian Anomalies\nAerospace developer Sir Charles Shults discussed his research into anomalies on Mars, notably what he believes to be fossils on the Martian surface. &quot;What I have found is basically the remains of organisms that look like sea urchins. We've found some... \nHost: George Noory\nGuest(s): Charles Shults, Richard C. Hoagland, Robert Young Pelton\n\nFriday December 5th, 2008\nBizarre/Freaky Calls\nDuring Open Lines, George invited callers to share their own bizarre and freaky tales. Richard in Pennsylvania recounted the strange story of Stone Man Willie, who according to legend was turned to stone by a botched embalming procedure. Richard said...\nHost: George Noory\nGuest(s): Open Lines, Varla Ventura\n\nSaturday December 6th, 2008\nThe Inquisition\nNoted historian and author Jonathan Kirsch discussed the history of the Inquisition. Kirsch defined the Inquisition as a joint bureaucracy of church and state authorities charged with the task of punishing anybody who failed to embrace the dogma of the...\nHost: Ian Punnett\nGuest(s): Jonathan Kirsch, Kristi Piehl\n\nSunday December 7th, 2008\nEsoteric Symbolism\nGeorge Noory welcomed investigative mythologist William Henry, who discussed his latest research into the esoteric symbolism of the U.S. Capitol and what it reveals about the intentions of the founding fathers. Describing the insights he has gained from... \nHost: George Noory\nGuest(s): William Henry, Douglas Dietrich\n\nMonday December 8th, 2008\nAmerican Medicine &amp; Psychic Predictions\nDuring the first half of the show, Dr. John Abramson discussed the commercialization of American medicine. The pharmaceutical industry is geared towards maximum profit rather than maximum health, he commented. Further, he questioned the impartiality of... \nHost: George Noory\nGuest(s): Dr. John Abramson, Joseph Jacobs\n\nTuesday December 9th, 2008\nNear Death Research\nFounder of the Near Death Experience Research Foundation, Dr. Jeffrey Long MD shared research about NDEs, culled from over 1,600 cases. NDEs are lucid experiences that a person undergoes while unconscious or clinically dead that cannot be medically... \nHost: George Noory\nGuest(s): Jeffrey Long, Robert Laughlin\n\nWednesday December 10th, 2008\nVisitations of the Annunaki\nAuthor Marshall Klarfeld shared his contention that a group of ETs known as the Annunaki visited Earth and genetically altered humans. Basing some of his suppositions on the work of Zecharia Sitchin who translated ancient cuneiform tablets of the Sumerians,... \nHost: George Noory\nGuest(s): Marshall Klarfeld, George Ure, Dr. Roy Spencer\n\nThursday December 11th, 2008\nColonizing Mars &amp; Alternative Fuels\nDr. Robert Zubrin discussed the nuts and bolts of colonizing Mars, as well as his plan for energy independence. In his new book How to Live on Mars, Zubrin writes from the irreverent point of view of a Mars settler in the early 22nd century who &quot;achieved...\nHost: George Noory\nGuest(s): Dr. Robert Zubrin, Gerald Celente\n\nFriday December 12th, 2008\nFull Moon Friday Open Lines\nDuring Open Lines, callers phoned in with their stories on a variety of topics. Mark in Hilo, Hawaii expressed concern about how our government has been running the country and suggested term limits for representatives. Matt from Seneca, Missouri told... \nHost: George Noory\nGuest(s): Open Lines, Mark Lerner","torrent":{"xt":"urn:btih:b6a7b540a9caec4ea59a87568dc4f5fe80993528","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Dec+4th+thru+Dec+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a7b540a9caec4ea59a87568dc4f5fe80993528","infoHashBuffer":{"type":"Buffer","data":[182,167,181,64,169,202,236,78,165,154,135,86,141,196,245,254,128,153,53,40]},"announce":[],"urlList":[]}}