{"title":"Chinese Roswell-UFO from China-juyishi","uid":3736345,"size":366638111,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b6d981bdb09eabc27cd3ddbbe86962ed0602885e&amp;dn=Chinese+Roswell-UFO+from+China-juyishi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"juyishi","files":15,"time":1183939515,"description":"Chi Pu Tei.\n\nChi Pu Tei, a professor of archaeology at Beijing University, directed the archaeological survey of the series of interlinking caves. In a report he noted that the &quot;caves&quot; may have been artificially carved, and were more like a complex system of tunnels and underground storerooms. The walls were squared and glazed, as if cut into the mountain with a source of extreme heat. Inside the caves were several ancient, but neatly arranged burial sites, and in them the skeletal remains of a strange people, our people. He found our skeletons to be about 4 feet 4 inches tall, with &amp;#039;oversized&amp;#039; heads in relation to our otherwise &amp;#039;slender&amp;#039; frame. \n\nWhat his team found about us.\n\nOur skeletons, measuring a little more than four feet tall, were found &quot;frail and spindly&quot; with &quot;disproportionately large&quot; skulls. At first he suggested that these might be the remains of an unknown species of mountain gorilla! His fellow academicians ridiculed his published findings, &quot;Who ever heard of apes burying one another?&quot; but &quot;Yet, what kind of human was this?&quot; \n\nMore discoveries made further in the total of 716 caves all but ruled out the idea that these were apes. On the walls our carved pictograms of the heavens were found: your sun, your moon, the stars, and your Earth with lines of dots we draw to connect them. Then his team made &quot;the most incredible discovery of all&quot;. Half buried in the dirt floor of each cave they found our disks, referred to as &quot;odd stone disks&quot; and described as &quot;obviously fashioned by the hand of an intelligent creature, with approximately nine inches in diameter and three-quarters of an inch thick. In the exact center was a perfectly round, 3/4&quot; hole, and etched in its face was a fine groove spiralling out from the center to the rim, making the disk look for all the world like some kind of primitive (sic) phonograph record&quot;. \n\n\nThis one plate which mankind dated to be between 10,000 and 12,000 years BC old, older by far than your great pyramids of Egypt, was found fantastic enough, but the wonder was multiplied manyfold. In all, 716 such plates were found. And each held an incredible secret. The groove, upon further inspection, was not a groove at all, but a continuous line of our writing! \n\nThe tiny, almost microscopic characters are of course in a language you never encountered before as the team soon found out. It wasn&amp;#039;t until 1962 that another Chinese scientist was able to decode the message of the stone plates -- a message so incredible and earth-shattering that the Prehistory Department of the Beijing Academy prohibited its translation to be published. Eventually, the message was published, and what is says will astound you. \n\n\n                                                                5:51 2007-7-9  juyishi\n\n\n","torrent":{"xt":"urn:btih:b6d981bdb09eabc27cd3ddbbe86962ed0602885e","amp;dn":"Chinese+Roswell-UFO+from+China-juyishi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6d981bdb09eabc27cd3ddbbe86962ed0602885e","infoHashBuffer":{"type":"Buffer","data":[182,217,129,189,176,158,171,194,124,211,221,187,232,105,98,237,6,2,136,94]},"announce":[],"urlList":[]}}