{"title":"ubuntu-gnome-14.04-beta1-desktop-amd64.iso","uid":9959447,"size":933232640,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:baab5076469a52ea9f0d3eeae8263f154da2fbab&amp;dn=ubuntu-gnome-14.04-beta1-desktop-amd64.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1397499873,"description":"[color=green][b]THIS TORRENT FROM OFFICIAL UBUNTU WEBSITE[/b]\n[b]X64 INTEL AMD[/b][/color]\n[b][size=200]Unity changes in Ubuntu 14.04 Trusty Tahr final beta[/size][/b]\n====================================================\n[img]http://s27.postimg.org/cft01ajmr/ubuntu14_04_borderless_window_decorations.png[/img]\n[img]http://s27.postimg.org/4qw5pkj4z/ubuntu_14_04_unity_spread.jpg[/img]\n[img]http://s27.postimg.org/stczkfzs3/ubuntu14_04_dash_plugins.png[/img]\n[img]http://s27.postimg.org/vyxlanieb/ubuntu14_04_unity_search.png[/img]\n=====================================================\nUnity has received a lot of changes in Ubuntu 14.04 Trusty Tahr, even more than in the previous Ubuntu release, even though 14.04 is a LTS. Among the new features / improvements are:\n\n Ubuntu 14.04 ships with Unity Control Center and Unity Settings Daemon, forked from GNOME Control Center and GNOME Settigns Daemon so it doesn't interfere with Ubuntu GNOME;\n Unity now uses GTK3 CSS themed window decorations, instead of the Compiz decorations. The new decoration support full GTK 3 theming and they introduce improved resizing speed and anti-aliased corners as well as a fix for an old regression: the panel is now right-clickable when a window is maximized with global menu enabled, displaying the same menu that's available when right clicking an unmaximized window titlebar (lets you minimize, unmaximize, set the window always on top, move to workspace, etc.);\n two years after this feature was first announced (and then abandoned), Unity finally got locally integrated menus (LIM). Locally integrated menus are displayed in the window decorations for unmaximized windows, instead of the default Unity approach which is to display the menu on the top panel. There is one thing that the default Unity menu and LIM have in common: both are displayed on mouse over and there's no option to make the menu permanently visible, at least not yet. LIM can be enabled via System Settings &gt; Appearance &gt; Behavior &gt; Show the menus for a window &gt; in the window's title bar;\n Unity Spread (triggered by clicking on an application icon in the Launcher which already has focus and has multiple windows or for all open windows, by pressing SUPER + W) has received support for filtering windows by title. The search field is not displayed by default in the Unity Spread, but as soon as you start typing, the windows are filtered by their title and a Dash-like search is displayed on top of the spread view;\n Unity got its own lockscreen, designed to look like the Unity Greeter (login screen);\n a lot of HiDPI work: Unity got improved support for HiDPI screens, though from what I've read, there are still some bugs regarding this (and I can't test it since I don't have an high pixel density display). The UI scale can be set from System Settings &gt; Displays;\n you can now set Unity to allow minimizing applications by clicking their icons in the Unity Launcher. This option is not enabled by default and it can be enabled via CompizConfig Settings Manager (Unity Plugin &gt; Launcher &gt; Minimize Single Window Applications (Unsupported)). This feature only works for single-window applications so if an application has two windows, it won't work;\n &quot;live&quot; window resizing. Until now, resizing windows in Unity would only display a frame with the new window size and the actual resize would only happen after you were done resizing the window but starting with Ubuntu 14.04, the windows are resized in real time;\n the default Ubuntu 14.04 themes (Ambiance and Radiance) no longer use window borders;\n Unity global menu can now be disabled for individual applications (via Dconf for now);\n the Unity launcher can be scaled down to 8px\n========================================","torrent":{"xt":"urn:btih:baab5076469a52ea9f0d3eeae8263f154da2fbab","amp;dn":"ubuntu-gnome-14.04-beta1-desktop-amd64.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baab5076469a52ea9f0d3eeae8263f154da2fbab","infoHashBuffer":{"type":"Buffer","data":[186,171,80,118,70,154,82,234,159,13,62,234,232,38,63,21,77,162,251,171]},"announce":[],"urlList":[]}}