{"title":"Living Dead - Fuck The System (demo 2005)","uid":3847956,"size":17776810,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:baca59ec390c42e849c494c533efaeeb5d2f7c83&amp;dn=Living+Dead+-+Fuck+The+System+%28demo+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fishman2345","files":6,"time":1192759032,"description":"Living Dead\nIndustrial / Gothic / Metal / Rock\n\n&quot;Fuck the System&quot; Demo 2005\n\n\nTrack listing:\n\n1. Fuck the World\n2. I Don&amp;#039;t Want To Die Alone\n3. Love &amp; Hate\n4. Faith of Disbelief\n5. American Antichrist (Bonus Track From 2002)\n\n\n&quot;This is our time, We are tomorrow. \nLet&amp;#039;s make this world become our own&quot; \n-X\n\nWe are living in an age of lies and deceit. From warmongering governments hellbent on furthering their own agendas no matter what the cost to religious factions that are more concerned with their collection plates than the spiritual development of their congregations, Living Dead seeks to expose the truth: Salvation lies within. \n\nLiving Dead has created a sound and live performance all their own; designed to smack the corporate, fascist government empire in the face. From the politically driven lyrics and imagery to the roar of electronics, grinding rhythms, blaring beats, and overall shock, Living Dead delivers an experience to open the minds and eyes of the people. With a wide range of styles, Living Dead are a truly innovative and unique musical force. \n\nFormed in 1993 by Daniel Devill, Gabriel and Loki, Living Dead has evolved through the years; solidifying the lineup with the addition of Judas in 1999, Faust in 2002 and Six in 2006. Living Dead has released several E.P.s and has recently completed their most ambitious project to date: a double cd release, Blind and Vision. \n\nBased in Toledo, Ohio, Living Dead regularly plays to crowds of 500 or more and has shared the stage with Danzig, The Misfits, Mindless Self Indulgence, Mushroomhead, Mortiis, Chimaira, The Agony Scene, Himsa, Trivium, Dog Fashion Disco, Tub Ring, Crossbreed, Wednesday 13, Lennon, Bozo Porno Circus, VAST and Slaves on Dope among others. Living Dead consistently gives a high energy performance with political and social commentary in front of a video backdrop. As their fans will tell you, a Living Dead show is not to be missed! ","torrent":{"xt":"urn:btih:baca59ec390c42e849c494c533efaeeb5d2f7c83","amp;dn":"Living+Dead+-+Fuck+The+System+%28demo+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baca59ec390c42e849c494c533efaeeb5d2f7c83","infoHashBuffer":{"type":"Buffer","data":[186,202,89,236,57,12,66,232,73,196,148,197,51,239,174,235,93,47,124,131]},"announce":[],"urlList":[]}}