{"title":"I.Love.Shopping.2009.iTALiAN.MD.DVDRip.XviD-SiLENT[Ultima Fronti","uid":4935957,"size":728721408,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb519abc3ac8f85e63d6ebe4a2dd550fbe659046&amp;dn=I.Love.Shopping.2009.iTALiAN.MD.DVDRip.XviD-SiLENT%5BUltima+Fronti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"confe90","files":1,"time":1244245602,"description":"Released By Ultima Frontiera\n\nI Love Shopping (2009)\n\n\n.::Locandina::.\n &lt;a href=&quot;\nhttp://pic.leech.it/i/2681c/fa3659f7iloveshopp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pic.leech.it/i/2681c/fa3659f7iloveshopp.jpg&lt;/a&gt;\n\n\n.::Info Film::.\n\nTitolo originale: Confessions of a Shopaholic\nNazione: U.S.A\nAnno: 2009\nGenere: Commedia, Romantico\nDurata: 104'\nRegia: P.J. Hogan\n\nProduzione: Touchstone Pictures, Jerry Bruckheimer Films\nDistribuzione: Walt Disney Studios Motion Pictures Italia\nData di uscita: 27 Febbraio 2009 (cinema)\n\n\n.::Cast::.\n\nIsla Fisher, Hugh Dancy, Krysten Ritter, Joan Cusack, John Goodman, Stephen Guarino, Kristin Scott Thomas, Lauren Steffany, Kathy Searle\n\n.::Trama::.\n\nRebecca Blomwood ÃƒÂ© una maniaca dello shopping, tanto presa dal vizio delle compere, che il suo lavoro non le garantisce uno stipendio adeguato a mantenere le sue abitudini. Decide allora di cercarne uno piÃƒÂ¹ remunerativo, ma per uno strano scherzo del destino, trova un posto come giornalista per un quotidiano economico, dove si occuperÃƒÂ  di una rubrica che consiglia come investire i propri soldi... RiuscirÃƒÂ  ad essere all'altezza della situazione?\n\n\n.::Recensione:..\n\nI Love Shopping e i suoi derivati hanno scalato tutte le top ten dei best seller, regalando alla sua autrice, Sophie Kinsella, fama e ricchezza. Era solo questione di tempo prima che Hollywood si impossessasse dei suoi diritti e ne facesse un film (e speriamo solo uno) sulle avventure della fashion addicted per eccellenza, Rebecca Bloomwood, in arte Becky.\nBecky, non piÃƒÂ¹ inglese ma americana, residente a New York, ÃƒÂ¨ una giornalista sull'orlo di un collasso finanziario che trova per sbaglio posto in una rivista economica, sognando di poter lavorare per &quot;Alette&quot;, un giornale di moda dello stesso gruppo editoriale. Il resto ÃƒÂ¨ una banalitÃƒÂ  dietro l'altra: Becky conquista il suo capo, bello, ricco, sensibile; riesce a diventare la giornalista di punta della rivista e infine supera la sua dipendenza.\nIl film ÃƒÂ¨ veramente deludente, a tratti irritante, la sua protagonista ÃƒÂ¨ di una stupiditÃƒÂ  che rasenta la demenza, i siparietti che si vorrebbero comici risultano fastidiosi con la protagonista che cade, rotola, fa finta di perdersi e poi sorride, sorride, sorride sempre, di un sorriso cosÃƒÂ¬ finto e di plastica che vorremmo vedere entrare in scena il Mickey Rourke di &quot;The Wrestler&quot; per farle una presa doppia e sbatterla al tappeto.\nAnche piÃƒÂ¹ dementi i personaggi che la circondano che si sdilinquiscono per le banalitÃƒÂ  che dice. E' assurdo che la direttrice di una rivista di moda possa interessarsi ad una persona che abbina gli abiti come se tutti gli specchi di casa sua fossero rotti. Gli accostamenti cromatici sono un pugno nell'occhio per ogni persona che abbia un minimo di gusto o di senso estetico, anche se ÃƒÂ¨ americana questo non la scusa.\nE' triste vedere John Goodman e Joan Cusak relegati al ruolo di genitori sottosviluppati, che abbandonano il loro stile di vita parsimonioso ed economo dopo aver letto un articolo di giornale.\nNelle commedie spesso capitano situazioni irreali o paradossali ma per poter essere accettate devono essere ben costruite, giustificate, qui tutto viene buttato lÃƒÂ¬ senza senso e senza misura, le ovvietÃƒÂ  si sprecano e quel che ÃƒÂ¨ peggio non c'ÃƒÂ¨ una battuta, che sia una, che faccia ridere, ma neppure sorridere. Guardiamo il film domandandoci: &quot;ma ÃƒÂ¨ cosÃƒÂ¬ anche il libro? nel qual caso perchÃƒÂ© ha venduto tanto?&quot;\n\nLa frase: &quot;Avete presente quando incontrate due begli occhi che vi sorridono e il cuore si scioglie come una noce di burro sul pane tostato caldo? Io mi sento cosÃƒÂ¬ quando vedo un negozio&quot;.[/b]\n\n.::Voto A/V::.\n\nVIDEO: 9\nAUDIO: 7.0","torrent":{"xt":"urn:btih:bb519abc3ac8f85e63d6ebe4a2dd550fbe659046","amp;dn":"I.Love.Shopping.2009.iTALiAN.MD.DVDRip.XviD-SiLENT%5BUltima+Fronti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb519abc3ac8f85e63d6ebe4a2dd550fbe659046","infoHashBuffer":{"type":"Buffer","data":[187,81,154,188,58,200,248,94,99,214,235,228,162,221,85,15,190,101,144,70]},"announce":[],"urlList":[]}}