{"title":"Cyber Update Jan.2011-------DB-11229 HollyHeart","uid":6140697,"size":938086306,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bcb46708c532e26b5892d225cf0db2a1e01bfe14&amp;dn=Cyber+Update+Jan.2011-------DB-11229+HollyHeart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":303,"time":1296492122,"description":"From Kink.com   ( Device Bondage )  + Pics\n\n\n\n\nHolly is woven into the wall stock, fingers fastened spread, ankles strapped back. I warm her up by using the tightest gripping nipple clamps I could find then flog her firm tits and ass. A vibe and dick are shoved into her while I cane her and add weights to the clamps. Between the caning and the vibe, I can't tell which she was enjoying more. Watch her thrash around in search of a vicious orgasm.\n\nNext she is rigidly spread wide in the pipe system. Her tight pussy is vulnerable and waiting. After loosening her up with some vibe and thrusting a dick in her ass, I tie nipple clamps to her pussy lips. She takes a hefty foot caning and endures the stretch of her pussy and nipples. Her facial expressions complement the screaming of pleasure, but I wouldn't miss out on the end when I take off the nipple clamps.\n\nIt's about time to attend this firm near perfect ass. Of course the only thing to make this ass purely perfect is the remnants of the sharp swat of the cane. Her breasts are pressed down onto wooden pegs just for good measure. Holly's hair is tied back and hooked into her ass so we do not miss a single sweat drop or wince of fear or reaction to a foot caning. A vibe is planted into her and the show writes itself. Every scream, every movement, every bit of struggle either tugs on her ass or forces the pegs to dig into her tits with every orgasm. \n\n\n\n\nScreens &lt;a href=&quot; http://www.devicebondage.com/site/shoot.jsp?shootId=11229&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.devicebondage.com/site/shoot.jsp?shootId=11229&lt;/a&gt;\n\n\n\nDheerz  :-)","torrent":{"xt":"urn:btih:bcb46708c532e26b5892d225cf0db2a1e01bfe14","amp;dn":"Cyber+Update+Jan.2011-------DB-11229+HollyHeart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb46708c532e26b5892d225cf0db2a1e01bfe14","infoHashBuffer":{"type":"Buffer","data":[188,180,103,8,197,50,226,107,88,146,210,37,207,13,178,161,224,27,254,20]},"announce":[],"urlList":[]}}