{"title":"Dark Fall","uid":5431318,"size":301580976,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bf1d8fd34264049b14705eda99e33d96b6c0c60c&amp;dn=Dark+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Psychodad149","files":2,"time":1268423064,"description":"Very dark, immersive and atmospheric.  Classic graphic adventure full of diabolical puzzles and ghostly encounters.  Play this one at night!  The music and sound effects are very minimalistic, but brilliantly executed.  You WILL be looking over your shoulder -- or trying not to!\n\nThe game starts as you explore a deserted hotel/rail station in the rural English village of Dowerton.  You are trying to find some trace of your missing brother, an architect who had been hired to renovate the place, abandoned since Word War 2.  He mentioned in his letter that there a team of ghost hunters also in residence.\n\nNow you have arrived, and no-one is to be found.  \n\nNo-one living.\n\n\nGhostly clues and voices direct you as you uncover old letters and new computers, photos, maps, and many other artefacts which reveal the chilling history of bloodshed and madness hidden in this obscure corner of England's pleasant pastures green.  \n\nSomething from beyond -- something older than human history -- lurks at the threshold and casts a long, sinister shadow out of time and over Dowerton.  Your mission now is to find the truth, uncover the reality behind the veil, and preserve the sanity of the world.\n\n\nHey -- did that picture just move?\n\n","torrent":{"xt":"urn:btih:bf1d8fd34264049b14705eda99e33d96b6c0c60c","amp;dn":"Dark+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1d8fd34264049b14705eda99e33d96b6c0c60c","infoHashBuffer":{"type":"Buffer","data":[191,29,143,211,66,100,4,155,20,112,94,218,153,227,61,150,182,192,198,12]},"announce":[],"urlList":[]}}