{"title":"The Mentalist S1 E10 (2008)nl.subs.NLT-Release (DivX)","uid":4681238,"size":418798206,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0a81eec2f8774d1e0500d4309443f41d58daee8&amp;dn=The+Mentalist+S1+E10+%282008%29nl.subs.NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"linday1","files":-1,"time":1233080871,"description":"De nieuwe Amerikaanse hitserie The Mentalist is vanaf 1 januari wekelijks te zien op SBS 6. Deze crimeserie vertelt het verhaal van Patrick Jane: een zeer bekende, voormalig televisieparagnost die, nadat hij ontmaskert is als fraudeur, nu zijn echte vaardigheden als mentalist gebruikt om het Californie Bureau of Investigation te helpen met het oplossen van misdrijven. Als mentalist, gebruikt Patrick Jane zijn zeer ontwikkelde kundigheden: observeren, afleiden en manipuleren, om het Serious Crime Team te ondersteunen. Hij is charismatisch, een beetje vreemd - en stuurs, en zijn moderne Sherlock Holmes achtige, opzienbarende methodes overschrijden vaak een grens, maar deze methodes geven hem uiteindelijk vaak gelijk.\n\n\n[b] Season 1: Episode 10: Red Brick and Ivy[/b]\n\nWhen a leading scientific researcher at Leyland University, Alex Nelson, drops dead from poisoning, Jane takes a personal interest in the case after learning the lead suspect and victim's ex-wife, Sophie Miller, is Jane's former psychiatrist. Sophie helped Jane through a bad patch following the murder of his wife and daughter and now Jane wants to return the favor. While the evidence starts to stack up against Sophie, Jane focuses on the multi-million dollar behavioral research project Sophie and Alex were working on, and ultimately discovers their research was a sham. With reputations and millions at stake, Jane and the team must find who was willing to kill to keep the fraud covered up.\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nEnjoy The Movie!!!!!!","torrent":{"xt":"urn:btih:c0a81eec2f8774d1e0500d4309443f41d58daee8","amp;dn":"The+Mentalist+S1+E10+%282008%29nl.subs.NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a81eec2f8774d1e0500d4309443f41d58daee8","infoHashBuffer":{"type":"Buffer","data":[192,168,30,236,47,135,116,209,224,80,13,67,9,68,63,65,213,141,174,232]},"announce":[],"urlList":[]}}