{"title":"GoodGCOM_310.7z - Tiger Game.Com Full Romset","uid":4843030,"size":7418358,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:c0c57469a25ac3e6fde9d46820d3a3353d705dc3&amp;dn=GoodGCOM_310.7z+-+Tiger+Game.Com+Full+Romset&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fishmech","files":1,"time":1239573524,"description":"Repost of the Game.Com romset\n\n\nGame.com\nFrom Wikipedia, the free encyclopedia\n\nThe Game.com (pronounced in TV commercials as &quot;game com&quot;, not &quot;game dot com&quot; and not capitalized in marketing material) was a handheld game console released by Tiger Electronics in September 1997. Although aimed at an older target audience, sporting PDA-style features and functions such as a touch screen and stylus, Tiger hoped it would challenge Nintendo's Game Boy. Unlike other handheld game consoles, the first game.com consoles included two slots for game cartridges and could be connected to a 14.4 kbit/s modem. Later models reverted to a single cartridge slot.\n\n You have 30 of 30 known Tiger Game.com ROMS (V3.14)\n\nBatman and Robin (1997) (71-709)\nCentipede (1999) (71-755)\nDuke Nukem 3D (1997) (71-712)\nFighters MegaMix (1998) (71-739) [b1]\nFighters MegaMix (1998) (71-739)\nFrogger (1999) (71-756)\nGame.com External BIOS (1997) (71-516) [!]\nGame.com External BIOS (1997) (71-516) [a1]\nGame.com Internal BIOS (1997) (71-516)\nGame.com Internet (1997) (71-529)\nHenry (1997) (71-728)\nIndy 500 (1997) (71-525)\nJeopardy! (1998) (71-726)\nLights Out (1997) (71-735)\nLost World, The - Jurassic Park (1997) (71-704)\nMonopoly (1999) (71-752) [!]\nMortal Kombat Trilogy (1997) (71-711) [b1]\nMortal Kombat Trilogy (1997) (71-711)\nQuiz Wiz - Cyber Trivia (1997) (71-524)\nResident Evil 2 (1998) (71-745) [b1]\nResident Evil 2 (1998) (71-745)\nScrabble (1999) (71-754)\nSonic Jam (1998) (71-734) [b1]\nSonic Jam (1998) (71-734)\nTiger Casino (1998) (71-731) [b1]\nTiger Casino (1998) (71-731)\nTiger Web Link (1997) (71-747)\nWheel of Fortune (1997) (71-523)\nWheel of Fortune 2 (1998) (71-527) [!]\nWilliams Arcade Classics (1997) (71-722)\n\nHistory\nTitles released at game.com's launch included Indy 500, Duke Nukem 3D and Mortal Kombat Trilogy, along with Lights Out which came packaged with the system. Tiger also produced equivalents to many Game Boy peripherals, such as the compete.com serial cable allowing players to connect their consoles to play multiplayer games or exchange high scores. Branded items such as an AC adapter, earphones, and a carry-case were also made available.\n\nUnfortunately, many of the game.com's exclusive features had only limited functionality. The touch screen had a fairly low sensor resolution, so it was hard to use for precise input in games and few players made use of the PDA functions to keep phone numbers, addresses or the like. Furthermore, the failure of the built-in backup battery would erase any high scores or information stored on the console.\n\nTiger mostly botched the job of marketing the game.com to an older audience. While they were able to line up licenses like Mortal Kombat, Duke Nukem, and Resident Evil, few of these portable adaptations were developed by their original creators, or even very true to the original games. Most game development, even on licensed games, was done in-house. As such, SDKs were not known to be widely available.\n\nAt the time, the platform was almost completely ignored by the enthusiast gaming press. Tiger also used insulting marketing, including ill-considered slogans such as, &quot;It plays more games than you slackers have brain cells.&quot;\n\nIn an effort to revitalize their ailing system, Tiger would later release the game.com Pocket Pro. This was a smaller version of the game.com which had the same specifications as the original except that it had a single cartridge slot and required only two AA batteries. The initial version of the Pocket Pro featured a backlit screen and is distinguished by its rough-textured black case. A subsequent re-release omitted the backlight and came in four translucent colors (green, blue, pink, and purple).\n\nThis re-release enjoyed very limited success, and the console would be cancelled in 2000, along with its exclusive ISP. Most of its problems were due to a small lineup (only 20 games), poor distribution, and poor marketing. Notably, its display, like the original Game Boy's, suffered from very slow screen updates (known as &quot;ghosting&quot;), which particularly hurt the fast-paced games Tiger sought licenses for.\n\nInternet features\n\nUsing the game.com with the modem was cumbersome. The user had to insert the game.com modem into one of the unit's game cartridge slots, connect the game.com to a phone jack, and dial into the game.com-exclusive (and fairly expensive) ISP. From there, the user could upload saved high scores, or check e-mail and view the web if they had the Internet cartridge (sold separately from the modem). This process would end up being a matter of trial-and-error; both Tiger's now-defunct website and the included manual gave incorrect instructions for setting up a game.com for internet access.\n\nWeb access was text-only, and the later, single-cartridge versions of the game.com could not access the web or send e-mail at all. No games had actual online play with other people, only high score uploads. The monthly fee, two extra peripherals, and exceedingly confusing setup required meant that only a small percentage of the admittedly few game.com owners had a subscription to the game.com internet service, which would barely survive until the cancellation of the handheld itself.","torrent":{"xt":"urn:btih:c0c57469a25ac3e6fde9d46820d3a3353d705dc3","amp;dn":"GoodGCOM_310.7z+-+Tiger+Game.Com+Full+Romset","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c57469a25ac3e6fde9d46820d3a3353d705dc3","infoHashBuffer":{"type":"Buffer","data":[192,197,116,105,162,90,195,230,253,233,212,104,32,211,163,53,61,112,93,195]},"announce":[],"urlList":[]}}