{"title":"Democracy Now - 14 dec 2010","uid":6039834,"size":442249903,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c14cd8b41ed443138ce2fdf44cae535cd8b317bf&amp;dn=Democracy+Now+-+14+dec+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1292343837,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 14, 2010\n\n- Assange Seeks Bail in London Court\n- Federal Court Strikes Down Healthcare Mandates\n- Senate Advances Obama-GOP Tax Deal\n- Wall Street Sees Record 2-Year Profits\n- Incoming GOP House Finance Panel Chair: Gov't Should &quot;Serve the Banks&quot;\n- Discharged Soldiers File Suit Against &quot;Don't Ask, Don't Tell&quot;\n- U.S. Resumes Deportations to Haiti\n- New York Enacts Partial Ban on Fracking\n- Backers Hold Rally for Local Community Radio Act\n- Peace Activists Convicted for Anti-Nuke Plowshares Action\n- Kuwait Closes Al Jazeera Office Over Crackdown Coverage\n- Australia Rejects View of Iran as &quot;Rogue State&quot;\n- Veteran Diplomat Richard Holbrooke Dies at 69\n\n\nSpecial reports\n\n- Judge With GOP Ties Strikes Down Key Health Care Provision on Insurance Mandates\n\nA federal judge in Virginia has ruled the government cannot force Americans to purchase mandatory health insurance or face penalties. The ruling came in a lawsuit filed by the state of Virginia, one of two dozen challenging the law in federal courts nationwide. The debate over the law is expected to end up before the Supreme Court. The judge in the case, Judge Henry Hudson, is the part-owner of Campaign Solutions, a Republican consulting firm that has worked to oppose healthcare reform.\n\n\n- &quot;The Worse Off You Are, Your Taxes Increase&quot;: Journalist David Cay Johnston Slams Obama-GOP Tax Deal\n\nThe U.S. Senate is on the verge of approving President Obama's controversial tax deal with Republicans. Under the deal, Obama agreed to extend the Bush-era tax cut for the wealthiest Americans and reduce the estate tax in return for a 13-month extension of jobless benefits and a handful of tax credits for low- and moderate-income Americans. We speak to Pulitzer Prize-winning investigative journalist David Cay Johnston, author of Free Lunch: How the Wealthiest Americans Enrich Themselves at Government Expense (and Stick You with the Bill).\n\n\n- Prisoner Advocate Elaine Brown on Georgia Prison Strike: &quot;Repression Breeds Resistance&quot;\n\nAt least four prisons in Georgia remain in lockdown five days after prisoners went on strike in protest of poor living and working conditions. Using cell phones purchased from guards, the prisoners coordinated the non-violent protests to stage the largest prison strike in U.S. history. There are reports of widespread violence and brutality by the guards against the prisoners on strike. We speak to longtime prison activist Elaine Brown of the newly formed group Concerned Coalition to Respect Prisoners' Rights.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c14cd8b41ed443138ce2fdf44cae535cd8b317bf","amp;dn":"Democracy+Now+-+14+dec+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c14cd8b41ed443138ce2fdf44cae535cd8b317bf","infoHashBuffer":{"type":"Buffer","data":[193,76,216,180,30,212,67,19,140,226,253,244,76,174,83,92,216,179,23,191]},"announce":[],"urlList":[]}}