{"title":"AREA 51[238mb]","uid":5624344,"size":249745960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1538186f09614369d981f6daf062a40a2e74e47&amp;dn=AREA+51%5B238mb%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bulletzz74","files":4,"time":1276419110,"description":"As the title would suggest, Area 51 takes place at that infamous military installation, where the US government supposedly houses all its secret alien technologies picked up after the Roswell, New Mexico, incident of the 1940s. As one might expect, for this to be much of a game, something has to go horribly wrong; and indeed, it does. You play as Ethan Cole, a HAZMAT operative sent in with his team--a prototypically ragtag bunch--to assess some manner of viral outbreak within the walls of Area 51. After a gruff meet and greet with the local military personnel, you're sent in guns blazing. What you end up finding is a horde of mutated soldiers, scientists, and other alien creatures wandering about the place, looking to infect and/or kill whatever comes their way. Oh, and there's also a whole bunch of nonsense involving the Illuminati, psychics, those little bigheaded, gray-skinned aliens we've all come to know and love, and a whole lot of crazy conspiracies thrown in to the mix. But frankly, all that stuff is utterly incoherent, and it just gets in the way of you shooting more ugly mutants. \n\nINSTRUCTIONS: 1) Run &quot;Unpak.bat&quot; to unpack dataz (4 gb free required)\n\n              2) Run &quot;A51.exe&quot; to play game.\n\n\nPLEASE SEED AFTER YOUR DONE","torrent":{"xt":"urn:btih:c1538186f09614369d981f6daf062a40a2e74e47","amp;dn":"AREA+51%5B238mb%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1538186f09614369d981f6daf062a40a2e74e47","infoHashBuffer":{"type":"Buffer","data":[193,83,129,134,240,150,20,54,157,152,31,109,175,6,42,64,162,231,78,71]},"announce":[],"urlList":[]}}