{"title":"Sid Meiers Civilization V","uid":6148377,"size":3308550510,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c66ddf6ad2828ac6f469615b4c43ba2cb4735b1c&amp;dn=Sid+Meiers+Civilization+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"haabaa","files":-1,"time":1296776188,"description":"\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the game release information:\n\nBecome Ruler of the World by establishing and leading a\ncivilization from the dawn of man into the space age: Wage\nwar, conduct diplomacy, discover new technologies, go\nhead-to-head with some of historys greatest leaders and build\nthe most powerful empire the world has ever known.\n\nINVITING PRESENTATION: Jump right in and play at your own pace\nwith an intuitive interface that eases new players into the\ngame. Civ veterans will appreciate the depth, detail and\ncontrol that are highlights of the series.\n\nBELIEVABLE WORLD: Ultra realistic graphics showcase lush\nlandscapes for you to explore, battle over and claim as your\nown. Art deco influences abound in the menus and icons in the\nmost well-designed Civ ever developed.\n\nCOMMUNITY &amp; MULTIPLAYER: Compete with Civ players all over the\nworld or locally in LAN matches, mod the game in\nunprecedented ways, and install mods directly from an in-game\ncommunity hub without ever leaving the game. Civilization V\nbrings community to the forefront.\n\nWIDE SYSTEM COMPATIBILITY: Civilization V operates on many\ndifferent systems, from high end DX11 desktops to many\nlaptops. Enjoy unlimited installations on multiple PCs with\nyour Steam account and take your Civ V experience with you\neverywhere you go.\n\nALL NEW FEATURES: A new hex-based gameplay grid opens up\nexciting new combat and build strategies. City States become a\nnew resource in your diplomatic battleground. An improved\ndiplomacy system allows you to negotiate with fully\ninteractive leaders. Custom music scores and orchestral\nrecordings give Civ V the level of polish and quality you\nexpect from the series.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nSupport the companies, which software you actually enjoy\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n","torrent":{"xt":"urn:btih:c66ddf6ad2828ac6f469615b4c43ba2cb4735b1c","amp;dn":"Sid+Meiers+Civilization+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c66ddf6ad2828ac6f469615b4c43ba2cb4735b1c","infoHashBuffer":{"type":"Buffer","data":[198,109,223,106,210,130,138,198,244,105,97,91,76,67,186,44,180,115,91,28]},"announce":[],"urlList":[]}}