{"title":"Thione Seck - Orientation [FLAC] TQMP","uid":5799700,"size":409767131,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6b82e983d87bb3c97e52682721ba31986b5619e&amp;dn=Thione+Seck+-+Orientation+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pastafari","files":-1,"time":1283210166,"description":"Thione Seck - Orientation\nEgypt - India - Senegal\n2005\n\nBBC Radio 3 World Music Awards\nNominee for Best Album of the Year\n\nKudos to syliphone for this one!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nBiography\n\nThione Ballago Seck's spiritually charged, hard-driving music is a revelation. It's no surprise that Senegalese singers Youssou N'Dour and Baaba Maal are known around the world. But on sheer merit, Seck, who completed his 26th album Allo Petit in 2001, should be right up there with them. \n\nThione Seck descends from a line of griots--traditional praise singers and musicians--who sang for Lat Dor, the king of Kaylor who lead the Wolof people's resistance against the French in the 19th century. Seck began singing when he was twelve, and had a bit of a reputation in the local griot circuit during the late 1960s. When Dakar's legendary Orchestre Baobab formed in 1970 to play at the ritzy new Baobab club, they looked for a singer who could blend the blustery power of griot vocals with the pump and swing of Afro-Cuban music. They wanted to add a distinctly local element to their largely borrowed vocal sound. The search led to a Wolof griot named Laye Mboup, but in the end it was Mboup's student, the young Thione Seck, who got the job. Seck also sang with another landmark band, the Star Band, denizens of the Miami Club. He also maintained a family group during these years, singing traditional songs to the accompaniment of the xalam spike lute. In 1974, he saw a way to put it all together. Seck left Baobab and formed the group he still fronts today, Raam Daan. He told Afropop Worldwide, &quot;Raam Daan means to achieve your goal, go easy and you will achieve it. But it is also inspired by the word Ramadan.&quot; That's the annual Muslim season of religious fasting. This play on words gives a small hint of the rich, multi-layered philosophy contained in Seck's song lyrics. The music itself requires no translation. Raam Daan plays mbalax music pur et dur (&quot;pure and strong&quot;). The sharp crack of sabar drums is the center of the band's electrifying percussion sound. Two guitars, two keyboards, bass and trap drums fill out the mix. But the thing that sets Seck apart is the way he sings floating, distracted, ethereal melodies over those tight, taught, driving grooves. \n\nSeck says that a childhood fascination with Hindu films led him to favor Eastern modes. He told Afropop, &quot;It's like the scales of the Spanish, Hindu, Greek, Arab musicians. Each time I compose a song, I put a few notes from this eastern scale, because that's what I love the most.&quot; The contrast between the band's edgy alertness and Seck's air of spiritual intoxication is likely to raise the hair on your spine. There is nothing quite like it in African pop music.\n \nThough Seck has so far escaped international celebrity, he remains a huge figure in Senegal. He's a particular favorite of the diriyanke, the beautifully robed and powerful women of Dakar, and his frequent live shows, particularly in Dakar's Sahel Club, generally produce a full house.\n-- afropop.org \n\nReviews\n\nOrientation is a perfect gem. Sometimes musicians fuse forms because their producers tell them it will sell records and sometimes they do it because they are driven by artistic intent. In Thione's case, he is exposing the influences that have been there in his music all along.\n\nAs a child, Thione would listen to his father's records of Egyptian stars like Abdel Halim Hafez and Oum Kalsoum and he would watch the many Bollywood films shown in the local cinemas. As a musician, the powerful call to prayer is a starting point for many vocalists and as a composer he told Afropop, &quot;It's like the scales of the Spanish, Hindu, Greek, Arab musicians. Each time I compose a song, I put a few notes from this eastern scale, because that's what I love the most.&quot;\n\nIronically, the project began in 1999 and would have been released years before Youssou N'Dour's Egypt but for licensing issues and Thione Seck's French label going bust. \n\nWith the help of some prodding by his producer Ibrahima Sylla and musical director Fran?ois Br?ant, who arranged studio time in Paris, Madras and Cairo and ensured the pick of the local talent in each location, Thione Seck was able to realise his labour of love. \n\nThe results are classics like 'Ballago', that stake out a whole new world where earthy Afro meets epic Asian. Soaring and poignant vocals by Thione Seck set off by uplifting backing voices and sitar counterpoised with a percussive beat feast. Seck's voice so naturally conveying this Eastern feel that the categories effectively collapse. When joined by Bombay Jay on 'Assalo' the effect is just as intoxicating.\n\nThe same seamless marriage occurs on the tracks with Rehab from Egypt ('Yaye' and 'Woyatina'). While these tracks invite the most direct comparison with his fellow countryman Youssou N'Dour, they are every bit as good. Taken alongside the other tracks on this album, it has to be said that Thione has produced the better of the two records.\n\nRemarkably, despite worldwide success as the singer for Orchestra Baobab and a local following that has led him to release no fewer than 40 albums in Senegal, this marks only his third international release. Perhaps he has been unlucky in releasing his work after the much talked about Egypt but you should make room in your collection for this one.\n\nOrientation is in short a modern classic and a milestone in global music culture.\n-- flyglobalmusic.com\n\nThione Seck is one of Senegal's most popular and cherished singers. Despite a long and prolific career at home, and an astonishingly beautiful and sensual tenor voice, he is not well known outside his own country. His vocal style is steeped in his own Wolof griot tradition - he comes from a celebrated griot lineage - as well as the styles of Indian film song and Arabic music that he grew up listening to in Dakar. His few international releases, such as Daaly (1997) feature the high-speed mbalax cluttered with frenetic keyboards and sabar drums, that has made him so popular with Senegalese audiences. But his voice is most glorious when in devotional or griot ballad mode, as on the wonderful &quot;Mouhamadou Bamba&quot; (1981) by Orchestra Baobab with Seck on guest vocals, and his acoustic album Chauffeur Bi from the early 80s. Orientation is his first international release since 1997, and is one of the most ambitious projects to come out of Africa in recent years, connecting the Wolof griot tradition, especially the ballads, not westwards but eastwards, on an unprecedented journey through Paris, Egypt and finally south India. And it really works - certainly as well as Youssou N'Dour's award-winning album Egypt, with which comparisons are inevitable. But Orientation uses a much wider oriental palette, with an explosive chemistry. Best of all is the gloriously luxuriant voice of Rehab, a young Egyptian female singer, coiling like a snake around Seck's impassioned vocals on &quot;Yaye&quot; and &quot;Woyatina&quot; over Wolof xalam (lute), sabar, Egyptian violins and qanun, and a female chorus. \n\nA long-awaited and profoundly fabulous album.\n-- SongLines\n\nTrack List\n01 - Siiw (Celebrity)\n02 - Yaye (Mother)\n03 - Blain Djiqueul (The death of a close friend)\n04 - Woyatina (I am talking to you)\n05 - Mapenda (Tribute to a friend)\n06 - Manmignoul (Ode to the color black)\n07 - Ballago\n08 - Assalo (Candle games)\n09 - Mouhahibou (Sacred text)\n10 - Djirim (The orphan)\n11 - Doom (The child)\n12 - Mouhamadou Bamba\n\nArtwork and EAC log included. Sorry, no CUE sheet.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:c6b82e983d87bb3c97e52682721ba31986b5619e","amp;dn":"Thione+Seck+-+Orientation+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6b82e983d87bb3c97e52682721ba31986b5619e","infoHashBuffer":{"type":"Buffer","data":[198,184,46,152,61,135,187,60,151,229,38,130,114,27,163,25,134,181,97,158]},"announce":[],"urlList":[]}}