{"title":"Singing Revolution","uid":4459542,"size":800279385,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8bc45adfea311c0fa26929b497896f864535e8f&amp;dn=Singing+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lucas5","files":2,"time":1224633795,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0954008/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0954008/&lt;/a&gt;\n\n\n&quot;The Singing Revolution&quot; (Estonian title: &quot;Laulev revolutsioon&quot;) was screened in its Canadian Premiere as the main Gala film of the 3rd Annual estdocs Estonian Documentary Film Festival in Toronto on Sunday Oct. 21, 2007 at the Ontario Science Centre Auditorium.\nThe evening opened with welcoming words from festival organizers Ellen Valter and Lia Hess and the introduction of film co-director Maureen Castle Tusty who explained that her husband and film co-director James Tusty was not able to make it to the Toronto screening as he was representing the film at its simultaneous Polish premiere at the Warsaw Film Festival. Maureen Castle Tusty then introduced former Estonian Prime Minister Mart Laar who was a special guest for the evening and who also played a prominent role in the events of the film during his early years in the Estonian Heritage Society.\nEven though the audience in the hall was a large cross-section of local Estonian-Canadians for many of whom the main events of the film were a well-known part of our recent international history, I think everyone was genuinely impressed by the high standard of care and craftsmanship that the filmmakers put on display in their film which was screened in a crystal sharp high definition image.\nThe film delivers a lot of densely packed information on Estonia&amp;#039;s recent history from the Communist/Nazi Molotov-Ribbentrop Pact of 1939 that effectively delivered Estonia into the repressive dictatorship of Joseph Stalin&amp;#039;s Soviet Regime to the most recent Song Festival(&quot;Laulupidu&quot;) of 2004. More time is spent on the early years of the Russian occupation in the 1940&amp;#039;s as it was then when the terror of the occupiers was at its fullest. The film then leaps ahead to the years of the mid to late 1980&amp;#039;s when Mikhail Gorbachev&amp;#039;s &quot;perestroika&quot; (economic restructuring) &amp; &quot;glasnost&quot; (open-ness/free speech) opened the way for Estonian national movements such as the Estonian Independence Party, the Popular Front and the Estonian Heritage Society to test the limits that would be allowed before a further brutal oppressive crackdown began. Their steady probing and persistence made tiny Estonia a leading element on the way to the eventual breakdown and breakup of the Soviet empire. Along the way, the role of Estonian music in general and the ongoing National Song Festival in particular, are shown as a force that kept hope for independence alive from as early a date as 1947 when Estonian composer/conductor Gustav Ernesaks was able to sneak his song &quot;My Fatherland is My Love&quot; into the new Soviet Republic&amp;#039;s first post-occupation Song Festival.\nAlthough the subject matter is overall one of a very serious nature there are still several moments of humour in the film such as one Russian babushka&amp;#039;s complaints about how &quot;I&amp;#039;m ashamed of Estonians, they are so sly. Face to face they&amp;#039;re so nice to you, but they stab you in the back when you turn.&quot; Fans of the writers Andrus KivirÃƒÂ¤hk and Oskar Luts were also rewarded with anecdotes such as narrator Linda Hunt extolling the clever &quot;Old Farmer of the Barn&quot; (Estonian &quot;Rehepapp&quot; - also the title &amp; subject of a recent novel by KivirÃƒÂ¤hk) as the Estonian national hero in place of conventional mythological warriors and conductor Tiia-Ester Loitme lamenting the loss of her balloon in the Song Festival Parade with the words &quot;Minu nunnu lendas minema!&quot; (&quot;My precious has flown away!&quot;) (this last one evokes Luts&amp;#039; immortal comic play &quot;Kapsapea&quot; (&quot;The Cabbage Head&quot;). It was a pleasure as well to hear Popular Front leader (&amp; otherwise artist/cartoonist) Heinz Valk tell the stories of how he coined the phrases &quot;Laulev revolutsioon&quot; (Singing Revolution) and &quot;ÃƒÅ“kskord me vÃƒÂµidame niikuinii!&quot; (One day, we will win regardless!) with which he forever afterwards had to end his speeches, to audience shouts of &quot;Say it Heinz! Say it!!&quot;. So there were many subtle chuckles to be enjoyed from the movie also.\nThe 475-seat hall was totally sold out for the occasion and the film was warmly received with a unanimous standing ovation at its conclusion. I&amp;#039;ll admit to a huge personal bias here because of my Estonian heritage, but I find it hard to believe that anyone who supports movements of self-government and national independence and basic human rights in this day and age would not be moved by this wonderful film. Thanks to Maureen and James Tusty for their vision and their efforts to bring this story to the screen and to the world.\nOct. 28, 2007 Update: The 3rd Annual estdocs Festival ended on Oct. 26, 2007 and it was announced that &quot;The Singing Revolution&quot; won both the Audience Favourite and the Jury Prize for the week-long festival. ","torrent":{"xt":"urn:btih:c8bc45adfea311c0fa26929b497896f864535e8f","amp;dn":"Singing+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bc45adfea311c0fa26929b497896f864535e8f","infoHashBuffer":{"type":"Buffer","data":[200,188,69,173,254,163,17,192,250,38,146,155,73,120,150,248,100,83,94,143]},"announce":[],"urlList":[]}}