{"title":"Kevin Baker-The Big Crowd","uid":11599126,"size":366324368,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c9189f210127d76b1baca73be7a48cc6ed6e669e&amp;dn=Kevin+Baker-The+Big+Crowd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twocows","files":46,"time":1417320231,"description":"Based on one of the great unsolved murders in mob history, and the rise-and-fall of a real-life hero, The Big Crowd tells the sweeping story of Charlie O' Kane. He is the American dream come to life, a poor Irish immigrant who worked his way up from beat cop to mayor of New York at the city' s dazzling, post-war zenith. Famous, powerful, and married to a glamorous fashion model, he is looked up to by millions, including his younger brother, Tom. So when Charlie is accused of abetting a shocking mob murder, Tom sets out to clear his brother' s name while hiding a secret of his own. The charges against Charlie stem from his days as a crusading Brooklyn DA, when he sent the notorious killers of Murder, Inc., to the chair-- only to let a vital witness go flying out a window while under police guard. Now, out of office, Charlie lives in a shoddy, Mexico City tourist hotel, eaten up with regrets and afraid he will be indicted for murder if he returns to the U.S. To uncover what really happened, Tom must confront stunning truths about his brother, himself, and the secret workings of the great city he loves. Moving from the Brooklyn waterfront to city hall, from the battlefields of World War II to the beaches of Acapulco, to the glamorous nightclubs of postwar New York, The Big Crowd is filled with historical powerbrokers and gangsters, celebrities and socialites, scheming cardinals and battling, dockside priests. But ultimately it is a brilliantly imagined, distinctly American story of the bonds and betrayals of brotherhood","torrent":{"xt":"urn:btih:c9189f210127d76b1baca73be7a48cc6ed6e669e","amp;dn":"Kevin+Baker-The+Big+Crowd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9189f210127d76b1baca73be7a48cc6ed6e669e","infoHashBuffer":{"type":"Buffer","data":[201,24,159,33,1,39,215,107,27,172,167,59,231,164,140,198,237,110,102,158]},"announce":[],"urlList":[]}}