{"title":"doktorn kan komma 50-54.rar","uid":4615193,"size":7544842070,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9af8457f22195a4efc5d658597d5df479eedf77&amp;dn=doktorn+kan+komma+50-54.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fiskkatten","files":1,"time":1230803959,"description":"Avsnitt 50 till 54\n\n\n50. Repeat performance\nPreparations for the bicentenial are in full swing, just as preparations for Sam and Emma's wedding. Chris gets stuck somewhere with a sick girl because of bad weather conditions. The only transport she can get is a donkey. Sam, Kate and Geoff are just on time for the ceremony and Kate catches the wedding bouquet.\n\n\nSeason 3\n\n51. The noble art \nSome boxers come to Coopers Crossing. Johnny Lawrence is one of them. He was the champion some years ago and is very much set to a come-back. He develops some kind of crush on Kate. During a fight, Johnny loses consiousness. It is discovered that he has problems with his heart and he may never box again. At first he is very angry about it, but later on he decides to buy a farm and become a farmer. He asks Kate to go with him, but she refuses.\n\n52. Sapphire \nSapphire is a woman who is married and lives with her husband and his sister. Her husband is a lot older than her and everyone thinks Sapphire is after his money. Meanwhile the sister is poisoning her brother but has convinced the farm hand that Sapphire is doing it.\n\n53. Cries from the heart \nA man and his 8yr old daughter Tracy are in a car crash and Tracy wanders off. A woman reports to Jack that she has met the girl but Jack doesn't believe her as there is no evidence of a child having been in the car, and the woman has been reporting for years a child is crying in the bush as her own 8yr old daughter Laura died. When Tracy's father regains conciousness and asks for Tracy, Jack is distraught as he blames himself for Laura's death. Chris comforts Jack and later the girl is found alive. \n\n54. All in a day's work \nIt's inspection time at the base and the inspector hasn' t arrived. The team is busy flying around the district and are unable to make the clinic run. Guess who's at the clinic run? The inspector. Eventually she arrives at the base by the mail plane but when she is talking to Geoff he falls asleep. Jack falls in love with Chris.\n\n\n\n\nGlÃƒÂ¶m inte att seeda","torrent":{"xt":"urn:btih:c9af8457f22195a4efc5d658597d5df479eedf77","amp;dn":"doktorn+kan+komma+50-54.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9af8457f22195a4efc5d658597d5df479eedf77","infoHashBuffer":{"type":"Buffer","data":[201,175,132,87,242,33,149,164,239,197,214,88,89,125,93,244,121,238,223,119]},"announce":[],"urlList":[]}}