{"title":"F.H.E. DINOSAUR! Hosted by Christopher Reeve.mpg","uid":8800279,"size":3044474880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ca694c848815a738d3f7da41244fa1c52115fbe3&amp;dn=F.H.E.+DINOSAUR%21+Hosted+by+Christopher+Reeve.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DinoLuigi","files":1,"time":1376182196,"description":"DINOSAUR!\n\nONE OF THE BEST DINOSAUR DOCUMENTARIES EVER!\n\nDirected by Robert Guenette and written by Steven Paul Mark Dinosaur! was hosted by American actor Christopher Reeve, who became famous some years sooner thanks to his leading role of Superman. Jointly with Reeve's narration the documentary shows special effects scenes (which reconstruct dinosaurs and their era) all along with paleontologists interviews, the most famous at the time of the documentary shooting. Some of those paleontologists were Jack Horner and Robert Bakker (Americans) or Phil Currie and Dale Russell (Canadians). The show starts with the mating of Edmontosaurus (identified as Hadrosaurus). The female soon lays a clutch of eggs that are eaten by a Struthiomimus, except for one. When the Struthiomimus eats the egg it stole, it is then hunted and killed by a pair of Deinonychus. The remaining Edmontosaurus egg hatches and grows into a teenage dinosaur. While it is out grazing with its parents, it wanders off and is almost killed by a Tyrannosaurus rex. But the parents hear its cries and knock the Tyrannosaurus over with their strong tails. Next, a herd of Monoclonius is seen grazing. One member wanders off into the forest in search of flowers. Soon night falls, and it tries to find the herd. It soon stumbles upon the remains of a killed hadrosaur and becomes scared. The Tyrannosaurus then ambushes it and bites hard on its back. The Monoclonius breaks free and stabs the Tyrannosaurus in the shin. But all that does is anger the predator. The Monoclonius becomes cornered and is killed by one deadly bite. Next, a herd of Apatosaurus are busy eating from trees. They use their long necks to reach the branches. The next morning, all seems calm. Suddenly, a huge meteorite crashes into Earth and kills the dinosaurs. After that, a small mouse-like mammal is seen climbing out of a dead Tyrannosaurus skull, signaling the start of mammals ruling the Earth.","torrent":{"xt":"urn:btih:ca694c848815a738d3f7da41244fa1c52115fbe3","amp;dn":"F.H.E.+DINOSAUR%21+Hosted+by+Christopher+Reeve.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca694c848815a738d3f7da41244fa1c52115fbe3","infoHashBuffer":{"type":"Buffer","data":[202,105,76,132,136,21,167,56,211,247,218,65,36,79,161,197,33,21,251,227]},"announce":[],"urlList":[]}}