{"title":"Susannah of the Mounties (1939) DVD9 - Shirley Temple. Randolph ","uid":9369110,"size":8216424448,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:caef283742ce1d6ec51475ed34a9b104f69476a1&amp;dn=Susannah+of+the+Mounties+%281939%29+DVD9+-+Shirley+Temple.+Randolph+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1387488620,"description":"Susannah of the Mounties (1939) DVD9 - Shirley Temple. Randolph Scott -  Color and Black.White Versions [DDR]\n\nSusannah of the Mounties is a 1939 American drama film directed by Walter Lang and William A. Seiter and starring Shirley Temple, Randolph Scott, and Margaret Lockwood. \nBased on the 1936 novel Susannah of the Mounties by Muriel Denison, the film is about an orphaned survivor of an Indian attack in the Canadian West who is taken in by a Mountie and his girlfriend. Following additional Indian attacks, the Mountie is saved from the stake by the young girl's intervention with the Indian chief.\n\nCAST:-\nShirley Temple as Susannah Sheldon\nRandolph Scott as Inspector Angus &quot;Monty&quot; Montague\nMargaret Lockwood as Vicky Standing\nMartin Good Rider as Little Chief\nJ. Farrell MacDonald as Pat O'Hannegan\nMaurice Moscovitch as Chief Big Eagle\nMoroni Olsen as Supt. Andrew Standing\nVictor Jory as Wolf Pelt\nLester Matthews as Harlan Chambers\nLeyland Hodgson as Randall\nHerbert Evans as Doctor\nJack Luden as Williams\nCharles Irwin as Sergeant MacGregor\nJohn Sutton as Corporal Piggott[\n\nDirected by  Walter Lang, William A. Seiter\nProduced by Kenneth Macgowan\nScreenplay by Robert Ellis, Helen Logan\nStory by Fidel LaBarba, Walter Ferris\nBased on Susannah of the Mounties (novel) byy Muriel Denison\n\nSONGS:-\n    &quot;In the Gloaming&quot; (Annie Fortescue Harrison, Meta Orred) sung a cappella by soldiers in Supt. Standing's home\n    &quot;I'll Teach You to Waltz&quot; (M.F. Carrey) played on harmonica by J. Farrell MacDonald and sung by Shirley Temple\n    &quot;Down Went McGinty&quot; (Joseph Flynn) sung a cappella by J. Farrell MacDonald\n\nSYNOPSIS:- Susannah of  the Mounties (1939)\nAs the Canadian Pacific Railway makes its way through the western frontier of Canada in the early 1880s, railroad workers and settlers come under frequent attack by Indians who resent the white man's encroachment on their land. One such attack on a wagon train leaves only one survivor of the Indian massacre, a young girl named Susannah Sheldon (Shirley Temple) who is found by a mounted patrol in the command of Inspector Angus &quot;Monty&quot; Montague. The young girl is taken back to the post where she is adopted by Monty and his friend, Pat O'Hannegan (J. Farrell MacDonald). The two men do their best to help the girl overcome her terrible ordeal.\n\nSometime later, Vicky Standing (Margaret Lockwood), the daughter of the Superintendent, arrives from Toronto to visit her father. Monty is immediately enchanted by the beautiful woman. The blossoming romance sparks a rivalry in Susannah and Harlan Chambers (Lester Matthews), the head of the railroad camp. The Indian attacks resume when a band of renegades steals horses from the railroad camp. One of the friendly Indians, Chief Big Eagle, promises to track down the renegades and delivery them to the camp. As a show of good faith, the Chief leaves his son Little Chief at the post.\n\nLittle Chief is soon teaching Susannah the way of the Indians. While the two are out riding one day,they come upon one of the renegades, Wolf Pelt (Victor Jory), attempting to sell his stolen horses to Chambers. The two argue and Chambers threatens the Indians with extinction. Wolf Pelt returns to his tribe and uses Chambers' threats to demand that the tribe go to war against the white man. \n\nThat night, Wolf Pelt raids the post to retrieve Little Chief and kidnaps Monty. Soon after, Big Eagle sends a message demanding that the railroad abandon the area or they will kill Monty.\n\nSusannah decides to search for Monty, and as she approaches the Indian camp she is taken prisoner by the Indians. As the tribe prepares to burn Monty at the stake, Susannah escapes from her teepee and makes an appeal to Big Chief, accusing Wolf Pelt of inciting Chambers by stealing his horses. Wolf Pelt denies the charges. To determine who is telling the truth, Big Chief uses the stick of truth that will point to the liar. When the stick drops towards Wolf Pelt, Big Chief frees Monty and offers him and Susannah his pipe of peace.\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English, Spanish\nRunTime 79 mins\nSubtitles: English, Espanol\nRipped by: Trinidad [DDR]\nDuration: 79 mins","torrent":{"xt":"urn:btih:caef283742ce1d6ec51475ed34a9b104f69476a1","amp;dn":"Susannah+of+the+Mounties+%281939%29+DVD9+-+Shirley+Temple.+Randolph+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caef283742ce1d6ec51475ed34a9b104f69476a1","infoHashBuffer":{"type":"Buffer","data":[202,239,40,55,66,206,29,110,197,20,117,237,52,169,177,4,246,148,118,161]},"announce":[],"urlList":[]}}