{"title":"Get Carter.avi","uid":4977430,"size":680525776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb1aafedad300b16686b220bd0edf1997e5d5c63&amp;dn=Get+Carter.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"steveg32","files":1,"time":1246072205,"description":"Is it? It's certainly the cornerstone of Michael Caine's extremely distinguished career, with the great man proving icy, formidable and utterly unforgettable as Jack Carter, a London-based gangster travelling up to a bleak, industrial Newcastle to find out the truth about his brother's death. We probably expect Caine to be excellent unless the material around him is overwhelmingly bad, and even then he can remain watchable. But he's surpassingly brilliant here.\n\nThere are some good supporting turns too, from Petra Markham as Carter's much-abused niece (or is it his daughter?) Doreen. Geraldine Moffatt as Glenda - who nearly matches Carter for casual amorality - and the painfully underrated George Sewell. The most interesting presence is John Osborne as local crimelord Kinnear, and it's Osborne's presence that I think is central to understanding 'Get Carter', what it stands for and why it's still both misunderstood and infinitely better than its legion of imitators.\n\nOsborne broke the conventions of British theatre in the 1950s with his 'Angry Young Man' melodramas such as 'Look Back In Anger', and his (surprisingly good) performance points to the attitude director Mike Hodges takes towards his material here. 'Get Carter' is less of a gangster thriller and more of a social realist drama, taking a whirlwind tour of Newcastle and the surrounding regions, sometimes alighting at a beautiful pastoral landscape but more frequently stopping off in dingy bookkeepers, pubs with paint peeling off the walls and streets full of identical red-brick houses. As with his more recent films 'Croupier' (1998) and 'I'll Sleep When I'm Dead' (2003), Hodges has an unerring knack for conveying the feel of a location to the audience, a trait which becomes particularly resonant for any Newcastle natives watching this movie today and noting that the gritty, sleazy Newcastle of the 1970s may as well be on a different planet to the shiny, trendy Newcastle of today.\n\nIt seems odd to call such a well-loved film misunderstood and under-appreciated, but it is, on both counts. It's misunderstood in Britain because its canonization as a classic came during the 'New Lad' era of the mid-90s. The defining film of that movement is Guy Ritchie's 'Lock, Stock and Two Smoking Barrels' (1998), a film as different from 'Get Carter' as two British gangland movies can be. Ritchie, along with his media cohorts, is selling a nostalgic ideal of gangsterism as a hip and fashionable lifestyle with all the objectionable bits bleached out. Hodges, who is old enough to remember what London was like under the Krays, has no truck with such sentimental rubbish, and so 'Get Carter' is probably the least glamorous gangster film ever made. You'd cross the road to avoid Jack Carter, and the film never soft-sells his capacity for horrifying brutality - often towards women. This is gangland Britain as it was, rather than as people would like to think it is.\n\nCertainly, Carter's sexual prowess is enviable - he sleeps with practically every female character in the film - but little of it looks enjoyable. Sex in Get Carter is often mechanical and pointless, sometimes interrupted by violence and, in the film's most celebrated sex scene (with a cameo appearance by Britt Ekland), so mundane it can be achieved without Caine moving a muscle. Hodges' attitude is absolutely take-no-prisoners, and the overwhelming grimness and brutality of Get Carter (aided by Roy Budd's chillingly minimal score) is still striking today.\n\nWhich probably leads to the second reason Get Carter is under-appreciated - its American reception was and is surprisingly cold. Surprising because just a few years later those same critics would be praising Scorsese's 'Taxi Driver' (1976), a very similar film that subverts the conventions of the crime movie into something more disturbing and naturalistic, and even shares some of 'Get Carter's darker themes. Even when the misconceived Stallone remake came out in 2000, some critics were still puzzling over why a nasty little British thriller that few people had seen would be considered worthy for a remake - as opposed to the British reaction to that later film, which was outrage at a national treasure defiled.\n\nPerhaps it's a question of context - whereas American critics could appreciate how real 'Taxi Driver' was as a portrait of the worse areas of 1970s New York, they had no such context for 'Get Carter', seeing only the brutality and amorality without any of the redeeming social observation. They wanted a gangster film, but it's more than that, a whole lot more. Either way, whether you love it, like it or have never seen it before, it's always worth dusting off and taking a look at the film behind the myth. The myth is seductive. The film is better. ","torrent":{"xt":"urn:btih:cb1aafedad300b16686b220bd0edf1997e5d5c63","amp;dn":"Get+Carter.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb1aafedad300b16686b220bd0edf1997e5d5c63","infoHashBuffer":{"type":"Buffer","data":[203,26,175,237,173,48,11,22,104,107,34,11,208,237,241,153,126,93,92,99]},"announce":[],"urlList":[]}}