{"title":"24c3-2245-en-how_to_reach_digital_sustainability.mkv","uid":3953177,"size":95866312,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cca494f7a909ee931391835279bddf573c36da59&amp;dn=24c3-2245-en-how_to_reach_digital_sustainability.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"num42","files":1,"time":1198974965,"description":" &lt;a href=&quot; http://events.ccc.de/congress/2007/Fahrplan/events/2245.en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://events.ccc.de/congress/2007/Fahrplan/events/2245.en.html&lt;/a&gt;\n\nSpeakers: Meike Richter\n\n\nDigital Sustainability\n\nScarcity is Entering the Net\n\nHappy digital world: Everything is information, and it grows by sharing. Scarcity seems to be a problem of the &quot;meatspace&quot;. On the internet, there is space for everybody, for every activity and for every opinion. Really? This lectures explores the power of intellectual property rights, the principle of net neutrality and surveillance issues and explains their impact on everyday (digital) life. The net as we know it is in danger. What is needed to make it stay a resource which is valuable, open and free for everybody? How could a concept of digital sustainability look like?\n\nWhat makes life worth living happens more and more online: We communicate with friends, look for entertainment, find information. The net functions as our outsourced brain ? everything we need to know we can google. The digital data space is our inexhaustible resource. This is about to change. Politics and entertainment industry do not accept free copying as a main characteristic of the net, but as a threat, because the net destroys business models which are designed for the analogue world. But instead of developing new models, these forces try to control and reshape the net after their private interests ? e.g. with the help of intellectual property rights (IPR) like copyright.\n\nThese laws form the frame of what people are allowed to do on the net: distribute music, give access to teaching materials, express opinions, play around with digital technologies and software. &quot;The intellectual property regime could make - or break - the educational, political, scientific and cultural promise of the net&quot;, wrote law-professor James Boyle 10 years ago. He asked for a broad political movement in order to keep the web as we love it. But today still, only a small circle of people discusses these issues.\n\nIPR are not the only threat: As the principle of net neutrality is eroding, certain content and applications are discriminated, the flow of information slows down. Excessive surveillance of digital data spaces is responsible for the fact that political engagement freezes. This lectures outlines what&amp;#039;s at stake and explores how a concept of digital sustainability could look like.","torrent":{"xt":"urn:btih:cca494f7a909ee931391835279bddf573c36da59","amp;dn":"24c3-2245-en-how_to_reach_digital_sustainability.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cca494f7a909ee931391835279bddf573c36da59","infoHashBuffer":{"type":"Buffer","data":[204,164,148,247,169,9,238,147,19,145,131,82,121,189,223,87,60,54,218,89]},"announce":[],"urlList":[]}}