{"title":"Monsters 2010 Bluray AVCHD 1080p x264 ac3 HD-R-US","uid":6137623,"size":4666910607,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d0e6d28f8b291449b430ae008971eb1f138c3cc9&amp;dn=Monsters+2010+Bluray+AVCHD+1080p+x264+ac3+HD-R-US&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HD-R-US","files":5,"time":1296372251,"description":"\n                            &lt;a href=&quot; http://bayimg.com/oAdgBaADJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/oAdgBaADJ&lt;/a&gt;\n\nMovie Title..: Monsters\nRelease......: 03/12/2010\nGenre........: Drama / Sci-Fi / Thriller\nIMDb Rating..: 6.5/10\nRun Time.....: 94 minutes\nSource.......: HD 1080p Bluray\n\n--------------\n\nRe-encoder...: HD-R-US\nFormat.......: HD 1080p Bluray / AVCHD\nVideo........: x264 (3-pass) / 5552kbps (average)\nResolution...: 1920 x 1080\nAudio........: English / ac3 / 6 Channels / 640kbps\nSubtitles....: English (unforced) / Croatian (unforced)\n\n-------------------------------------------------------------------------------------\n\nI M P O R T A N T   I N F O R M A T I O N\n\nBy using ImgBurn and selecting &quot;Write image file to disc&quot;, this iso can be burnt straight to a DVD5 disc to be played back on any stand-alone, AVCHD compatible, Blu-ray or DVD-HD player, including PS3. Please note that regular DVD players are incapable of rendering Hi-Definition video, so they will NOT play this movie without re-encoding it.\n\nAlternatively, if you want to stream the movie or watch it on your computer, Daemon Tools virtual drive can be used to mount the image file, or PowerISO v4.5 or any later version can be used to extract the files and folders from the iso. This is a blu-ray/AVCHD iso, not a DVD iso, so applications like WinRAR or MagicISO will NOT recognise it. The movie file itself will be located in the BDMV/STREAM folder, and will be named &quot;00000.m2ts&quot;. Once extracted, if you decide to save the movie by burning it onto a DVD5 disc, your ImgBurn settings need to be as follows:-\n\nClick &quot;Write files/folders to disc&quot;\nAdd both the BDMV and CERTIFICATE folders\nSelect the Options Tab-\nData Type = MODE1/2048\nFile System = UDF\nUDF Revision = 2.50\nMake sure that the &quot;Recurse Subdirectories&quot; field IS checked, and all other fields are NOT checked.\nInsert your DVD5 disc and click Burn.\n\nThe relevant codecs need to be installed to watch any HD movie on your computer. K-Lite's codec pack is free to download, but there are numerous others.\n\nThis disc image includes the PGS stream subtitles that are listed above, but unless they are marked as being hard-coded, they will NOT display if you watch the movie on your computer, hence why we have also included .srt format subtitles so that you can add/load then to your media player manually if required.\n\nFair warning - Many computers will struggle to render Hi-Def video smoothly unless they're up-to-date and/or fast, so if the movie is sluggish or out-of-sync, don't worry; it's your hardware, not us! (=\n\n-------------------------------------------------------------------------------------\n\nOur releases are in this format for a reason - it is the most all-round, usable format for streaming, watching on a computer, and has file/folder structure for burning to disc, but it will suit some people more than others. If you don't like the format, then get over it, and move on - you can whine all you like, we are not changing it.\n\nFor anyone else, your feedback is appreciated, and please give back at least what you take - it's what keeps this community alive.\n\nThanks and enjoy!\n\nHD-R-US\n\t","torrent":{"xt":"urn:btih:d0e6d28f8b291449b430ae008971eb1f138c3cc9","amp;dn":"Monsters+2010+Bluray+AVCHD+1080p+x264+ac3+HD-R-US","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e6d28f8b291449b430ae008971eb1f138c3cc9","infoHashBuffer":{"type":"Buffer","data":[208,230,210,143,139,41,20,73,180,48,174,0,137,113,235,31,19,140,60,201]},"announce":[],"urlList":[]}}