{"title":"Lady Antebellum - Need You Now   (2nafish)","uid":5175830,"size":162957316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d14f3610dc6a1f7c2890f3505ae8fc76dda934d6&amp;dn=Lady+Antebellum+-+Need+You+Now+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1258972778,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Need You Now&quot; is the title of a country music song recorded by American country music group Lady Antebellum. It serves as the lead-off single and title track to their upcoming second studio album, which is expected for release on January 26, 2010.\n\nDavid McClister directed the song's music video, which features all three members of Lady Antebellum acting out scenes related to the storyline. This video was filmed in Toronto, Ontario.\n\n&quot;Need You Now&quot; reached #1 on the Canadian Radio &amp; Records Country Singles for the week dated October 16, 2009. It became their second Number One hit on the Hot Country Songs chart on the chart dated November 28, 2009. It has also reached the Top 10 of the Billboard Hot 100 so far peaking at #5.\n\n&quot;Need You Now&quot; has received positive reviews from music critics. The song received a &quot;thumbs up&quot; review from Jim Malec of the 9513. He said that although Charles Kelly's voice had a &quot;surprisingly stuffy tone,&quot; lead singer Hillary Scott's voice fit perfectly for dark songs like &quot;Need You Now.&quot; He said that both singers had a rawness in their voices that made the song feel real. It also received a positive review from Ken Tucker of Billboard, who said, &quot;the song finds alto Scott trading lead vocals with a soulful Kelley, and it will connect with anyone who's ever dumped a significant other and regretted it in the early morning hours.&quot; Bobby Peacock of Roughstock gave a positive review as well, saying that the traded-off lead vocals gave the song &quot;more depth,&quot; and that both Kelley and Scott sang more strongly than on the debut album.\n\nThe three group members, along with Josh Kear wrote this song about yearning for companionship in the middle of the night, as explained in the chorus:\n\n    It's a quarter after one, I'm all alone\n    And I need you now\n    Said I wouldn't call but I've lost all control\n    And I need you now\n    And I don't know how I can do without\n    I just need you now\n\nHillary Scott explained that this song, and many others on their second album, &quot;are about what we are learning as we go through the ups and downs of different relationships.&quot; She added: &quot;All three of us know what it's like to get to that point where you feel lonely enough that you make a late night phone call that you very well could regret the next day. But you do it anyway because it's the only thing that's going to give you any relief in that moment.&quot; \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d14f3610dc6a1f7c2890f3505ae8fc76dda934d6","amp;dn":"Lady+Antebellum+-+Need+You+Now+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14f3610dc6a1f7c2890f3505ae8fc76dda934d6","infoHashBuffer":{"type":"Buffer","data":[209,79,54,16,220,106,31,124,40,144,243,80,90,232,252,118,221,169,52,214]},"announce":[],"urlList":[]}}