{"title":"Lord of War -WS- Dizzle","uid":4964889,"size":4626259905,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d15bff3f937446b199800785f81eff034d5862ba&amp;dn=Lord+of+War+-WS-+Dizzle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"therealDIZZLE","files":30,"time":1245486304,"description":"\n\nTitle:\t\tLord of War\nLanguages:\tEnglish\nSubtitles:\tEnglish, Spanish\nIMDB: &lt;a href=&quot;\thttp://www.imdb.com/title/tt0399295/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.imdb.com/title/tt0399295/&lt;/a&gt;\n\n\n  All my up's are burn-tested, and are of the best quality I can provide.  I have hundreds more [close to 600 store-bought], and occasionally it's a bit difficult to keep track of what I have versus what's already out here.  Hopefully I don't step on anyone's toes; just trying to give back to the community.\n  That said, enjoy... and please seed!\n  Questions &amp; comments are always welcome.\n\n--Dizzle\n\n\n  The lethal business of arms dealers provides an electrifying context for the black-as-coal humor of Andrew Niccol's Lord of War. Having proven his ingenuity as the writer of The Truman Show, and writer-director of Gattaca and the under-appreciated Simone, Niccol is clearly striving for Strangelovian relevance here as he chronicles the rise and inevitable fall of Yuri Orlov (Nicolas Cage), a Ukrainian immigrant to America who makes his fortune selling every kind of ordnance he can get his amoral hands on. With a trophy wife (Bridget Moynahan) who's initially clueless about his hidden career, and a younger brother (Jared Leto) whose drug-addled sense of decency makes him an ill-chosen accomplice, Yuri traffics in death the way other salesman might push vacuum cleaners (he likes to say that alcohol and tobacco are deadlier products than his), but even he can't deny the sheer ruthlessness of the Liberian dictator (a scene-stealing Eamonn Walker) who purchases Orlov's &quot;products&quot; to expand his oppressive regime. Niccol's themes are even bigger than Yuri's arms deals, and he drives them home with a blunt-force lack of subtlety, but Cage gives the film the kind of insanely dark humor it needs to have. To understand this monster named Yuri, we have to see at least a glimpse of his humanity, which Cage provides as only he can. Otherwise, this epic tale of gunrunnng would be as morally unbearable as the black market trade it illuminates.","torrent":{"xt":"urn:btih:d15bff3f937446b199800785f81eff034d5862ba","amp;dn":"Lord+of+War+-WS-+Dizzle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d15bff3f937446b199800785f81eff034d5862ba","infoHashBuffer":{"type":"Buffer","data":[209,91,255,63,147,116,70,177,153,128,7,133,248,30,255,3,77,88,98,186]},"announce":[],"urlList":[]}}