{"title":"Turbo Launch 5.1.1-serial incl","uid":4889368,"size":1125837,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d4fa9d5b6b47c4559ba32809e6f3ff0cce5aeccd&amp;dn=Turbo+Launch+5.1.1-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jmb2012","files":2,"time":1241891266,"description":"TurboLaunch 5.1.1: Key Features\n\n    * Fully configurable buttons provide single-click access to all of your favorite programs. No more navigating through the countless cascading menus in the Start Button!\n    * The number of rows and columns of buttons can be customized to suit your specific needs.\n    * Buttons can be organized into groups, and they can be resized for greater visibility or to save valuable screen space.\n    * Each button can be configured to run any program, document, shortcut, folder, or drive.\n    * Buttons may be configured to perform certain pre-programmed actions, such as rebooting the system, activating the screen saver, shutting down, and more.\n    * Network connections (such as the Internet or a VPN connection) can be established and disconnected.\n    * A Shortcut Key can be assigned to a button for extremely rapid launching with just a quick keyboard command.\n    * Comprehensive online help and an uninstall option.\n\nAdvanced Features\n\n    * Automatic extraction of a program's default icon for use as a picture on the button.\n    * The icon used as the picture on a button is fully configurable: any icon out of any file may be used!\n    * Objects such as programs, documents, shortcuts, folders, or drives may be dropped onto any button to quickly configure TurboLaunch.\n    * Parameters, working folders, window styles, and descriptions are completely configurable.\n    * A Shortcut Key can be assigned to a button for extremely rapid launching with just a quick keyboard command.\n    * 16-bit Windows programs may be run in separate memory spaces for greater multitasking efficiency and crash protection.\n    * Dynamic Parameter tokens lets you specify all or part of a parameter at the time you click the button.\n    * &quot;Drop 'n Launch&quot; feature allows you to set up a button so that when a file is dropped on it, the program assigned to that button is started with that file.\n    * Configuration information is stored in the Registry, allowing each Windows user to have their own TurboLaunch configuration.\n    * The configuration can be password-protected to keep unauthorized users from making any changes!\n    * Icon information is automatically cached for rapid starting of TurboLaunch.\n    * &quot;Roll Up When Not Active&quot; option reduces the size of the TurboLaunch window when it is not active.\n    * &quot;Prevent Double Runs&quot; option stops accidental double-clicks on buttons from launching the button twice.\n    * Many, many more options not listed here!\n\n\nwin/all","torrent":{"xt":"urn:btih:d4fa9d5b6b47c4559ba32809e6f3ff0cce5aeccd","amp;dn":"Turbo+Launch+5.1.1-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4fa9d5b6b47c4559ba32809e6f3ff0cce5aeccd","infoHashBuffer":{"type":"Buffer","data":[212,250,157,91,107,71,196,85,155,163,40,9,230,243,255,12,206,90,236,205]},"announce":[],"urlList":[]}}