{"title":"Autosport Magazine UK 02/12/2010","uid":6006293,"size":88254608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6bd17e3febad6934fa0c966f525294bb3681a40&amp;dn=Autosport+Magazine+UK+02%2F12%2F2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thorhammer2000","files":-1,"time":1291334037,"description":"NEWS\n10 Red Bull's test target. Red Bull warning: RB7 will be ready for first F1 2011 test\n12 Ricciardo ready for F1. Aussie Daniel Ricciardo lands STR Friday gig as current drivers told to up ante\n16 Magnussen forF3. Kevin Magnussen follows dad Jan to UK series with Carlin\n18 Nakajima eyes FNippon. Former Williams F1 driver aims for Japanese single-seater series for 2011\n21 Sordo closes on Mini seat. Spaniard ready to sign for Prodrive after testing all-new Countryman WRC challenger\n\nREPORTS\n68 DTM Shanghai. Gary Paffett wins on the Chinese streets as Paul di Resta shadows him to secure the title for Mercedes\n71 World GT1 Interlagos. Bernoldi and Negrao take home win aboard Vitaphone Maserati MC12\n72 World of Sport. Race of Champions in Dusseldorf; Superstars\n\nF1 REVIEW\n24 Seasonal survey. Reflecting on an epic battle\n30 Red Bull RB6. Technical secrets of the world title-winning machine\n32 Mark Hughes's top 10. Our man's best of the year\n36 Team by team. Full analysis of all 12 outfits\n58 Mega stars v minnows. Comparing Red Bull and Hispania Racing budgets\n60 Kamui Kobayashi. Japanese rookie reflects on rookie year with Sauber\n62 The year in numbers. All the vital stats of F1 2010\n\nFEATURES\n66 Youngsters' big break. Sims and Smith get their McLaren AUTOSPORT BRDC prize drives in a McLaren\n\nSPORTS EXTRA\n87 New German-car series. CSCC launches post-1990 German-marque series\n88 Diesel do nicely. 750MC plans VW Golf diesel championship for 2011\n91 New historics are go. Pre-60 tourers and Pre-66 GTs to rival Masters Series\n93 Belgian wins RAC Rally. Stefaan Stouf on the right rubber for snowy victory\n94 TOCA Support reviews. Highlights from the 2010 Porsche Carrera Cup and Renault Clio Cup\n\nREGULARS\n101 Photo finish. Juha Kankkunen, Race of Champions 1988\n102 Race of my life. Marc Surer, European GP, Brands Hatch 1985","torrent":{"xt":"urn:btih:d6bd17e3febad6934fa0c966f525294bb3681a40","amp;dn":"Autosport+Magazine+UK+02%2F12%2F2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6bd17e3febad6934fa0c966f525294bb3681a40","infoHashBuffer":{"type":"Buffer","data":[214,189,23,227,254,186,214,147,79,160,201,102,245,37,41,75,179,104,26,64]},"announce":[],"urlList":[]}}