{"title":"Big Star - No. 1 Record &amp; Radio City","uid":3580697,"size":106277026,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6cd98dfa5222f4327e6fc450a2c1155738945fd&amp;dn=Big+Star+-+No.+1+Record+%26+Radio+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kallander","files":24,"time":1166650943,"description":"Review by Jason Ankeny \n\nA two-fer combining Big Star&amp;#039;s first and second albums, #1 Record/Radio City remains a definitive document of early-&amp;#039;70s American power pop and a virtual blueprint for much of the finest alternative rock that came after it. The lone Big Star record to merit the full participation of founder Chris Bell, the brightly produced #1 Record splits the songwriting credits evenly between him and Alex Chilton (in the tradition of Lennon-McCartney). But from the beginning, the group is tearing apart at the seams: Bell and Chilton&amp;#039;s relationship seems less a working partnership than a battle of wills, and each possesses his own distinctive vision. The purist, Bell crafts electrifying and melodic classic pop like &quot;Feel&quot; and &quot;In the Street,&quot; while Chilton, the malcontent, pens luminous, melancholy ballads like &quot;The Ballad of El Goodo&quot; and &quot;Thirteen.&quot; Ultimately, their tension makes #1 Record brilliant. However, Radio City shifts gears dramatically: Bell is largely absent (though he guests, uncredited, on a few tracks, including the wonderful &quot;Back of a Car&quot;), allowing Chilton&amp;#039;s darker impulses free reign. From the raucous opener &quot;O My Soul&quot; onward, the new Big Star is noisier, edgier, and even more potent. Erratic mixing, spotty production, shaky performances ? by all rights, Radio City should be a failure, yet Chilton is at his best when poised on the brink of disaster, and the songs hang together seemingly on faith and conviction alone. Each track recalls pop&amp;#039;s glory days, from the Kinks-ish snarl of &quot;Mod Lang&quot; to the Byrds-like guitar glow that adorns &quot;Way Out West.&quot; The much-celebrated &quot;September Gurls&quot; is indeed a classic ? everything right and good about pop music distilled down to three minutes of pure genius. \n \n","torrent":{"xt":"urn:btih:d6cd98dfa5222f4327e6fc450a2c1155738945fd","amp;dn":"Big+Star+-+No.+1+Record+%26+Radio+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6cd98dfa5222f4327e6fc450a2c1155738945fd","infoHashBuffer":{"type":"Buffer","data":[214,205,152,223,165,34,47,67,39,230,252,69,10,44,17,85,115,137,69,253]},"announce":[],"urlList":[]}}