{"title":"The Externalisation of the Hierarchy","uid":4889364,"size":355346086,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d707bad6fedd3496c3916c7707863b75cb80c116&amp;dn=The+Externalisation+of+the+Hierarchy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SystmHck","files":2,"time":1241891162,"description":"Narrator: Keith Thompson ( based on Keith's film The New Age Infiltration of the truth movement )\n\nAlice Bailey states in her book, The Externalisation of the Hierarchy, that the world must be united regionally before it can be united into one. \n\nOne World Government -- the only answer to man's problems. \nOne World Economy \nOne World Religion\nMan's evil actions historically are ascribed to his divisions into many different religions. Therefore, much emphasis is being laid on the re-uniting into one religion. The current Ecumenical Movement is leading the charge toward this all-important goal. In a seminar held in Boston in August, 1991, the current New England Director of the Theosophical Society stated that, at the proper moment in world history the Roman Catholic Pope would travel to Jerusalem to address a world-wide religious conference. In his speech, he would declare all the world's religions to be united into One. Thus, Alice Bailey's Plan, stated almost 50 years ago, would be realized, i.e., that the Great One would reinstate the Ancient Mysteries Religion as the New World Order Religion. &quot;These Mysteries&quot;, when restored, will unify all faiths.&quot; (Externalisation of the Hierarchy, p. 573, written in 1946). \n\nMany of those &quot;truth teachers&quot; are puppets for the Illuminati Elite, they are externalizing their dogma to the public, so when the chaos is created everyone will be willing to accept the REAL New World Order.\t\n","torrent":{"xt":"urn:btih:d707bad6fedd3496c3916c7707863b75cb80c116","amp;dn":"The+Externalisation+of+the+Hierarchy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d707bad6fedd3496c3916c7707863b75cb80c116","infoHashBuffer":{"type":"Buffer","data":[215,7,186,214,254,221,52,150,195,145,108,119,7,134,59,117,203,128,193,22]},"announce":[],"urlList":[]}}