{"title":"4 - Los Hermanos [EAC] [FLAC]","uid":5256728,"size":290714442,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d83dedc5785105d4006bb90040c7c98869f4d715&amp;dn=4+-+Los+Hermanos+%5BEAC%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bizinho","files":-1,"time":1262576186,"description":"In their impressive and ambitious quest to completely reinvent their sound for each new album, Los Hermanos this time around opted for a soft, low-key, jazzy, and slightly Djavan-inspired sound. And as expected, this soothing, mellow reincarnation of the group didn't please a large part of their fan base. Not that the music is bad. On the contrary, the album contains several very fine moments. But as a whole, it is so different to los Hermanos' earlier efforts that many listeners simply became disappointed. While the stylistic difference between &quot;Quatro&quot; and the group's three earlier albums is striking, there is much less difference between the individual songs on this album. They all have the same sleepy atmosphere and the calm and tasteful arrangements in common. &quot;Dois Barcos,&quot; &quot;Sapato Novo,&quot; and &quot;Primeiro Andar&quot; stand out for their complex and beautiful melodies. &quot;PaquetÃƒÂ¡&quot; has a bossa nova sound to it and &quot;O Vento&quot; catches attention with its light, floating guitar rhythm. The soft, almost lethargic singing of Marcelo Camelo on most of the tracks also strongly contributes to the special atmosphere of the album.","torrent":{"xt":"urn:btih:d83dedc5785105d4006bb90040c7c98869f4d715","amp;dn":"4+-+Los+Hermanos+%5BEAC%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d83dedc5785105d4006bb90040c7c98869f4d715","infoHashBuffer":{"type":"Buffer","data":[216,61,237,197,120,81,5,212,0,107,185,0,64,199,201,136,105,244,215,21]},"announce":[],"urlList":[]}}