{"title":"Lord of the Rings Full Collection (PS2 Classic)[FULLDVD]","uid":9625110,"size":7171046817,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d8cfb8c28d1c004e83036e26cd83d740207ff7d5&amp;dn=Lord+of+the+Rings+Full+Collection+%28PS2+Classic%29%5BFULLDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"sonywo","files":-1,"time":1392577488,"description":"(2002) Lord of the Rings The Two Towers [NTSC-U](E)[3.83GB][DVD][SLUS-20578]\n(2003) Lord of the Rings The Return of the King [PAL-E](Multi-5)[4.04GB][DVD][SLES-52017]\n(2003) Lord of the Rings The Third Age [PAL-E](Multi-5)[4.28GB][DVD][SLES-52801]\n\nCollection: Lord of the Rings\nGenre: Beat-'Em-Up &gt; Action /Role-Playing &gt; Console-style RPG\nDeveloper:Stormfront Studios/ EA Games\nPublisher: Electronic Arts / EA Games\nYear: 2002-2004\nESRB Rating: E12+\nPlay modes: single player\nPlatform: Playstation 2\nRegion: Pal-E / Ntsc-U\nGame Languages: \nThe Two Towers: English\nThe Return of the King: English, Dutch, Polish, Portuguese, Swedish\nThe Third Age: English, Dutch, Polish, Portuguese, Swedish\nNumber of games: 3\nFormat: DVD-5\nCompression type: .7z\nCompressed Size: 7.56GB\nUncompressed size: 14.77GB\nImage Format: .ISO\n\n[DESCRIPTION]\nThe second chapter in the epic story of Middle-earth pits you against Sauron and the evil forces of Mordor. In The Lord of the Rings: The Two Towers, you'll battle an army of 10,000 Uruk-Hai on the walls of Helm's Deep, hordes of Orcs on the plains of Rohan, and even the monstrous Cave Troll in Balin's Tomb. Guide Aragorn, Gimli, or Legolas through 13 interactive environments, using each character's unique moves, skills, and weaponry to complete your quest.\n\nReturn to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy. Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring. Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor. The fate of Middle-earth is in your hands.\n\nIn The Lord of the Rings: The Third Age, you can travel in the wake of the Fellowship while exploring your own path and periodically intersecting the major events of the film trilogy. Through both familiar and new locations, you must fight to save or destroy Middle-earth in an epic adventure. Encounter the demonic Balrog in the Mines of Moria, defend the fallen city of Osgiliath, or try to destroy Helm's Deep. These choices and many more will confront you as you align yourself with the people of Middle-earth or undertake missions on behalf of Sauron.\n\n[INSTALL]\nTo unpack , use the 7 -Zip or WinRAR\nBurn with Nero or UltraISO.\nBurn to disc DVD-5 or 4x Speed\nEnjoy!","torrent":{"xt":"urn:btih:d8cfb8c28d1c004e83036e26cd83d740207ff7d5","amp;dn":"Lord+of+the+Rings+Full+Collection+%28PS2+Classic%29%5BFULLDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8cfb8c28d1c004e83036e26cd83d740207ff7d5","infoHashBuffer":{"type":"Buffer","data":[216,207,184,194,141,28,0,78,131,3,110,38,205,131,215,64,32,127,247,213]},"announce":[],"urlList":[]}}