{"title":"Rives Audio Test CD2","uid":4831001,"size":544551504,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d8e1cda38b493fee675764aeb2571c3bd04e3f6f&amp;dn=Rives+Audio+Test+CD2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jb_alphamale","files":1,"time":1239127732,"description":"The only Test CD Calibrated for the Radio Shack Analog SPL Meter, and now with Mapleshade Recordings.\n# Simple and Easy to Use\n# 1/3 octave test tones from 20-20kHz\n# Compensated tones for the Radio Shack SPL meter\n# Has Mapleshade Recordings for subjective testing\n# Has phase testing \nThe Rives Audio Test CD is a unique and inexpensive way to determine room and speaker response. It has 1/3 octave test tones from 20 Hz to 20 kHz. The test tones are very precisely calibrated for a flat response. Each tone is a single track, so that once a room mode has been found, one can put the track on repeat mode and determine where the &quot;hot spots&quot; or areas of highest sound pressure exist to properly treat the room.\n\nIn addition to the flat 20 Hz to 20 kHz tracks there is an additional set of tracks that are also 1/3 octaves from 20 Hz to 20 kHz. The only difference in this series of tracks is that it is not flat. It is precisely calibrated to compensate for the non-linearity (particularly in the lower octaves) of the Radio Shack SPL meter (sound meter). We have found this meter to be very reproducible, but not very accurate. It is also very inexpensive and easy to obtain. For this reason we made these tracks to compensate for this device.\n\nUnique to the Test CD 2 we have added partial tracks of various Mapleshade recordings. Mapleshade, also located in Maryland, makes some of the purist and cleanest sounding recordings. They are very revealing. Rives Audio has found them to be essential tools in subjective listening. One piece of music has been mastered in a variety of ways to test phase and other common problems.","torrent":{"xt":"urn:btih:d8e1cda38b493fee675764aeb2571c3bd04e3f6f","amp;dn":"Rives+Audio+Test+CD2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8e1cda38b493fee675764aeb2571c3bd04e3f6f","infoHashBuffer":{"type":"Buffer","data":[216,225,205,163,139,73,63,238,103,87,100,174,178,87,28,59,208,78,63,111]},"announce":[],"urlList":[]}}