{"title":"Bill Moyers - The Public Mind (1989) Part three: Illusions of Ne","uid":5158164,"size":480070642,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dba74c63da2329f3868d0cb7116435c327d06103&amp;dn=Bill+Moyers+-+The+Public+Mind+%281989%29+Part+three%3A+Illusions+of+Ne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheTooleMan","files":-1,"time":1257976952,"description":"Bill Moyers\n&quot;The Public Mind: Image and Reality in America&quot; (1989)\nPart Three: &quot;Illusions of News&quot;\nPBS broadcast -&gt; VHS -&gt; Xvid/MP3\n\nBill Moyers followed his successful &quot;The Power of Myth&quot; and &quot;The World of Ideas&quot; series with a four-part overview of &quot;image and reality in America.&quot; The third part of the series, &quot;Illusions of News,&quot; is particularly powerful in its discussion of the news media and how it serves the purposes of the powerful. Much of what is revealed in this program, now 20 years old, still holds true today.\n\nBeginning with the assertion that the &quot;market determines the news,&quot; Moyers interviews various media critics (including authors Ben Bagdikian and Todd Gitlin), and personalities (Lesley Stahl of CBS News and Fred Friendly) to determine the extent of the problem. While the idea of news as entertainment is fairly old hat,  Moyers reveals that television news is now the victim of its own showmanship. Politicians have discovered the power of the image, and no longer bother with issues--whether the news teams want them or not. TV news is now at the mercy of Presidents and other politicians who decide exactly what they want the public to see. This is electronic journalism at its most meaningful, made even more compelling by host Moyers, who has the honesty to question the apparatus which he freely admits provides his own bread and butter. \n\nThe other three programs in the series are: Consuming Images, Leading Questions, and The Truth About Lies. If you have copies of the program, please share them.","torrent":{"xt":"urn:btih:dba74c63da2329f3868d0cb7116435c327d06103","amp;dn":"Bill+Moyers+-+The+Public+Mind+%281989%29+Part+three%3A+Illusions+of+Ne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dba74c63da2329f3868d0cb7116435c327d06103","infoHashBuffer":{"type":"Buffer","data":[219,167,76,99,218,35,41,243,134,141,12,183,17,100,53,195,39,208,97,3]},"announce":[],"urlList":[]}}