{"title":"Lez Do Lunch Volume 1","uid":3509270,"size":892182532,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ddd104dcebba17711fe7e6bb618399825dd9df55&amp;dn=Lez+Do+Lunch+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"varfen","files":1,"time":1154737563,"description":"This is surely one of the best lesbian movies I have ever seen. The scenes and kissing are really pationate. Also a good movie if you like stockings and heels :-)\n\n---\nCover: &lt;a href=&quot;\nhttp://www.adultcdmovies.biz/p-32008-.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.adultcdmovies.biz/p-32008-.aspx&lt;/a&gt;\n\n---\nDescription:\n\nThere&amp;#039;s nothing like sunlight, gentle breezes and a taste of wine to awaken passionate senses. These delectable co-workers decide to go on a luncheon picnic ... and end up nibbling on each other! Enjoying an informal, quiet moment at work, Laurie Wallace kicks off her heels and relaxes her tired legs. Angel Cassidy interrupts her supervisor for her six-month review, which ends up so positive both women are aglow with good feelings. They decide to celebrate and have a cozy picnic lunch. The sun, breezes and wine slowly melt inhibitions and Angel&amp;#039;s joy is all the encouragement Laurie needs.\n\nDoes Laurie actually intend to seduce Angel, or is it just a spontaneous attraction? Who cares !?! The inevitable result is some spectacularly pretty video as the two gobble each other up and promise to finish their meal that evening after work.\n\nThere&amp;#039;s also a yummy bonus for dessert. Angel and Laurie play a mesmerizing game ... an artsy mood piece, where Angel silently beckons Laurie to join her in a steamy self-indulgent game of masturbation. She flirts, teases and opens herself ... exposing her boiling sensual desire and leaving Laurie helpless to resist. Enjoy as they consummate their own lust while watching each other&amp;#039;s passionate release. \n","torrent":{"xt":"urn:btih:ddd104dcebba17711fe7e6bb618399825dd9df55","amp;dn":"Lez+Do+Lunch+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd104dcebba17711fe7e6bb618399825dd9df55","infoHashBuffer":{"type":"Buffer","data":[221,209,4,220,235,186,23,113,31,231,230,187,97,131,153,130,93,217,223,85]},"announce":[],"urlList":[]}}