{"title":"Como locos a por el oro DVDRIP-AC3 Spanish","uid":4662549,"size":1287610368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de4add969843d3f4d043e7375096f42889f34df7&amp;dn=Como+locos+a+por+el+oro+DVDRIP-AC3+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"manogy","files":1,"time":1232446552,"description":"\nAÃƒÂ±o 2008\n\nBen &quot;Finn&quot; Finnegan es un afable buscador de tesoros moderno que estÃƒÂ¡ obsesionado con encontrar la legendaria Dote de la Reina del siglo XVIII-40 cofres con un tesoro incalculable que se perdiÃƒÂ³ en el mar en 1715. En su bÃƒÂºsqueda, Finn ha echado por la borda todo lo que tiene, incluido su matrimonio con Tess. Justo cuando Tess ha empezado a rehacer su vida trabajando a bordo de un mega yate que pertenece al multimillonario Nigel Honeycutt, Finn descubre una pista crucial sobre el paradero del tesoro. Para mayor consternaciÃƒÂ³n de Tess, Finn se las arregla para embarcar en el yate de Nigel y, usando su pÃƒÂ­caro encanto, convence al millonario y a su conocidÃƒÂ­sima hija, Gemma , para que se unan a ÃƒÂ©l en la bÃƒÂºsqueda de las riquezas espaÃƒÂ±olas. Incluso Tess no puede resistirse al reclamo de descubrir finalmente el tesoro que les ha eludido durante tanto tiempo. Pero ellos no son los ÃƒÂºnicos que van tras el premio. El que fuera una vez mentor de Finn, Moe Fitch, y un brutal gangster local llamado Bigg Bunny (Kevin Hart) tienen la intenciÃƒÂ³n de ganar a Finn el valioso tesoro. Dejemos que empiece la bÃƒÂºsqueda del tesoro...\n","torrent":{"xt":"urn:btih:de4add969843d3f4d043e7375096f42889f34df7","amp;dn":"Como+locos+a+por+el+oro+DVDRIP-AC3+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de4add969843d3f4d043e7375096f42889f34df7","infoHashBuffer":{"type":"Buffer","data":[222,74,221,150,152,67,211,244,208,67,231,55,80,150,244,40,137,243,77,247]},"announce":[],"urlList":[]}}