{"title":"Johnny Sokko and His Flying Robot - Episodes 13 - 16","uid":4537369,"size":834260992,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:debf73bbe713a3cd529161cedefbdf37b7d672d3&amp;dn=Johnny+Sokko+and+His+Flying+Robot+-+Episodes+13+-+16&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Wolliom","files":4,"time":1227796312,"description":"Johnny Sokko is an ordinary kid, whose life took an extraordinary turn on a voyage when he meets a young man who befriends him. The boat is suddenly sunk by the minions of the terrorist organization known as the Gargoyle Gang who have a penchant for giant robots for their attacks. Finding themselves on an island base, the pair meet up with a scientist who has constructed the most advanced and powerful robot of all. Upset that his creation will be used for evil, the scientist shows the pair the robot and the wristwatch voice controller, set to imprint the next speaker as the sole person who can command the robot. Impulsively, Johnny speaks into it and becomes that controller. With the robot's power, they escape and Johnny learns that his new friend is an agent of the worldwide intelligence and anti-terrorist organization, Unicorn, which is dedicated to opposing the Gargoyle Gang. With no alternative, Unicorn recruits Johnny as a full regular agent. Now, Johnny has a vital role in this new war as the one person who can bring the tremendous strength and firepower of the giant robot to bear against the forces of evil.","torrent":{"xt":"urn:btih:debf73bbe713a3cd529161cedefbdf37b7d672d3","amp;dn":"Johnny+Sokko+and+His+Flying+Robot+-+Episodes+13+-+16","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"debf73bbe713a3cd529161cedefbdf37b7d672d3","infoHashBuffer":{"type":"Buffer","data":[222,191,115,187,231,19,163,205,82,145,97,206,222,251,223,55,183,214,114,211]},"announce":[],"urlList":[]}}