{"title":"Edge.of.Darkness.TS.With.SAMPLE-GPB2008","uid":5346324,"size":747993614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:df87bc50a637b0488bf1ba0fbdecba7214b79e5e&amp;dn=Edge.of.Darkness.TS.With.SAMPLE-GPB2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GPB2008","files":-1,"time":1265651912,"description":"Thomas Craven, is a detective who has spent years working the streets of Boston. When his own daughter is killed near the door of his home, Craven realizes that her death is only one piece of an intriguing puzzle filled with corruption and conspiracy, and it falls to him to discover who is behind the crime. \n\n\n\nThomas Craven, a single father, has been a Boston homicide detective for many years. His 24-year-old daughter Emma, his only child, is killed on the front steps of his home. At first it appears that Craven was the intended target. He soon uncovers evidence that leads him to think differently, and decides to pursue the information at all costs. He learns his daughter led a secret life that led to her murder. He quickly finds himself confronted with a shadowy world of corporate collusion with government-sanctioned murder. In the process he collides with a secret government operative, Darius Jedburgh, whose job is to clean up and hide any remaining evidence. Craven's singleness of purpose in finding answers about Emma's death becomes a transforming experience that changes his life.\n\n\n\nPlease Comment ... Seed ... Enjoy!!!","torrent":{"xt":"urn:btih:df87bc50a637b0488bf1ba0fbdecba7214b79e5e","amp;dn":"Edge.of.Darkness.TS.With.SAMPLE-GPB2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df87bc50a637b0488bf1ba0fbdecba7214b79e5e","infoHashBuffer":{"type":"Buffer","data":[223,135,188,80,166,55,176,72,139,241,186,15,189,236,186,114,20,183,158,94]},"announce":[],"urlList":[]}}