{"title":"Democracy Now - 29 apr 2011","uid":6354196,"size":451104856,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e14eb8900a2645d4b96983f2c40ecdb500a0b92c&amp;dn=Democracy+Now+-+29+apr+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1304094301,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Apr 29, 2011\n\n- Storm Toll Nears 300; State of Emergency Declared in Alabama\n- Tunisian, Gaddafi Forces Clash in Border Town\n- Obama Unveils New Picks for Military, CIA\n- Carter: U.S. Denial of Aid to North Korea a &quot;Human Rights Violation&quot;\n- Palestinian Civilians Wounded in Israeli Attack on Gaza\n- Egypt to Unseal Rafah Border Crossing\n- Exxon, Shell See Profit Hikes; Venezuela Unveils Oil Windfall Tax\n- Bradley Manning Cleared for End to Solitary Confinement\n- California Gov. Brown Cancels New Death Row at San Quentin\n- Massachusetts House Advances Collective Bargaining Curbs on Public Workers\n- FTC Unveils Voluntary Guidelines for Children's Food Products\n- Rutgers Students End Sit-In Protesting Tuition Hike\n\n\nSpecial reports\n\n- Johann Hari: Frenzy Around Britain's Royal Wedding &quot;Should Embarrass Us All&quot;\n\nUp to two billion people around the world tuned in to watch the British royal wedding of Prince William and Kate Middleton, a story which has dominated TV news for weeks. The wedding buzz offers a chance to look at the monarchy, Britain's domestic policy, and how its colonial legacy around the word affects foreign affairs today. While all eyes were on the wedding procession and the first kiss, Democracy Now! spoke with Johann Hari, a columnist at The Independent of London, who says the royal wedding frenzy should be an embarrassment to us all.\n\n\n- May Day Rallies Celebrate Unity; Labor Unions and Immigrants Plan To March Side By Side\n\nThe May Day rallies set to take place this Sunday follow massive pro-labor protests in Wisconsin to protect collective bargaining rights of public workers. Since 2006, when more than million people marched across the United States against a harsh anti-immigrant bill, May Day has also become a key date of protests by immigrant rights groups. This year, labor and immigrant activists will march together in a move organizers say symbolizes their decision to join forces. We speak with Clarence Thomas of the International Longshoreman and Warehouse Union Local 10, which shut down the ports of Oakland and San Francisco on April 4, in solidarity with workers in Wisconsin. We're also joined from Milkwalkee by Christine Neumann-Ortiz, Executive Director of Voces de la Frontera, a key organizer behind 2006's 70,000-strong march in Milwaukee.\n\n\n- Glenn Greenwald: Obama's Comments on Bradley Manning Mark &quot;Amazing Amount of Improper Influence&quot; in WikiLeaks Case\n\nMilitary officials have announced alleged whistleblower U.S. Army Private Bradley Manning, who is suspected of leaking classified U.S. documents to WikiLeaks, has been cleared to be held as a medium security prisoner at Fort Leavenworth, Kansas, where he was just transferred. Up until last week, Manning was held in 23-hour a day solitary confinement at a Marine brig in Quantico, Virginia. His treatment at Quantico was condemned by Amnesty International and led to a probe by a torture expert at the United Nations. We speak to Salon.com legal blogger and constitutional law attorney Glenn Greenwald, who revealed in December that Manning was being subjected to detention conditions likely to inflict long-term psychological injuries.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e14eb8900a2645d4b96983f2c40ecdb500a0b92c","amp;dn":"Democracy+Now+-+29+apr+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e14eb8900a2645d4b96983f2c40ecdb500a0b92c","infoHashBuffer":{"type":"Buffer","data":[225,78,184,144,10,38,69,212,185,105,131,242,196,14,205,181,0,160,185,44]},"announce":[],"urlList":[]}}