{"title":"The Collective Conscious Podcast Episode 06.mp3","uid":5010709,"size":99871872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e43e27fa863ccba913bbbf825edeacb3f72c92b4&amp;dn=The+Collective+Conscious+Podcast+Episode+06.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cjames78","files":-1,"time":1247977200,"description":"MP3 File\n95.2 MB\n256kbps\n\nJuly 18 2009\n\n\nThis is a very important show.  Not only does it return to the haunting male vocal trance that drew me into this music in the first place, but the electro-house movement is taking charge and the first half of this set really celebrates it. \n\nKicking it off is Marco V and his crucial track Unprepared.  I was unprepared for feeling completely debilitated when I first heard this and after looking up the lyrics it still moves me greatly. I havn't figured out who does the vocals but doesn't it kinda sound like the guy from She Wants Revenge?\n\nThe next track is a perfect counterpart  and the electro buzzes in with DJ Shaolin, Deadmau5 and Robb feat. Freeland.\nNo sim card, no disco lol.\n\nNot to be outdone, it's Kelly Rowland on a really great version of the David Guetta track. Who knew she could sing? They performed this song live on So You Think You Can Dance the other night. It was, well, live\nThen it's a return trip home with a Spencer And Hill remix of the quintessential Paul Van Dyk track and Anguilla Project.\nRounding out the back is the soothing and powerful Nic Chagall track featuring Jonathan Mendelsohn, who may or may not be the poor man's Christian Burns.\n\n\nThanks for listening and please help me seed!\n\nxo\nChris\n\nwww.djcjames.com\n\n\n\n&quot;I've been around for 4 decades, I've seen the cities and the planes,\nI've watched the ball that comes and go\nStill I'm unprepared for you&quot;\n \n\n\nTracklist:\n\nUnprepared (Extended Mix) - Marco V\n\nYour Sweet Affection - DJ Shaolin feat. Stephanie Marie\n\nGhosts N Stuff - Deadmau5\n\nWe Want Your Soul (Club Mix) - Robb feat. Freeland\n\nWhen Love Takes Over (Electro Extended Mix) - David Guetta feat. Kelly Rowland\n\nFor An Angel 09 (Spencer And Hill Remix) - Paul Van Dyk\n\nSomething In Nothing - Anguilla Project\n\nThis Moment (Prog Mix) - Nic Chagall featuring Jonathan Mendelsohn","torrent":{"xt":"urn:btih:e43e27fa863ccba913bbbf825edeacb3f72c92b4","amp;dn":"The+Collective+Conscious+Podcast+Episode+06.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43e27fa863ccba913bbbf825edeacb3f72c92b4","infoHashBuffer":{"type":"Buffer","data":[228,62,39,250,134,60,203,169,19,187,191,130,94,222,172,179,247,44,146,180]},"announce":[],"urlList":[]}}