{"title":"Finding Nemo [XVID][JEROSTAR]","uid":4951317,"size":733972480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e73343f863672055a87f5bdab7662b67e6e57612&amp;dn=Finding+Nemo+%5BXVID%5D%5BJEROSTAR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jerostar","files":1,"time":1244901375,"description":"It's never easy being a small fish in a big sea. Just when Marlin (Albert Brooks), a beautiful orange and white clown fish, feels he's found a comfortable home where his wife can await the birth of a few hundred children, along comes a neighborhood predator. His little body being no match for the huge shark, Marlin is left unconscious. Upon awakening, he discovers the terrible truth. His entire family is wiped out -- save for one little fish egg from which will hatch his son Nemo (Alexander Gould). \n\nIf he was previously over protective, the father's attitude now borders on paranoia. But his habitual nagging leaves Nemo feeling he doesn't need Dad telling him what to do. On his first day of school, the headstrong child swims off from the crowd to demonstrate his independence, completely neglecting to look for danger. In short order, he's captured in the net of an eager scuba diving dentist, and placed within a dental office aquarium in Sydney, Australia. \n\nBack in the ocean, Marlin's fear turns into desperation. The only answer to his pleas for help is a sincere but memory-challenged blue tang fish named Dory (Ellen DeGeneres). While at first unimpressed with Dory's non-stop nattering, Marlin changes his opinion after she demonstrates her exceptional talent: When the diver's lost goggles are discovered, Dory can read the dentist's name and address. \n\nWith this information, the pair determines first to find Sydney, and then look for Nemo. Of course the long trip is anything but smooth sailing, and chance meetings with sharks, jellyfish, and hungry birds often leave the duo swimming for their lives. \n\nNemo should have no trouble finding success as it rides the wave of Pixar's solid reputation for family movies. Yet the studio that created both Toy Story films has not crafted the comedy in this movie with its usual panache. Adults may be disappointed at the lack of &quot;dual layered&quot; jokes-- those laughs which work on different levels for both young and old. However, the same children this script is aimed at may be alarmed by the constant peril the characters find themselves in. \n\nWhat parents will appreciate most about Finding Nemo is a storyline where kids don't always know best. Both junior and senior fish come to realize their attitudes were contributing factors in creating a much bigger problem. \n\nUndoubtedly, audiences of all ages will feel compelled to say, &quot;You've never seen computer animation like this.&quot; At times nearly photographic, every detail down to the buffeting of the waves and movement of the fishes' anatomy is included in stunning detail, making this a movie that's certainly worth going to sea.\n\n\n\nEnjoy the quality of my own personal software ripper. \nIf you like this movie, just leave your comment and let me know about this video.\n\n\nIm seeding this video for all you guys...\nAfter downloading, please seed it. more seeders, faster download.\n\nMy Internet connection has a faster download and uploads.\n\nDownloads: 1.5 mbps\nUploads: 1 mbps (1,024,000 bps)\n\n\njerosoftx :D","torrent":{"xt":"urn:btih:e73343f863672055a87f5bdab7662b67e6e57612","amp;dn":"Finding+Nemo+%5BXVID%5D%5BJEROSTAR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73343f863672055a87f5bdab7662b67e6e57612","infoHashBuffer":{"type":"Buffer","data":[231,51,67,248,99,103,32,85,168,127,91,218,183,102,43,103,230,229,118,18]},"announce":[],"urlList":[]}}