{"title":"Christian Lifesavers, Battle Hymns &amp; Reality Check [3CD-2009 Ed]","uid":4919829,"size":414226536,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e7c7cdce650405badbd80304a7328cbaaa8e259f&amp;dn=Christian+Lifesavers%2C+Battle+Hymns+%26+Reality+Check+%5B3CD-2009+Ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"verifire","files":-1,"time":1243609541,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOR...\n\nVerifire.\n____________________________________________________________________________\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nWell.. I've made an updated version of the &quot;Christian..&quot; -series, since I discovered that some of the artists included in the first edition, actually are followers of the teachings of Kabbalah.\nFor those who doesn't know, Kabbalah is a form of witchcraft, believed to have it's origins in ancient Babylon and Egypt, but adopted and developed further by the scholars of Israel and now made popular in the western world by celebrities like Madonna, Demi Moore, Britney Spears, Jeff Goldblum, Ashton Kutcher, Guy Richie, David and Victoria Beckham and Elizabeth Taylor, just to name a few.\n\nSources:  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Kabbalah&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Kabbalah&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.writersbreak.com/Publishers_Corner/articles/writing/publ_write_kaballah.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.writersbreak.com/Publishers_Corner/articles/writing/publ_write_kaballah.htm&lt;/a&gt;\n\nThe artists I've excluded from this updated upload, are The Isaacs. If you wish, you can check why if you follow this link and download:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4919381&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4919381&lt;/a&gt;\n\nI've not excluded anyone else, no matter what you and I or anyone else think or know about how Christian every artist represented are, because that's not the point with these compilations.\nFor instance there's a song here performed by Tom Waits, and some might argue that he leads a different life than a Christian is supposed to lead. But we don't know that. And he has, as far as I know, never said that he does live like a Christian.\nBob Dylan is also in here, and many regard him as &quot;backslidden&quot;, and they may be right, but at least he's no hypocrite.\nI could give you more examples, but I guess you get my point.\n\nThe reason for removing the Isaacs from the compilations, is that they appear so angelic and talk and sing like they're really, really Christian, while they secretly follow other teachings than the Words of Jesus of Nazareth. I hate that. I'd love to be proved wrong, but the research I've done and what I found speaks so loud, that I don't think I will, I'm afraid..\n\nNot long ago I was backslidden myself, but I was once again saved by the Shepherd Jesus Christ's love and forgiveness. Now I'm back. Not by any means perfect, but I believe and act according to the Faith and mercy I've been given. During that period, I didn't pretend that everything was all right, which you can see by looking at the uploads and comments I made then. I'm not proud about it, but that's the truth.\n\nWith that said, I hereby re-upload the revised series as a RAR-pack, for those with limited and often expensive bandwidth, with all three included. They're all mp3, sampled between 160-320 kbps, tagged properly, so they'll play as well on your mp3-player and computer as they will if you burn them onto regular CD-Rs.. :-)\n\nIf you prefer to download the un-RAR'ed version of these compilations, you can find it here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4919821&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4919821&lt;/a&gt;\n\nMay the Only Father and Creator bless you greatly through His Son Jesus Christ and guide you with His Holy Spirit, all the way home..\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;98eefdeaf1fef1eafdf5f9f1f4d8fff5f9f1f4b6fbf7f5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:e7c7cdce650405badbd80304a7328cbaaa8e259f","amp;dn":"Christian+Lifesavers%2C+Battle+Hymns+%26+Reality+Check+%5B3CD-2009+Ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7c7cdce650405badbd80304a7328cbaaa8e259f","infoHashBuffer":{"type":"Buffer","data":[231,199,205,206,101,4,5,186,219,216,3,4,167,50,140,186,170,142,37,159]},"announce":[],"urlList":[]}}