{"title":"Whitney Houston - You Give Good Love  (2nafish)","uid":5416473,"size":147826692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e87e2ac37f5442eda76af58b8cc75b6799d0a538&amp;dn=Whitney+Houston+-+You+Give+Good+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1267938535,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;You Give Good Love&quot; is a song by American pop/R&amp;B singer Whitney Houston from her self-titled debut album. The single peak at number three on the U.S. Billboard Hot 100 chart in 1985.\n\nArista Records signed Houston to a recording contract in 1983. Over the next two years, songs and producers were gathered for Houston's debut album. Songwriter and producer Kashif was among those whom Arista Records president Clive Davis wanted to work on the album. When LaLa, a songwriter for Kashif's publishing company, sent Kashif a copy of &quot;You Give Good Love&quot;, originally offered to Roberta Flack, Kashif thought it would be a perfect fit for Houston and told Davis he would be interested in recording with Houston.\n\n&quot;You Give Good Love&quot; peaked at number three on the U.S. Hot 100 the week of July 27, 1985 and hit number one on the Billboard R&amp;B chart. It reached the Top Five of the Billboard Adult Contemporary chart. It ranked #2 on Billboards year end top black singles of 1985.\n\nThe video for &quot;You Give Good Love&quot; featured an off-duty cameraman entering a club that's being refurbished. Houston is on the stage rehearsing for a performance. Taken aback by her impressive singing, the man begins filming Houston as she performs.\n\nWhitney Houston is the debut album of American R&amp;B and pop singer Whitney Houston, released February 14, 1985 on Arista Records. The album initially had a slow commercial response, but emerged as a success during 1986 with the help of three number-one singles on the Billboard Hot 100 chart. The album serves as Houston's best-selling studio album to date, with sales of over 25 million copies worldwide, and one of the best selling albums of all time in the United States and internationally. Whitney Houston has often been cited by critics as Houston's best work. In 2003, the album was ranked number 254 on Rolling Stone magazine's list of the 500 greatest albums of all time. In honor of its 25th anniversary, the album was re-released on January 26, 2010, in an expanded edition with five bonus tracks and a DVD.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e87e2ac37f5442eda76af58b8cc75b6799d0a538","amp;dn":"Whitney+Houston+-+You+Give+Good+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e87e2ac37f5442eda76af58b8cc75b6799d0a538","infoHashBuffer":{"type":"Buffer","data":[232,126,42,195,127,84,66,237,167,106,245,139,140,199,91,103,153,208,165,56]},"announce":[],"urlList":[]}}