{"title":"Fruhstuck - Be Careful EP [MP3 VBR 192k]","uid":4918550,"size":17808758,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e88207ae174862e66a3976700f8ee65461f77938&amp;dn=Fruhstuck+-+Be+Careful+EP+%5BMP3+VBR+192k%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kwazar81","files":6,"time":1243544619,"description":"With two albums, a tour in the U.S. and a former deal with Warner under their collective belt, Fruhstuck is among Poland's finest when it comes to sensible, emotional rock. If U2 had formed in Wroclaw instead of Dublin, they might have sounded just like this.\nIt's not just us: Fruhstuck's Dutch singer Martijn Krale, who's been living in Poland for over ten years, is the one who brought up the comparison with the creators of Joshua Tree, War and Achtung Baby. He not only lists U2 as one of the band's main influences (along with Radiohead, King's X, Talking Heads, Bob Dylan and even Frank Sinatra), he also adds that for the release their third album, they have decided to wait until next spring, after U2's new album is out, &quot;because we don't want to make it hard on them&quot;. How's that for respect for your mentors...\nFruhstuck ('breakfast' in German) started out in 1997 and, in spite of everything you just read, they reckon they are &quot;generally more into American rock than UK rock&quot;. Anyway, the band has toured extensively in Poland, all of Europe and, in 2005, they even embarked on an American tour. They also released two albums &quot; that were received very positively by press and the public&quot; over the three years they were signed to a Polish label distributed by Warner. In other words, they went pretty far professionally. Nevertheless, when their record deal ended, they &quot;decided that [they] would prefer to enjoy the freedom of being independent for a while&quot;. Which is when they turned to jamendo.\nThe band made made several EPs, two of which are posted on jamendo. &quot;We liked the idea of distributing some of our songs in this way. For us, music is a way to communicate, and through sites like jamendo, we have a chance to reach a broader audience. There is something beautiful about proactively sharing your music instead of it being stolen.&quot;\nNext, after the new album is out (and U2 is left raging they didn't come up with such brilliant tunes themselves), Fruhstuck is planning to &quot;be more present on Polish radio and on rock festivals&quot;, and generally to &quot;play the maximum amount of concerts we can handle&quot;. That might include another U.S. tour, as well as &quot;joining a befriended band on a Japanese tour.&quot; Way to go!\n\nFruhstuck encourages file sharing by using Creative Commons licenses. So if you like this album, feel free to share it with your friends!\n\nArtist: Fruhstuck\nAlbum: Be Careful\nRelease date: 2008-07-29\nLicense: http://creativecommons.org/licenses/by-nc-sa/3.0/\nAudio codec: MP3 192Kbps VBR (lame --alt-preset standard)\nTotal size: 16.98 MB\nRun Time: 12:19\nTracks: 3\nSource: Lossless files uploaded by the artist\nIncluded: MP3s, Front cover, License.txt, Readme.txt\n\nDirectory: Fruhstuck - Be Carefull -- Jamendo - MP3 VBR 192k - 2008.07.28 [www.jamendo.com]\nFiles:\n01 - Fruhstuck - Be Careful EP - Angel.mp3 6 MB\n02 - Fruhstuck - Be Careful EP - Song of Deliverance.mp3 4.8 MB\n03 - Fruhstuck - Be Careful EP - Be Carefull.mp3 6.1 MB\nLicense.txt 340 Bytes\nReadme - www.jamendo.com .txt 4.6 KB\n[cover] Fruhstuck - Be Carefull.jpg 81.2 KB\n\nNote: Original name of the EP is 'Be careful', unfortunately jamendo called it 'Be carefull'\n\nwww.fruhstuck.pl","torrent":{"xt":"urn:btih:e88207ae174862e66a3976700f8ee65461f77938","amp;dn":"Fruhstuck+-+Be+Careful+EP+%5BMP3+VBR+192k%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88207ae174862e66a3976700f8ee65461f77938","infoHashBuffer":{"type":"Buffer","data":[232,130,7,174,23,72,98,230,106,57,118,112,15,142,230,84,97,247,121,56]},"announce":[],"urlList":[]}}