{"title":"Coast.to.Coast.AM.May.27.2009-komie","uid":4918294,"size":55080245,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e98112eee304f0f8b1183c39bf00317f5740221e&amp;dn=Coast.to.Coast.AM.May.27.2009-komie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"komie","files":6,"time":1243534216,"description":"Waves of Change\n\n\n\nDate:\n05-27-09\n\nHost:\nGeorge Noory\n\nGuests:\nMarshall Vian Summers, Frosty Wooldridge\n\n\nAuthor &amp; teacher Marshall Summers discussed how humanity has crossed a critical threshold and will have to adapt to a whole new set of circumstances such as economic hardship, climate change, and scarcity of resources. Poorer nations will bear the immediate brunt of food/water shortages and political instability, he noted, yet the world has become interdependent and it's in everyone's interest to unite, and maintain stability.?\n\nWe've come to the end of a cycle and are entering into a different kind of era, a new paradigm, he said. In the old mindset, people live in the now and don't think in terms of the future-- but that has to change, he argued. If we do nothing, he cautioned, many parts of the planet will turn into desert, and things will increasingly spin out of control.?\n\nSummers said we must learn about the current dilemmas facing humanity, deeply evaluate our lives, and find strength and faith within ourselves. Those in isolated locations may face particular difficulty, and to be an idle bystander is a position of corruption, he declared. Change can have a redemptive power for humanity, he added, and thousands of solutions/contributions can be part of it.??\nOverpopulation &amp; Immigration:\n\nFirst hour guest, author and speaker Frosty Wooldridge spoke about the issue of overpopulation, which he's written about in his new book America on the Brink. Immigration is the driving force behind population growth in the United States, and he foresees a time when 70-75 million of the American population will be immigrants, creating a &quot;human Katrina&quot; situation. He also warned about climate de-stabilization and global problems.\nWebsite(s):\n# greatwavesofchange.org\n# newmessage.org\n# frostywooldridge.com\nBook(s):\n# The Allies of Humanity\n# The Great Waves of Change\n# Steps to Knowledge\n# America on the Brink\n","torrent":{"xt":"urn:btih:e98112eee304f0f8b1183c39bf00317f5740221e","amp;dn":"Coast.to.Coast.AM.May.27.2009-komie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e98112eee304f0f8b1183c39bf00317f5740221e","infoHashBuffer":{"type":"Buffer","data":[233,129,18,238,227,4,240,248,177,24,60,57,191,0,49,127,87,64,34,30]},"announce":[],"urlList":[]}}