{"title":"Errol Garner - Jazz Ballads 09 TQMP","uid":4908569,"size":612152308,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea1d3a22c5923eb4d7a81bc6df22150259b1a3d5&amp;dn=Errol+Garner+-+Jazz+Ballads+09+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zootallure","files":66,"time":1243031898,"description":"George Wein regarded him as &quot;a great musical genius&quot;.\n\nHugues PanassiÃƒÂ© said of him, &quot;He is not only the greatest pianist to emerge in jazz since World War II, but he is also the only one who has created a new style which is in the true jazz tradition, one which constitutes the essence of this music.&quot;\n\nMary Lou Williams revered him as &quot;an asset and inspiration to the jazz world.&quot;\n\nSteve Allen said he was &quot;the greatest popular pianist of our century.&quot;\n\nAnd Art Tatum called him, &quot;My little boy.&quot;\n\nThey were talking about Erroll Louis Garner, the formidably accomplished and incredibly prolific self-taught pianist who first began exploring the piano keyboard at the age of three and went on to become a genuine jazz legend. His professional career spanned almost four decades and, in that time, he recorded for dozens of different labels, sometimes solo, mostly with his own trio. His recorded output occupies 33 pages in Tom Lord's The Jazz Discography. He made altogether more than 200 albums. And he never learned to read music...\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:ea1d3a22c5923eb4d7a81bc6df22150259b1a3d5","amp;dn":"Errol+Garner+-+Jazz+Ballads+09+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea1d3a22c5923eb4d7a81bc6df22150259b1a3d5","infoHashBuffer":{"type":"Buffer","data":[234,29,58,34,197,146,62,180,215,168,27,198,223,34,21,2,89,177,163,213]},"announce":[],"urlList":[]}}