{"title":"Prison Architect - Alpha 15 - Linux","uid":9270041,"size":105351543,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:ec69035c547d30d54e89957664e23bec763d3c8c&amp;dn=Prison+Architect+-+Alpha+15+-+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sharpshot94549","files":-1,"time":1385757302,"description":"This is the Prison Architect Alpha 15 build. \n\nVarious updates include a vast optimization of core game processes, making larger prisons much more fluid, allowing prisons with up too 200 inmates and 100 staffers run easily. Also included is support for Mods, which could be found easily on google if wanted. Full list follows (NOTE: If downloaded as a zip file, it is labeled as 15b, this is the same thing, as presumably 15a was never a public release)\n\n\n= Mod system\nWe have started work on much better mod support within the game\nAll mods should be installed in your AppSaveFolder/PrisonArchitect/mods/ \nThey will then show up in a new Mods interface (Main menu -&gt; Extras -&gt; Mods) \nYou can activate and deactivate as many mods at once as you wish\nThere are several types of mod:\nGraphical / Presentation : Updates the graphics and sounds in the game\nTranslations : Translates the game into languages other than English\nScenarios : Full story driven chapters, similar to our Death Row introduction\nContent : Adds items to the sandbox or changes the behaviour of items, eg Grants mods which add grants\nAll mods must have a manifest.txt which details the title, author, version etc\nAnd mods should come with a thumbnail.png image which will act as a graphical preview\n\nFor a list of all existing mods: http://devwiki.introversion.co.uk/pa/index.php/Mods\nFor technical details on how to create a mod : http://devwiki.introversion.co.uk/pa/index.php/Modding\n\nYou must register your purchase to gain access to the wiki.\nIf you haven't registered yet, go here: http://www.introversion.co.uk/prisonarchitect/register\n\n= Performance optimisations continued\nThe game now runs much faster, especially on Windows/PC\nLots of unneccesary memory copying has been optimised out. Makes a big difference on Windows particularly.\nLong running prisons (100+ days) sometimes experienced extreme slowdown due to the list of all contraband\nFixed a bug that caused the building of foundations to become very slow and laggy on large maps\nThe lighting system has been multithreaded, freeing up much CPU time\nNb. The lighting system now updates at 20hz (previously 4hz), so changes in light happen quicker as well\n\n= Staff exhaustion\nAll staff now become tired as they work\nTheir energy level is rendered as a green bar in their nameplate (only shown when less than 33%)\nWhen they become exhausted they will stop work for a while to recover\nYou can now build a Staff Room, and exhausted staff will go there in preference\nStaff resting in a Staff Room will recover energy much faster, and feel more rested\nNOTE: Guard dogs still rest in the Kennels\n\n- You will now receive a different federal grant for each category of prisoner:\nMinimum security prisoner : $50 per day\nNormal security prisoner : $100 per day\nMaximum security prisoner : $150 per day\nNote: Previously you received $100 per prisoner regardless of category\n\n- New clock speed option : very fast. Runs the game at 5x speed. (Previous fastest speed was 2x)\n\n- The Deployment view is now unlocked by the Chief.\nYou can then research Deployment to attach guards to stations, or Patrols to attach guards to patrols\nThis fixes the issue that you could unlock Patrols before you had access to the Deployment screen.\n\n- You can now scroll by pushing the mouse to the edge of the screen\n\n- The Contraband view now has a sub-toolbar with display options:\nDangers Shows all the locations around your prison that contraband could be stolen from\n24 hours Shows all contraband confiscated in the last 24 hours\n7 days Shows all contraband confiscated in the last 7 days\nAll time Shows all contraband confiscated in the history of your jail\nIn addition, all recovered contraband icons are colour coded:\nRed = Weapon, Blue = tools, Green = narcotics\nSeveral main menu items have been moved into a new Extras sub menu:\nNames in the game\nSteam workshop\nMods\nTimelapse\nFixed: Many types of irrelevent equipment will no longer be smuggled into your prison \neg Mop, Rake, Hose, Leash etc\n- Fixed: Power lines were rendered without colour once you'd built more than four power stations\n\n- Fixed: Not all of the Complaints thought bubbles were displaying correctly\n\n- Fixed: Some invalid jobs would appear at the top left of the map as a price\t","torrent":{"xt":"urn:btih:ec69035c547d30d54e89957664e23bec763d3c8c","amp;dn":"Prison+Architect+-+Alpha+15+-+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec69035c547d30d54e89957664e23bec763d3c8c","infoHashBuffer":{"type":"Buffer","data":[236,105,3,92,84,125,48,213,78,137,149,118,100,226,59,236,118,61,60,140]},"announce":[],"urlList":[]}}