{"title":"Alison Moyet - Invisible","uid":4795673,"size":134852612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ee6d00a94d9ce00fe7e8bfb4bedf8eee12f47330&amp;dn=Alison+Moyet+-+Invisible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1237869688,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Invisible&quot;, performed by Alison Moyet, is a song written by Lamont Dozier (of the songwriting team Holland/Dozier/Holland.)\n\nThe single was taken from her Alf album, released in 1984.\n\nThe song reached #21 on the UK Top 40 charts. &quot;Invisible&quot; is also Moyet's most successful American single, reaching #31 on the Billboard Hot 100 in the spring of 1985 and becoming the only U.S. Top 40 hit of her career, either solo or with Yazoo, thus far.\n\nThe lyrics are about being in love with someone who continues to cheat and lie, despite proclaiming their 'invisible' love for her.\n\nAnother opinion is that she is the mistress of a man, who when with his wife/partner, treats her as if she is invisible: &quot;I feel like I've been had, and I'm boiling mad.&quot; Hence her feelings of never being able to get in contact with this man and providing him with alibis. The lyrics tell the frustrations and anger of being in this situation very accurately.\n\nAlison Moyet (born Genevieve Alison Jane Moyet, 18 June 1961), is an English pop singer-songwriter noted for her bluesy voice.\n\nIn 1984, Moyet released her debut solo album Alf (titled after her punk-era nickname). Alf was produced by the noted UK producing/songwriting team of Swain and Jolley. The album was co-written by the duo and Moyet, with the exception of &quot;Invisible&quot;, which was written specifically for her by Motown legend Lamont Dozier. The record was a huge hit in Britain, reaching #1 in the album charts. Alf spawned three international hit singles, &quot;Love Resurrection&quot; (UK #10), &quot;Invisible&quot; (UK #21) and &quot;All Cried Out&quot; (UK #8). In the US, &quot;Invisible&quot; was a Top 40 hit (something Yazoo had never achieved). In some European territories, a fourth single, &quot;For You Only&quot;, was also released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ee6d00a94d9ce00fe7e8bfb4bedf8eee12f47330","amp;dn":"Alison+Moyet+-+Invisible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee6d00a94d9ce00fe7e8bfb4bedf8eee12f47330","infoHashBuffer":{"type":"Buffer","data":[238,109,0,169,77,156,224,15,231,232,191,180,190,223,142,238,18,244,115,48]},"announce":[],"urlList":[]}}