{"title":"Rumpole's Return - John Mortimer   (Unabridged)","uid":6696728,"size":80270796,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ee754d5d5e489008c12e86cb0c2f76fdae4c744e&amp;dn=Rumpole%5C%27s+Return+-+John+Mortimer+++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"neil1966hardy","files":8,"time":1316807424,"description":"Unabridged and read by Robert Hardy. 5 hours 35 mins duration. Cassettes. (32 kbps / 22 kHz Mono CBR MP3)\n\n\n[1982]\nLiving in &quot;retirement&quot; in Miami, Florida, where their son Nick is head of the sociology department at the university, the irascible Horace Rumpole and his wife Hilda (&quot;She-Who-Must-Be-Obeyed&quot;) are enjoying the warm winter weather and sunlight. When Tiffany Jones, a young professor at the university, disappears, shortly after she has flirted with Rumpole at a party, he is as perturbed as are her many friends. Simultaneously, Rumpole reads in a London newspaper, sent by friends, that a struggling young accountant has been arrested for the gory murder of a wealthy aristocrat in a London underground station. A message written in blood is found beside his body.\n\nRumpole cannot resist the lure of returning to London to work on this &quot;blood&quot; case, and Hilda soon joins him, but he discovers that his desk in chambers is now occupied by Ken Cracknell, an overconfident young man with no experience defending a murder case. It is Ken who will defend Simpson, the accountant, but he agrees to let Rumpole work as his &quot;assistant&quot; in this sensational murder investigation. The two locations--Florida, where Tiffany has disappeared, and London, where Simpson has been arrested and charged with murder--come together when Tiffany and Simpson both prove to have been interested in a cult, Children of the Sun.\n\nWritten in 1982, this mystery is a product of its times, a time when &quot;Moonies&quot; were dominating the news, and the novel's &quot;surprises&quot; are perhaps not that surprising when seen from the contemporary vantage point. Side plots involving Rumpole's history with Judge Bullingham, his possible representation of the aggrieved wife of a philandering barrister, the romantic dalliances of Phyllida (Trant) Erskine-Brown with other members of Chambers, and his son Nick's arrival, which leads to his helping Rumpole on the Simpson case, fill out the novel.\n\n\nENjoy and Seed!!","torrent":{"xt":"urn:btih:ee754d5d5e489008c12e86cb0c2f76fdae4c744e","amp;dn":"Rumpole%5C%27s+Return+-+John+Mortimer+++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee754d5d5e489008c12e86cb0c2f76fdae4c744e","infoHashBuffer":{"type":"Buffer","data":[238,117,77,93,94,72,144,8,193,46,134,203,12,47,118,253,174,76,116,78]},"announce":[],"urlList":[]}}