{"title":"189533_RandomSample VV.mp4","uid":5401622,"size":242246819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1b0aa756abe5113d1cab4251319fdf53def147d&amp;dn=189533_RandomSample+VV.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Elenapaparizou","files":1,"time":1267404829,"description":"Language: Italian\nDuration: 01:22:39\nVideo: Xvid 624x464 25.00fps 2234Kbps\nAudio: AC3, Dolby AC3 48000Hz stereo 128Kbps \n\nScenes:\n Cicciolina is lobbying for a new law which allows sexual visits for inmates... when she is rapeded by five perverts one of them (played by Rocco Siffredi) saves her but other women aren't so lucky; rough and extreme hardcore with  brutal rape scenes water sports and foot fetishism; also starring Miss Pomodoro and Paola\n\nuncut (XXX)  Italian harcore (XXX) production (in Italian language no English); excessively violent (sex / torture) porn film about the Bosnian War; directed by Mario Salieri; starring Selen Francesco Malcom and Valentino; two Muslims (a brother and sister) are raped and abused by a former friend now a sadistic CKP\n\nAmateur, anal, behind the scenes, blondes, cumshots, gangbang, porn stars, sex toys, teen, threesome and unseen scenes!\n\nWW2 a female Nazi commandant has created a genetic mutant sex fiend which she uses to abuse and torture female prisoners; plus an over abundance of nudity torture gore and S&amp;M. This is one bizarre and nasty, mean spirited film. 100%\n\na girl gets revenge after her sister is gang violated by thugs. Japanese rough stuff. Very rare film and uncut.   \n\nWoman's prison HARDCORE XXX. Brutal wardens, guards and prisoners attack the new innocent fresh meat that arrives. Ton's of nasty HARDCORE action throughout. No need for the FF button here! Now on DVD after years of being MIA! \n\nDavid Hess (evil star of Last House on the left) plays a demented hitch-hiker. A couple stops to pick him up but he beats the husband and has sex with the wife while the husband is forced to watch. A cat and mouse game follows with the husband seeking revenge. Great flick  ","torrent":{"xt":"urn:btih:f1b0aa756abe5113d1cab4251319fdf53def147d","amp;dn":"189533_RandomSample+VV.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b0aa756abe5113d1cab4251319fdf53def147d","infoHashBuffer":{"type":"Buffer","data":[241,176,170,117,106,190,81,19,209,202,180,37,19,25,253,245,61,239,20,125]},"announce":[],"urlList":[]}}