{"title":"Michael Milken: Leveraging big ideas to make change","uid":4662805,"size":78559193,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f61c991083047b3986daf2146b4323b7f87e7c0c&amp;dn=Michael+Milken%3A+Leveraging+big+ideas+to+make+change&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1232461877,"description":"Michael Milken talks about using your own particular set of skills to make real change in the world. In his case, the energetic mind that once created exotic bonds is now driving the &quot;Manhattan Project of cancer&quot; -- with lifesaving results.\n\nMichael Milken was originally known as a visionary securities trader -- looking for value in hidden pockets of the market, and finding it by the billions. Tagged the &quot;junk-bond king,&quot; he helped transform American business in the 1970s and '80s by providing the funding that made possible massive corporate takeovers.  In 1989, he was convicted of securities fraud, jailed, paid fines and settlements of around $600 million total and accepted a lifetime ban from securities trading.\n\nNow Milken has achieved a different kind of fame, as a philanthropist and catalyst for radical change in the way medical research is funded.\n\nFor decades, he'd worked with his family foundation supporting medical research, the Milken Family Foundation. Then, in the early 1990s, he himself was diagnosed with a prostate cancer that spread to his lymph nodes -- an experience that gave him an eye-opening look at how few men were being tested, let alone treated, for prostate cancer. He focused his energy on nothing less than re-inventing the processes of medical research.\n\nIn 1993 Milken founded the Prostate Cancer Foundation, a massive and focused effort to combat this sleeping threat. And it has, by many accounts -- addressing not only the funding needs, but also the bureaucractic processes that can hinder progress. In a 2004 profile of Milken, Fortune calls the PCF &quot;a significant factor in reducing deaths and suffering from the disease.&quot; He's been called, in fact, &quot;the man who changed medicine,&quot; with his radical approach to driving change.\n\n    &quot;Milken has, in fact, turned the cancer establishment upside down. In the time it normally takes a big pharmaceutical company to bring a single new drug to market, Milken has managed to raise the profile of prostate cancer significantly, increase funding dramatically to fight the disease, spur innovative research, attract new people to the field, get myriad drugs into clinical trials, and, dare we say, speed up science.&quot;\n\n&quot;The Man Who Changed Medicine,&quot; Fortune\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:f61c991083047b3986daf2146b4323b7f87e7c0c","amp;dn":"Michael+Milken%3A+Leveraging+big+ideas+to+make+change","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61c991083047b3986daf2146b4323b7f87e7c0c","infoHashBuffer":{"type":"Buffer","data":[246,28,153,16,131,4,123,57,134,218,242,20,107,67,35,183,248,126,124,12]},"announce":[],"urlList":[]}}