{"title":"Fast DVD Ripper Pro v1.1","uid":5646873,"size":7877459,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f7ab52d16c95857920903ab49d5562831b6f9be2&amp;dn=Fast+DVD+Ripper+Pro+v1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"muryucu","files":-1,"time":1277318416,"description":"Enjoy watching DVD movies on your iPhone, iPod, Apple TV, PSP, Zune, mobile phone or other digital devices but the file is not compatible? Fast DVD Ripper PRO not only perfectly rips DVD movies but it also converts these files to fit your multimedia device for you to enjoy at your fingertips!\n\nEasy to use and fast speed, this powerful DVD ripping and converting software converts DVD formats to all popular video formats, such as AVI, FLV, WMV, MPEG, MP4, RMVB, 3GP, etc. It is fully compatible with normal DVDs, CSS protected DVDs and region 1-6 DVDs.\n \nRip DVD to all Popular Video and Audio Formats\nEasily rips DVD to popular video formats, such as AVI, FLV, WMV, MPEG, MP4, 3GP, etc. It also can rip DVD audio to MP3 music file.\n\nSupports almost all Popular Portable Multimedia Devices\nFast rips your DVD to popular portable multimedia devices - Sony PSP, Apple iPhone, iPod, Apple TV, PSP, Zune, mobile phone and etc. Support automatically detecting, connecting and transferring converted videos to portable devices.\n\nProvides Preview and Takes Favorite Image\nPreviews and compares the source video and edited video for your further operation. Support grabbing screenshot from DVD video.\n\nVideo Quality Optimization and Subtitles Deletion\nDeeply optimizes your video quality by adjusting all video/audio parameter. Easily to remove or choose subtitles for output videos.\n\nAnalyzes DVD and Skips Corrupt Track with Better Fault Tolerance and Compatibility\nAutomatically reads and analyzes your DVD, then skips the corrupt tracks fast and smoothly with excellent fault tolerance and compatibility.\n\nEasy to use and Fastest Conversion Speed\nWith the fastest conversion speed (up to 300%-500%), one click is all you need to do to rip and converter DVD movies.","torrent":{"xt":"urn:btih:f7ab52d16c95857920903ab49d5562831b6f9be2","amp;dn":"Fast+DVD+Ripper+Pro+v1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7ab52d16c95857920903ab49d5562831b6f9be2","infoHashBuffer":{"type":"Buffer","data":[247,171,82,209,108,149,133,121,32,144,58,180,157,85,98,131,27,111,155,226]},"announce":[],"urlList":[]}}