{"title":"Sexually Broken--Flexible big breasted Penny Pax in brutal back ","uid":9335063,"size":745807624,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:fa7648f457c334ecbc504947650af965eda1c638&amp;dn=Sexually+Broken--Flexible+big+breasted+Penny+Pax+in+brutal+back+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":-1,"time":1386838407,"description":"Flexible big breasted Penny Pax in a brutal back arch, shackled to a sybian &amp; made to worship cock! | Penny Pax | Matt Williams\n\nDecember 11, 2013\n\n\nMP4 only\n\n\nTiny little red headed Penny Pax brings full natural breasts and a completely perverted mind to the table. She is flexible, she is willing to see just how far she can push herself, and she is a natural born freak. This isn't a girl here for the paycheck, she truly loves this stuff.\n\nWe appreciate bendy girls here at Sexuallybroken and today we are going to see just how far we can push her. We start out with Penny on her stomach in a severe arch with her toes tied to her hair. The world's most powerful vibrator, the legendary sybian, is firmly wedged between her thighs. The sybian rips out orgasm after orgasm out of pussies, even if they are tired or sore or not ready yet. They WILL cum. Today we are going to challenge Penny's ability to multitask. How good is she at sucking dick while the world's largest vibrator works its magic between her legs?\n\nThe strain of the arch is already rippling through her when we introduce 10 massive inches of BBC down her throat hole. There is nothing cuter then a pair of big blue eyes straining around a giant cock. The dick completely fills up her face, cutting off the air. Penny is already dizzy and out of breath from the multiple orgasms that the sybian is ripping out of her bound body, and the cock onslaught on her facehole slides her into sexual subspace. Two different dicks run tag team on her face without mercy as she gasps helplessly. \n\nIt is just that simple. Strenuous bondage, multiple orgasms and brutal blow jobs. 3 things, that when combined, are an unbeatable mix. You can actually see as Penny's eyes glaze over and her brain melts into mush. She is reduced to a cock sheath who's sole purpose is to worship whatever dick comes her way. We use her until we have had our fill, and then just walk away, leaving her soaked in drool, sweat and her own cum. We turn up the sybian full blast before we leave. Let's see just how many more orgasms we can wring out of that helpless pussy, shall we?  \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_11ppax6/SexuallyBroken-Penny-Pax-Matt-Williams-Flexible-big-breasted-Penny-Pax-in-a-brutal-back-arch-shackled-to-a-sybian--made-to-worship-cock.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/12_11ppax6/SexuallyBroken-Penny-Pax-Matt-Williams-Flexible-big-breasted-Penny-Pax-in-a-brutal-back-arch-shackled-to-a-sybian--made-to-worship-cock.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:fa7648f457c334ecbc504947650af965eda1c638","amp;dn":"Sexually+Broken--Flexible+big+breasted+Penny+Pax+in+brutal+back+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa7648f457c334ecbc504947650af965eda1c638","infoHashBuffer":{"type":"Buffer","data":[250,118,72,244,87,195,52,236,188,80,73,71,101,10,249,101,237,161,198,56]},"announce":[],"urlList":[]}}