{"title":"Al Gore: Alarming new slides depict a worsening climate crisis","uid":4887574,"size":26676175,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fc90b886c6e467dfa31f12f5ac4719ca44aa9f0b&amp;dn=Al+Gore%3A+Alarming+new+slides+depict+a+worsening+climate+crisis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1241801263,"description":"At TED2009, Al Gore presents updated slides from around the globe to make the case that worrying climate trends are even worse than scientists predicted, and to make clear his stance on &quot;clean coal.&quot;\n\nUnlike some in public office, Al Gore always intended to get something done, and since leaving Washington, DC -- following the tumultuous 2000 election -- he's still at it. In fact, his campaign for alerting the world to the dangers of climate change has only gained momentum. His Oscar-winning An Inconvenient Truth is the third most successful documentary ever released at the box office. Gore's famed PowerPoint presentation has drawn in a reluctant public, with its meticulously researched content and lucid style.\n\nMeanwhile, Gore himself has found his footing as a communicator. The once &quot;wooden&quot; style has given way to a warmth and humor that reveal the depth of his experience as a soldier, congressman, senator, veep, TV executive, teacher and author. Arguably, Gore is better positioned today than he has ever been to affect the future of our environment and world.\n\nHe was awarded the Nobel Peace Prize for 2007, along with the Intergovernmental Panel on Climate Change (IPCC), &quot;for their efforts to build up and disseminate greater knowledge about man-made climate change, and to lay the foundations for the measures that are needed to counteract such change.&quot;\n\n    &quot;The only vice president ever to mock his stiff image by [imitating] a wax-museum figure, Gore turns out to be the best professor you never had -- easygoing, knowledgeable and funny.&quot;\n\nRolling Stone\n\n_____________________________________________________________________________________________\n\nLeave a comment and please seed back :D","torrent":{"xt":"urn:btih:fc90b886c6e467dfa31f12f5ac4719ca44aa9f0b","amp;dn":"Al+Gore%3A+Alarming+new+slides+depict+a+worsening+climate+crisis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc90b886c6e467dfa31f12f5ac4719ca44aa9f0b","infoHashBuffer":{"type":"Buffer","data":[252,144,184,134,198,228,103,223,163,31,18,245,172,71,25,202,68,170,159,11]},"announce":[],"urlList":[]}}