{"title":"The Pacific (2010) DVD 2 Afl.3+4 NLT-Release","uid":5774106,"size":3173454690,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fd7bf5ed414aefa3a2e7bb1668f5b8895cf3807e&amp;dn=The+Pacific+%282010%29+DVD+2+Afl.3%2B4+NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Nlt-Release-XX-Men","files":-1,"time":1282216690,"description":"The Pacific (2010) DVD 2 Afl.3+4 NLT-Release\n\n\n[url=http://www.imdb.com/title/tt0374463/]IMDB[/url]\nGenre: Oorlog, Drama\nActeurs: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts\n\nPlot: \nDe productie van The Pacific is op 13 augustus 2007 begonnen in AustraliÃƒÂ«. Filmlocaties zijn onder andere de omgeving van Port Douglas, Melbourne en Victoria.[1] De serie heeft een budget van meer dan $200 miljoen en is daarmee de duurste ooit gemaakt in AustraliÃƒÂ«.\n\nDe verhaallijn van The Pacific, geschreven door Hugh Ambrose, staat los van die van Band of Brothers en is voornamelijk gebaseerd op twee memoires van Amerikaanse mariniers: With the Old Breed van Eugene Sledge en Helmet for my Pillow van Robert Leckie. De serie zal het verhaal vertellen van de twee auteurs en marinier John Basilone, die deelnamen aan de oorlog tegen het Japanse Keizerrijk.\n\n3. Deel 3 - De mariniers komen na vier maanden op Guadalcanal voor herstel aan in Melbourne. Basilone wordt onderscheiden met de Medal of Honor en hij keert kort daarna op verzoek terug naar de Verenigde Staten voor het ondersteunen van de verkoop van Amerikaanse oorlogsobligaties.\n4. Deel 4 - Leckie keert terug naar de Salomons-eilanden en de Bismarck-archipel voor het vervolg van de strijd tegen Japan. Sledge begint aan zijn basistraining.\n\nGenre: War Drama \nActors: Joseph Mazzello, James Badge Dale, Jon Seda, Chris Milligan, Ashton Holmes, Josh Helman, Martin McCann, Keith Nobbs, Toby Leonard Moore, Tom Hanks, Jacob Pitts \n\nPlot: \nThe production of The Pacific on August 13, 2007 began in Australia. Film locations include the area of Port Douglas, Melbourne and Victoria. [1] The series has a budget of more than $ 200 million, making it the most expensive ever made in Australia. \n\nThe storyline of The Pacific, written by Hugh Ambrose, is separate from that of Band of Brothers is based primarily on two memoirs by U.S. Marines: With the Old Breed by Eugene Sledge and Helmet for My Pillow by Robert Leckie. The series will tell the story of the two authors and Marine John Basilone, who participated in the war against the Japanese Empire. \n\n3. Part 3 - The Marines on Guadalcanal come after four months of rehabilitation in Melbourne. Basilone is awarded the Medal of Honor, and he returns shortly afterwards at the request back to the United States to support the sale of U.S. war bonds. \n4. Part 4 - Leckie returned to the Solomon Islands and the Bismarck Archipelago for the continuation of the struggle against Japan. Sledge begins his basic training.\n\nBron: HD\nOndertiteling: Nederlands\nGesproken taal: Engels\nMenu: Nee\nExtras: Nee\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nTV Shows/Series\nOorlog\n \n\nEnjoy the movie\n","torrent":{"xt":"urn:btih:fd7bf5ed414aefa3a2e7bb1668f5b8895cf3807e","amp;dn":"The+Pacific+%282010%29+DVD+2+Afl.3%2B4+NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd7bf5ed414aefa3a2e7bb1668f5b8895cf3807e","infoHashBuffer":{"type":"Buffer","data":[253,123,245,237,65,74,239,163,162,231,187,22,104,245,184,137,92,243,128,126]},"announce":[],"urlList":[]}}