{"title":"Allen-What a Way to Run a Railroad(railroad monopoly in America)","uid":4746775,"size":572523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fd88b9b85b943b5f327ad79960af6ace41b6f860&amp;dn=Allen-What+a+Way+to+Run+a+Railroad%28railroad+monopoly+in+America%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1235925812,"description":"This is Gary Allen's amazing booklet What a Way to Run a Railroad (1976) which exposes the railroad monopoly in America. Traditionally the first step in nationalizing industry has been a takeover of the railroads. Today, almost all of the major railroads of the world are owned by governments. While service varies from good to atrocious, all are plagued by perennial deficits. The U.S. railroads, with all their union-inspired featherbedding, employ 2.7 employees for each mile of track. But in those countries where the government operates the railroads the number of workers required for each mile of track is almost beyond belief. It takes 20.7 Englishmen. 12.9 Frenchmen. 22.1 Germans, and 19 Italians for each mile of track in their respective countries. Since featherbedding is the Number One problem with American railroads, it is clear that the government-owned railroad systems abroad represent Parkinson's Law run amok. In every instance, nationalization has created a bottomless pit into which the taxpayers have been required to pour an endless stream of money. Yet many of America's privately owned railroads are also staring financial disaster in the face. The primary reason is the unions, which exercise their political clout in Washington and the various state capitals to maintain inefficient and archaic work rules. Yet practically nobody, including railroad management, is advocating the abolition of feather-bedding to restore the nation's railways to financial health. Almost everybody is looking to the government to bail out the sinking railroads by putting the taxpayers in perpetual hock. The government is only too happy to comply and one can only say - what a way to run a railroad! 15 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:fd88b9b85b943b5f327ad79960af6ace41b6f860","amp;dn":"Allen-What+a+Way+to+Run+a+Railroad%28railroad+monopoly+in+America%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd88b9b85b943b5f327ad79960af6ace41b6f860","infoHashBuffer":{"type":"Buffer","data":[253,136,185,184,91,148,59,95,50,122,215,153,96,175,106,206,65,182,248,96]},"announce":[],"urlList":[]}}