{"title":"Campbell-Blood Behind Purple Curtain(Catholic persecution of Pro","uid":4988182,"size":526051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe7dd00e510ccd38416f3763b9e288dcf55d766c&amp;dn=Campbell-Blood+Behind+Purple+Curtain%28Catholic+persecution+of+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1246886374,"description":"This is Alan Campbell's shocking booklet Blood Behind the Purple Curtain - Horrific Evidence That Rome Still Persecutes Today which exposes the persecution of Protestants in Central and South America, particularly in Mexico. The Roman Catholic Church today makes use of the ecumenical and the interfaith movements to get her way, far more than she does of open and bloody persecution. Yes, she still causes wars and revolutions, which result in the deaths of tens of thousands, even millions; the massacre in Rwanda and the massacres of Serbians by Roman Catholic Croatians are two recent examples. But when it comes to dealing with Protestants, she usually prefers to subtly undermine and to infiltrate today. We are all well aware of the expressions &quot;Iron Curtain&quot; and &quot;Bamboo Curtain&quot; as used to describe those territories controlled either by Russian or Chinese Communism. These lands are largely closed to outsiders, and safe from exposure the Marxists are free to persecute and liquidate all opposition. Occasionally there is a gap in the Curtain, and as with the recent brutal massacre of student dissidents in Peking, we see what is really happening. There is another part of the world which is controlled by an equally totalitarian system - Roman Catholicism. Latin America lies behind a Purple Curtain as thick as anything erected by Marxism, and despite the denials of Ecumenists and Charismatics, despite the new image presented by Catholicism in Britain, the fact is that where Rome has power, she still persecutes today. 15 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:fe7dd00e510ccd38416f3763b9e288dcf55d766c","amp;dn":"Campbell-Blood+Behind+Purple+Curtain%28Catholic+persecution+of+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7dd00e510ccd38416f3763b9e288dcf55d766c","infoHashBuffer":{"type":"Buffer","data":[254,125,208,14,81,12,205,56,65,111,55,99,185,226,136,220,245,93,118,108]},"announce":[],"urlList":[]}}